[Killed] ConditionalExpression
src/lib/level-system.ts:95:7
   userLevel: number,
   skill: SkillType
 ): XPAward {
-  if (maxScore === 0) {
+  if (true) {
     return { skill, baseXP: 0, bonusXP: 0, totalXP: 0, reason: "No questions" };
   }
killedBy: calculateQuizXP calculates base XP as floor(percentage * 50)
statusReason: expected +0 to be 40 // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:95:23
   userLevel: number,
   skill: SkillType
 ): XPAward {
-  if (maxScore === 0) {
-    return { skill, baseXP: 0, bonusXP: 0, totalXP: 0, reason: "No questions" };
-  }
+  if (maxScore === 0) {}
 
   const percentage = score / maxScore;
killedBy: calculateQuizXP returns 0 XP when maxScore is 0
statusReason: expected NaN to be +0 // Object.is equality

[Killed] StringLiteral
src/lib/level-system.ts:96:64
   skill: SkillType
 ): XPAward {
   if (maxScore === 0) {
-    return { skill, baseXP: 0, bonusXP: 0, totalXP: 0, reason: "No questions" };
+    return { skill, baseXP: 0, bonusXP: 0, totalXP: 0, reason: "" };
   }
 
killedBy: calculateQuizXP returns 0 XP when maxScore is 0
statusReason: expected '' to be 'No questions' // Object.is equality

[Killed] ArithmeticOperator
src/lib/level-system.ts:99:22
     return { skill, baseXP: 0, bonusXP: 0, totalXP: 0, reason: "No questions" };
   }
 
-  const percentage = score / maxScore;
+  const percentage = score * maxScore;
   const reasons: string[] = [];
 
killedBy: calculateQuizXP calculates base XP as floor(percentage * 50)
statusReason: expected 1000 to be 40 // Object.is equality

[Killed] ArithmeticOperator
src/lib/level-system.ts:103:27
   const reasons: string[] = [];
 
   // Base XP: 10-50 depending on performance
-  let baseXP = Math.floor(percentage * 50);
+  let baseXP = Math.floor(percentage / 50);
   reasons.push(`${Math.round(percentage * 100)}% correct`);
 
killedBy: calculateQuizXP calculates base XP as floor(percentage * 50)
statusReason: expected 5 to be 40 // Object.is equality

[Survived] ArithmeticOperator
src/lib/level-system.ts:104:30
 
   // Base XP: 10-50 depending on performance
   let baseXP = Math.floor(percentage * 50);
-  reasons.push(`${Math.round(percentage * 100)}% correct`);
+  reasons.push(`${Math.round(percentage / 100)}% correct`);
 
   // Challenge bonus: Up to 50% bonus for harder content

[Killed] ArithmeticOperator
src/lib/level-system.ts:107:21
   reasons.push(`${Math.round(percentage * 100)}% correct`);
 
   // Challenge bonus: Up to 50% bonus for harder content
-  const levelDiff = contentLevel - userLevel;
+  const levelDiff = contentLevel + userLevel;
   let bonusXP = 0;
 
killedBy: calculateQuizXP reduces XP when content is too easy (4+ levels below)
statusReason: expected 50 to be 25 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:110:7
   const levelDiff = contentLevel - userLevel;
   let bonusXP = 0;
 
-  if (levelDiff > 0) {
+  if (levelDiff <= 0) {
     // Content is harder than user's level
     const challengeMultiplier = Math.min(levelDiff * 0.1, 0.5);
killedBy: calculateQuizXP awards challenge bonus when content is harder
statusReason: expected '100% correct, perfect score!' to contain 'challenge bonus'

[Killed] BlockStatement
src/lib/level-system.ts:110:22
   const levelDiff = contentLevel - userLevel;
   let bonusXP = 0;
 
-  if (levelDiff > 0) {
-    // Content is harder than user's level
-    const challengeMultiplier = Math.min(levelDiff * 0.1, 0.5);
-    bonusXP = Math.floor(baseXP * challengeMultiplier);
-    reasons.push(`+${Math.round(challengeMultiplier * 100)}% challenge bonus`);
-  } else if (levelDiff < -3) {
+  if (levelDiff > 0) {} else if (levelDiff < -3) {
     // Content is too easy (more than 3 levels below)
     baseXP = Math.floor(baseXP * 0.5);
killedBy: calculateQuizXP awards challenge bonus when content is harder
statusReason: expected '100% correct, perfect score!' to contain 'challenge bonus'

[Killed] MethodExpression
src/lib/level-system.ts:112:33
 
   if (levelDiff > 0) {
     // Content is harder than user's level
-    const challengeMultiplier = Math.min(levelDiff * 0.1, 0.5);
+    const challengeMultiplier = Math.max(levelDiff * 0.1, 0.5);
     bonusXP = Math.floor(baseXP * challengeMultiplier);
     reasons.push(`+${Math.round(challengeMultiplier * 100)}% challenge bonus`);
killedBy: calculateQuizXP caps challenge bonus at 50%
statusReason: expected 60 to be 35 // Object.is equality

[Survived] ArithmeticOperator
src/lib/level-system.ts:112:42
 
   if (levelDiff > 0) {
     // Content is harder than user's level
-    const challengeMultiplier = Math.min(levelDiff * 0.1, 0.5);
+    const challengeMultiplier = Math.min(levelDiff / 0.1, 0.5);
     bonusXP = Math.floor(baseXP * challengeMultiplier);
     reasons.push(`+${Math.round(challengeMultiplier * 100)}% challenge bonus`);

[Killed] ArithmeticOperator
src/lib/level-system.ts:113:26
   if (levelDiff > 0) {
     // Content is harder than user's level
     const challengeMultiplier = Math.min(levelDiff * 0.1, 0.5);
-    bonusXP = Math.floor(baseXP * challengeMultiplier);
+    bonusXP = Math.floor(baseXP / challengeMultiplier);
     reasons.push(`+${Math.round(challengeMultiplier * 100)}% challenge bonus`);
   } else if (levelDiff < -3) {
killedBy: calculateQuizXP caps challenge bonus at 50%
statusReason: expected 110 to be 35 // Object.is equality

[Survived] ArithmeticOperator
src/lib/level-system.ts:114:33
     // Content is harder than user's level
     const challengeMultiplier = Math.min(levelDiff * 0.1, 0.5);
     bonusXP = Math.floor(baseXP * challengeMultiplier);
-    reasons.push(`+${Math.round(challengeMultiplier * 100)}% challenge bonus`);
+    reasons.push(`+${Math.round(challengeMultiplier / 100)}% challenge bonus`);
   } else if (levelDiff < -3) {
     // Content is too easy (more than 3 levels below)

[Killed] EqualityOperator
src/lib/level-system.ts:115:14
     const challengeMultiplier = Math.min(levelDiff * 0.1, 0.5);
     bonusXP = Math.floor(baseXP * challengeMultiplier);
     reasons.push(`+${Math.round(challengeMultiplier * 100)}% challenge bonus`);
-  } else if (levelDiff < -3) {
+  } else if (levelDiff >= -3) {
     // Content is too easy (more than 3 levels below)
     baseXP = Math.floor(baseXP * 0.5);
killedBy: calculateQuizXP calculates base XP as floor(percentage * 50)
statusReason: expected 20 to be 40 // Object.is equality

[Killed] UnaryOperator
src/lib/level-system.ts:115:26
     const challengeMultiplier = Math.min(levelDiff * 0.1, 0.5);
     bonusXP = Math.floor(baseXP * challengeMultiplier);
     reasons.push(`+${Math.round(challengeMultiplier * 100)}% challenge bonus`);
-  } else if (levelDiff < -3) {
+  } else if (levelDiff < +3) {
     // Content is too easy (more than 3 levels below)
     baseXP = Math.floor(baseXP * 0.5);
killedBy: calculateQuizXP calculates base XP as floor(percentage * 50)
statusReason: expected 20 to be 40 // Object.is equality

[Killed] ArithmeticOperator
src/lib/level-system.ts:117:25
     reasons.push(`+${Math.round(challengeMultiplier * 100)}% challenge bonus`);
   } else if (levelDiff < -3) {
     // Content is too easy (more than 3 levels below)
-    baseXP = Math.floor(baseXP * 0.5);
+    baseXP = Math.floor(baseXP / 0.5);
     reasons.push("reduced (content too easy)");
   }
killedBy: calculateQuizXP reduces XP when content is too easy (4+ levels below)
statusReason: expected 100 to be 25 // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:122:42
   }
 
   // Perfect score bonus
-  if (percentage === 1 && maxScore >= 3) {
-    bonusXP += 10;
-    reasons.push("perfect score!");
-  }
+  if (percentage === 1 && maxScore >= 3) {}
 
   // Minimum XP for attempting (even if all wrong)
killedBy: calculateQuizXP caps challenge bonus at 50%
statusReason: expected 25 to be 35 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:122:27
   }
 
   // Perfect score bonus
-  if (percentage === 1 && maxScore >= 3) {
+  if (percentage === 1 && maxScore > 3) {
     bonusXP += 10;
     reasons.push("perfect score!");
killedBy: calculateQuizXP awards perfect score bonus for 100% on 3+ questions
statusReason: expected +0 to be 10 // Object.is equality

[Killed] AssignmentOperator
src/lib/level-system.ts:123:5
 
   // Perfect score bonus
   if (percentage === 1 && maxScore >= 3) {
-    bonusXP += 10;
+    bonusXP -= 10;
     reasons.push("perfect score!");
   }
killedBy: calculateQuizXP caps challenge bonus at 50%
statusReason: expected 15 to be 35 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:128:23
   }
 
   // Minimum XP for attempting (even if all wrong)
-  if (baseXP === 0 && maxScore > 0) {
+  if (baseXP === 0 && maxScore <= 0) {
     baseXP = 5;
     reasons.push("participation bonus");
killedBy: calculateQuizXP gives participation bonus (5 XP) when all answers wrong
statusReason: expected +0 to be 5 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:128:7
   }
 
   // Minimum XP for attempting (even if all wrong)
-  if (baseXP === 0 && maxScore > 0) {
+  if (baseXP !== 0 && maxScore > 0) {
     baseXP = 5;
     reasons.push("participation bonus");
killedBy: calculateQuizXP calculates base XP as floor(percentage * 50)
statusReason: expected 5 to be 40 // Object.is equality

[Killed] StringLiteral
src/lib/level-system.ts:130:18
   // Minimum XP for attempting (even if all wrong)
   if (baseXP === 0 && maxScore > 0) {
     baseXP = 5;
-    reasons.push("participation bonus");
+    reasons.push("");
   }
 
killedBy: calculateQuizXP gives participation bonus (5 XP) when all answers wrong
statusReason: expected '0% correct, ' to contain 'participation'

[Killed] ObjectLiteral
src/lib/level-system.ts:133:10
     reasons.push("participation bonus");
   }
 
-  return {
-    skill,
-    baseXP,
-    bonusXP,
-    totalXP: baseXP + bonusXP,
-    reason: reasons.join(", "),
-  };
+  return {};
 }
 
killedBy: calculateQuizXP calculates base XP as floor(percentage * 50)
statusReason: expected undefined to be 40 // Object.is equality

[Survived] ArithmeticOperator
src/lib/level-system.ts:137:14
     skill,
     baseXP,
     bonusXP,
-    totalXP: baseXP + bonusXP,
+    totalXP: baseXP - bonusXP,
     reason: reasons.join(", "),
   };

[Survived] ArrayDeclaration
src/lib/level-system.ts:151:29
   userLevel: number,
   completionPercentage: number
 ): XPAward {
-  const reasons: string[] = [];
+  const reasons: string[] = ["Stryker was here"];
 
   // Base XP: 1 XP per 50 words read

[Killed] ArithmeticOperator
src/lib/level-system.ts:154:27
   const reasons: string[] = [];
 
   // Base XP: 1 XP per 50 words read
-  let baseXP = Math.floor(wordsRead / 50);
+  let baseXP = Math.floor(wordsRead * 50);
   reasons.push(`${wordsRead} words read`);
 
killedBy: calculateReadingXP calculates base XP as 1 per 50 words
statusReason: expected 12500 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:158:7
   reasons.push(`${wordsRead} words read`);
 
   // Completion bonus
-  if (completionPercentage >= 95) {
+  if (true) {
     baseXP += 15;
     reasons.push("completed");
killedBy: calculateReadingXP calculates base XP as 1 per 50 words
statusReason: expected 20 to be 5 // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:158:35
   reasons.push(`${wordsRead} words read`);
 
   // Completion bonus
-  if (completionPercentage >= 95) {
-    baseXP += 15;
-    reasons.push("completed");
-  } else if (completionPercentage >= 50) {
+  if (completionPercentage >= 95) {} else if (completionPercentage >= 50) {
     baseXP += 5;
     reasons.push(`${Math.round(completionPercentage)}% progress`);
killedBy: calculateReadingXP awards +15 completion bonus for >= 95%
statusReason: expected 2 to be 17 // Object.is equality

[Killed] AssignmentOperator
src/lib/level-system.ts:159:5
 
   // Completion bonus
   if (completionPercentage >= 95) {
-    baseXP += 15;
+    baseXP -= 15;
     reasons.push("completed");
   } else if (completionPercentage >= 50) {
killedBy: calculateReadingXP awards +15 completion bonus for >= 95%
statusReason: expected -13 to be 17 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:161:14
   if (completionPercentage >= 95) {
     baseXP += 15;
     reasons.push("completed");
-  } else if (completionPercentage >= 50) {
+  } else if (completionPercentage < 50) {
     baseXP += 5;
     reasons.push(`${Math.round(completionPercentage)}% progress`);
killedBy: calculateReadingXP calculates base XP as 1 per 50 words
statusReason: expected 10 to be 5 // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:161:42
   if (completionPercentage >= 95) {
     baseXP += 15;
     reasons.push("completed");
-  } else if (completionPercentage >= 50) {
-    baseXP += 5;
-    reasons.push(`${Math.round(completionPercentage)}% progress`);
-  }
+  } else if (completionPercentage >= 50) {}
 
   // Challenge bonus for harder content
killedBy: calculateReadingXP awards +5 progress bonus for >= 50%
statusReason: expected 2 to be 7 // Object.is equality

[Killed] AssignmentOperator
src/lib/level-system.ts:162:5
     baseXP += 15;
     reasons.push("completed");
   } else if (completionPercentage >= 50) {
-    baseXP += 5;
+    baseXP -= 5;
     reasons.push(`${Math.round(completionPercentage)}% progress`);
   }
killedBy: calculateReadingXP awards +5 progress bonus for >= 50%
statusReason: expected -3 to be 7 // Object.is equality

[Killed] StringLiteral
src/lib/level-system.ts:163:18
     reasons.push("completed");
   } else if (completionPercentage >= 50) {
     baseXP += 5;
-    reasons.push(`${Math.round(completionPercentage)}% progress`);
+    reasons.push(``);
   }
 
killedBy: calculateReadingXP awards +5 progress bonus for >= 50%
statusReason: expected '100 words read, ' to contain 'progress'

[Survived] ArithmeticOperator
src/lib/level-system.ts:167:21
   }
 
   // Challenge bonus for harder content
-  const levelDiff = contentLevel - userLevel;
+  const levelDiff = contentLevel + userLevel;
   let bonusXP = 0;
 

[Killed] BlockStatement
src/lib/level-system.ts:170:22
   const levelDiff = contentLevel - userLevel;
   let bonusXP = 0;
 
-  if (levelDiff > 0) {
-    bonusXP = Math.floor(baseXP * Math.min(levelDiff * 0.1, 0.3));
-    reasons.push("challenge bonus");
-  }
+  if (levelDiff > 0) {}
 
   return {
killedBy: calculateReadingXP awards challenge bonus for harder content
statusReason: expected 0 to be greater than 0

[Survived] MethodExpression
src/lib/level-system.ts:171:35
   let bonusXP = 0;
 
   if (levelDiff > 0) {
-    bonusXP = Math.floor(baseXP * Math.min(levelDiff * 0.1, 0.3));
+    bonusXP = Math.floor(baseXP * Math.max(levelDiff * 0.1, 0.3));
     reasons.push("challenge bonus");
   }

[Survived] ArithmeticOperator
src/lib/level-system.ts:171:44
   let bonusXP = 0;
 
   if (levelDiff > 0) {
-    bonusXP = Math.floor(baseXP * Math.min(levelDiff * 0.1, 0.3));
+    bonusXP = Math.floor(baseXP * Math.min(levelDiff / 0.1, 0.3));
     reasons.push("challenge bonus");
   }

[Killed] ObjectLiteral
src/lib/level-system.ts:175:10
     reasons.push("challenge bonus");
   }
 
-  return {
-    skill: "reading",
-    baseXP,
-    bonusXP,
-    totalXP: baseXP + bonusXP,
-    reason: reasons.join(", "),
-  };
+  return {};
 }
 
killedBy: calculateReadingXP calculates base XP as 1 per 50 words
statusReason: expected undefined to be 5 // Object.is equality

[Killed] StringLiteral
src/lib/level-system.ts:176:12
   }
 
   return {
-    skill: "reading",
+    skill: "",
     baseXP,
     bonusXP,
killedBy: calculateReadingXP skill is always 'reading'
statusReason: expected '' to be 'reading' // Object.is equality

[Survived] StringLiteral
src/lib/level-system.ts:180:26
     baseXP,
     bonusXP,
     totalXP: baseXP + bonusXP,
-    reason: reasons.join(", "),
+    reason: reasons.join(""),
   };
 }

[Killed] ArithmeticOperator
src/lib/level-system.ts:202:12
   addedXP: number
 ): LevelUpResult {
   let level = currentLevel;
-  let xp = currentXP + addedXP;
+  let xp = currentXP - addedXP;
   let levelsGained = 0;
   const startingCEFR = numericLevelToCEFR(currentLevel);
killedBy: checkLevelUp does not level up when XP is insufficient
statusReason: expected -50 to be 50 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:207:31
   const startingCEFR = numericLevelToCEFR(currentLevel);
 
   // Process level-ups (can gain multiple levels at once)
-  while (level < MAX_LEVEL && xp >= XP_PER_LEVEL[level]) {
+  while (level < MAX_LEVEL && xp > XP_PER_LEVEL[level]) {
     xp -= XP_PER_LEVEL[level];
     level++;
killedBy: checkLevelUp levels up when XP meets threshold exactly
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:207:31
   const startingCEFR = numericLevelToCEFR(currentLevel);
 
   // Process level-ups (can gain multiple levels at once)
-  while (level < MAX_LEVEL && xp >= XP_PER_LEVEL[level]) {
+  while (level < MAX_LEVEL && xp < XP_PER_LEVEL[level]) {
     xp -= XP_PER_LEVEL[level];
     level++;
killedBy: checkLevelUp does not level up when XP is insufficient
statusReason: expected true to be false // Object.is equality

[Killed] AssignmentOperator
src/lib/level-system.ts:208:5
 
   // Process level-ups (can gain multiple levels at once)
   while (level < MAX_LEVEL && xp >= XP_PER_LEVEL[level]) {
-    xp -= XP_PER_LEVEL[level];
+    xp += XP_PER_LEVEL[level];
     level++;
     levelsGained++;
killedBy: checkLevelUp levels up when XP meets threshold exactly
statusReason: expected 20 to be 2 // Object.is equality

[Killed] UpdateOperator
src/lib/level-system.ts:209:5
   // Process level-ups (can gain multiple levels at once)
   while (level < MAX_LEVEL && xp >= XP_PER_LEVEL[level]) {
     xp -= XP_PER_LEVEL[level];
-    level++;
+    level--;
     levelsGained++;
   }
killedBy: checkLevelUp levels up when XP meets threshold exactly
statusReason: expected -1 to be 2 // Object.is equality

[Killed] UpdateOperator
src/lib/level-system.ts:210:5
   while (level < MAX_LEVEL && xp >= XP_PER_LEVEL[level]) {
     xp -= XP_PER_LEVEL[level];
     level++;
-    levelsGained++;
+    levelsGained--;
   }
 
killedBy: checkLevelUp levels up when XP meets threshold exactly
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:214:7
   }
 
   // Cap XP at max if already at max level
-  if (level >= MAX_LEVEL) {
+  if (level < MAX_LEVEL) {
     level = MAX_LEVEL;
   }
killedBy: checkLevelUp does not level up when XP is insufficient
statusReason: expected 20 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:214:7
   }
 
   // Cap XP at max if already at max level
-  if (level >= MAX_LEVEL) {
+  if (true) {
     level = MAX_LEVEL;
   }
killedBy: checkLevelUp does not level up when XP is insufficient
statusReason: expected 20 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:219:31
   }
 
   const newCEFR = numericLevelToCEFR(level);
-  const crossedCEFRBoundary = startingCEFR !== newCEFR;
+  const crossedCEFRBoundary = false;
 
   return {
killedBy: checkLevelUp detects CEFR boundary crossing
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:219:31
   }
 
   const newCEFR = numericLevelToCEFR(level);
-  const crossedCEFRBoundary = startingCEFR !== newCEFR;
+  const crossedCEFRBoundary = startingCEFR === newCEFR;
 
   return {
killedBy: checkLevelUp detects CEFR boundary crossing
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/level-system.ts:221:10
   const newCEFR = numericLevelToCEFR(level);
   const crossedCEFRBoundary = startingCEFR !== newCEFR;
 
-  return {
-    newLevel: level,
-    remainingXP: xp,
-    leveledUp: levelsGained > 0,
-    levelsGained,
-    newCEFR,
-    crossedCEFRBoundary,
-  };
+  return {};
 }
 
killedBy: checkLevelUp does not level up when XP is insufficient
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:224:16
   return {
     newLevel: level,
     remainingXP: xp,
-    leveledUp: levelsGained > 0,
+    leveledUp: levelsGained <= 0,
     levelsGained,
     newCEFR,
killedBy: checkLevelUp does not level up when XP is insufficient
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:224:16
   return {
     newLevel: level,
     remainingXP: xp,
-    leveledUp: levelsGained > 0,
+    leveledUp: true,
     levelsGained,
     newCEFR,
killedBy: checkLevelUp does not level up when XP is insufficient
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:234:57
 /**
  * Get the XP required to reach the next level.
  */
-export function getXPToNextLevel(level: number): number {
-  if (level >= MAX_LEVEL) return 0;
-  return XP_PER_LEVEL[level];
-}
+export function getXPToNextLevel(level: number): number {}
 
 /**
killedBy: getXPToNextLevel returns correct threshold for level 1
statusReason: expected undefined to be 100 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:235:7
  * Get the XP required to reach the next level.
  */
 export function getXPToNextLevel(level: number): number {
-  if (level >= MAX_LEVEL) return 0;
+  if (level > MAX_LEVEL) return 0;
   return XP_PER_LEVEL[level];
 }
killedBy: getXPToNextLevel returns 0 at max level
statusReason: expected undefined to be +0 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:235:7
  * Get the XP required to reach the next level.
  */
 export function getXPToNextLevel(level: number): number {
-  if (level >= MAX_LEVEL) return 0;
+  if (level < MAX_LEVEL) return 0;
   return XP_PER_LEVEL[level];
 }
killedBy: getXPToNextLevel returns correct threshold for level 1
statusReason: expected +0 to be 100 // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:242:69
 /**
  * Get progress percentage towards next level.
  */
-export function getLevelProgress(level: number, xp: number): number {
-  if (level >= MAX_LEVEL) return 100;
-  const required = XP_PER_LEVEL[level];
-  if (required === 0) return 0;
-  return Math.min(Math.floor((xp / required) * 100), 100);
-}
+export function getLevelProgress(level: number, xp: number): number {}
 
 /**
killedBy: getLevelProgress returns 0% at 0 XP
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:243:7
  * Get progress percentage towards next level.
  */
 export function getLevelProgress(level: number, xp: number): number {
-  if (level >= MAX_LEVEL) return 100;
+  if (false) return 100;
   const required = XP_PER_LEVEL[level];
   if (required === 0) return 0;
killedBy: getLevelProgress returns 100% at max level
statusReason: expected NaN to be 100 // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:243:7
  * Get progress percentage towards next level.
  */
 export function getLevelProgress(level: number, xp: number): number {
-  if (level >= MAX_LEVEL) return 100;
+  if (true) return 100;
   const required = XP_PER_LEVEL[level];
   if (required === 0) return 0;
killedBy: getLevelProgress returns 0% at 0 XP
statusReason: expected 100 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:245:7
 export function getLevelProgress(level: number, xp: number): number {
   if (level >= MAX_LEVEL) return 100;
   const required = XP_PER_LEVEL[level];
-  if (required === 0) return 0;
+  if (true) return 0;
   return Math.min(Math.floor((xp / required) * 100), 100);
 }
killedBy: getLevelProgress returns 50% at half threshold
statusReason: expected +0 to be 50 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:245:7
 export function getLevelProgress(level: number, xp: number): number {
   if (level >= MAX_LEVEL) return 100;
   const required = XP_PER_LEVEL[level];
-  if (required === 0) return 0;
+  if (required !== 0) return 0;
   return Math.min(Math.floor((xp / required) * 100), 100);
 }
killedBy: getLevelProgress returns 50% at half threshold
statusReason: expected +0 to be 50 // Object.is equality

[Killed] MethodExpression
src/lib/level-system.ts:246:10
   if (level >= MAX_LEVEL) return 100;
   const required = XP_PER_LEVEL[level];
   if (required === 0) return 0;
-  return Math.min(Math.floor((xp / required) * 100), 100);
+  return Math.max(Math.floor(xp / required * 100), 100);
 }
 
killedBy: getLevelProgress returns 0% at 0 XP
statusReason: expected 100 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/lib/level-system.ts:246:30
   if (level >= MAX_LEVEL) return 100;
   const required = XP_PER_LEVEL[level];
   if (required === 0) return 0;
-  return Math.min(Math.floor((xp / required) * 100), 100);
+  return Math.min(Math.floor(xp / required / 100), 100);
 }
 
killedBy: getLevelProgress returns 50% at half threshold
statusReason: expected +0 to be 50 // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:252:78
 /**
  * Calculate total XP accumulated across all levels.
  */
-export function getTotalXPForLevel(level: number, currentXP: number): number {
-  let total = currentXP;
-  for (let i = 1; i < level; i++) {
-    total += XP_PER_LEVEL[i];
-  }
-  return total;
-}
+export function getTotalXPForLevel(level: number, currentXP: number): number {}
 
 // ============================================================================
killedBy: getTotalXPForLevel at level 1 with 50 XP returns 50
statusReason: expected undefined to be 50 // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:254:19
  */
 export function getTotalXPForLevel(level: number, currentXP: number): number {
   let total = currentXP;
-  for (let i = 1; i < level; i++) {
+  for (let i = 1; false; i++) {
     total += XP_PER_LEVEL[i];
   }
killedBy: getTotalXPForLevel at level 3 with 0 XP returns sum of levels 1+2 thresholds
statusReason: expected +0 to be 250 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:254:19
  */
 export function getTotalXPForLevel(level: number, currentXP: number): number {
   let total = currentXP;
-  for (let i = 1; i < level; i++) {
+  for (let i = 1; i <= level; i++) {
     total += XP_PER_LEVEL[i];
   }
killedBy: getTotalXPForLevel at level 1 with 50 XP returns 50
statusReason: expected 150 to be 50 // Object.is equality

[Killed] AssignmentOperator
src/lib/level-system.ts:255:5
 export function getTotalXPForLevel(level: number, currentXP: number): number {
   let total = currentXP;
   for (let i = 1; i < level; i++) {
-    total += XP_PER_LEVEL[i];
+    total -= XP_PER_LEVEL[i];
   }
   return total;
killedBy: getTotalXPForLevel at level 3 with 0 XP returns sum of levels 1+2 thresholds
statusReason: expected -250 to be 250 // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:281:73
  * @param currentLevel - User's current level (1-20)
  * @returns Target level after downgrade, or null if at minimum
  */
-export function getDowngradedLevel(currentLevel: number): number | null {
-  if (currentLevel <= 3) return null;   // A1 - cannot downgrade
-  if (currentLevel <= 6) return 3;      // A2 → A1 (max of A1)
-  if (currentLevel <= 10) return 6;     // B1 → A2
-  if (currentLevel <= 14) return 10;    // B2 → B1
-  if (currentLevel <= 17) return 14;    // C1 → B2
-  return 17;                            // C2 → C1
-}
+export function getDowngradedLevel(currentLevel: number): number | null {}
 
 /**
killedBy: getDowngradedLevel returns null for A1 levels (1-3)
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/lib/level-system.ts:282:7
  * @returns Target level after downgrade, or null if at minimum
  */
 export function getDowngradedLevel(currentLevel: number): number | null {
-  if (currentLevel <= 3) return null;   // A1 - cannot downgrade
+  if (false) return null;   // A1 - cannot downgrade
   if (currentLevel <= 6) return 3;      // A2 → A1 (max of A1)
   if (currentLevel <= 10) return 6;     // B1 → A2
killedBy: getDowngradedLevel returns null for A1 levels (1-3)
statusReason: expected 3 to be null

[Killed] EqualityOperator
src/lib/level-system.ts:282:7
  * @returns Target level after downgrade, or null if at minimum
  */
 export function getDowngradedLevel(currentLevel: number): number | null {
-  if (currentLevel <= 3) return null;   // A1 - cannot downgrade
+  if (currentLevel < 3) return null;   // A1 - cannot downgrade
   if (currentLevel <= 6) return 3;      // A2 → A1 (max of A1)
   if (currentLevel <= 10) return 6;     // B1 → A2
killedBy: getDowngradedLevel returns null for A1 levels (1-3)
statusReason: expected 3 to be null

[Killed] EqualityOperator
src/lib/level-system.ts:283:7
  */
 export function getDowngradedLevel(currentLevel: number): number | null {
   if (currentLevel <= 3) return null;   // A1 - cannot downgrade
-  if (currentLevel <= 6) return 3;      // A2 → A1 (max of A1)
+  if (currentLevel < 6) return 3;      // A2 → A1 (max of A1)
   if (currentLevel <= 10) return 6;     // B1 → A2
   if (currentLevel <= 14) return 10;    // B2 → B1
killedBy: getDowngradedLevel downgrades A2 → A1 max (3)
statusReason: expected 6 to be 3 // Object.is equality
