[Killed] EqualityOperator
src/lib/level-system.ts:283:7
  */
 export function getDowngradedLevel(currentLevel: number): number | null {
   if (currentLevel <= 3) return null;   // A1 - cannot downgrade
-  if (currentLevel <= 6) return 3;      // A2 → A1 (max of A1)
+  if (currentLevel > 6) return 3;      // A2 → A1 (max of A1)
   if (currentLevel <= 10) return 6;     // B1 → A2
   if (currentLevel <= 14) return 10;    // B2 → B1
killedBy: getDowngradedLevel downgrades A2 → A1 max (3)
statusReason: expected 6 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:284:7
 export function getDowngradedLevel(currentLevel: number): number | null {
   if (currentLevel <= 3) return null;   // A1 - cannot downgrade
   if (currentLevel <= 6) return 3;      // A2 → A1 (max of A1)
-  if (currentLevel <= 10) return 6;     // B1 → A2
+  if (false) return 6;     // B1 → A2
   if (currentLevel <= 14) return 10;    // B2 → B1
   if (currentLevel <= 17) return 14;    // C1 → B2
killedBy: getDowngradedLevel downgrades B1 → A2 max (6)
statusReason: expected 10 to be 6 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:284:7
 export function getDowngradedLevel(currentLevel: number): number | null {
   if (currentLevel <= 3) return null;   // A1 - cannot downgrade
   if (currentLevel <= 6) return 3;      // A2 → A1 (max of A1)
-  if (currentLevel <= 10) return 6;     // B1 → A2
+  if (currentLevel > 10) return 6;     // B1 → A2
   if (currentLevel <= 14) return 10;    // B2 → B1
   if (currentLevel <= 17) return 14;    // C1 → B2
killedBy: getDowngradedLevel downgrades B1 → A2 max (6)
statusReason: expected 10 to be 6 // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:285:7
   if (currentLevel <= 3) return null;   // A1 - cannot downgrade
   if (currentLevel <= 6) return 3;      // A2 → A1 (max of A1)
   if (currentLevel <= 10) return 6;     // B1 → A2
-  if (currentLevel <= 14) return 10;    // B2 → B1
+  if (true) return 10;    // B2 → B1
   if (currentLevel <= 17) return 14;    // C1 → B2
   return 17;                            // C2 → C1
killedBy: getDowngradedLevel downgrades C2 → C1 max (17)
statusReason: expected 10 to be 17 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:285:7
   if (currentLevel <= 3) return null;   // A1 - cannot downgrade
   if (currentLevel <= 6) return 3;      // A2 → A1 (max of A1)
   if (currentLevel <= 10) return 6;     // B1 → A2
-  if (currentLevel <= 14) return 10;    // B2 → B1
+  if (currentLevel > 14) return 10;    // B2 → B1
   if (currentLevel <= 17) return 14;    // C1 → B2
   return 17;                            // C2 → C1
killedBy: getDowngradedLevel downgrades C2 → C1 max (17)
statusReason: expected 10 to be 17 // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:286:7
   if (currentLevel <= 6) return 3;      // A2 → A1 (max of A1)
   if (currentLevel <= 10) return 6;     // B1 → A2
   if (currentLevel <= 14) return 10;    // B2 → B1
-  if (currentLevel <= 17) return 14;    // C1 → B2
+  if (currentLevel > 17) return 14;    // C1 → B2
   return 17;                            // C2 → C1
 }
killedBy: getDowngradedLevel downgrades C2 → C1 max (17)
statusReason: expected 14 to be 17 // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:286:7
   if (currentLevel <= 6) return 3;      // A2 → A1 (max of A1)
   if (currentLevel <= 10) return 6;     // B1 → A2
   if (currentLevel <= 14) return 10;    // B2 → B1
-  if (currentLevel <= 17) return 14;    // C1 → B2
+  if (true) return 14;    // C1 → B2
   return 17;                            // C2 → C1
 }
killedBy: getDowngradedLevel downgrades C2 → C1 max (17)
statusReason: expected 14 to be 17 // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:294:77
  * Get the previous CEFR tier for a given level.
  * Returns null if already at A1.
  */
-export function getPreviousCEFRTier(currentLevel: number): CEFRLevel | null {
-  const currentCEFR = numericLevelToCEFR(currentLevel);
-  const tierOrder: CEFRLevel[] = ["A1", "A2", "B1", "B2", "C1", "C2"];
-  const currentIndex = tierOrder.indexOf(currentCEFR);
-  if (currentIndex <= 0) return null;
-  return tierOrder[currentIndex - 1];
-}
+export function getPreviousCEFRTier(currentLevel: number): CEFRLevel | null {}
 
 // ============================================================================
killedBy: getPreviousCEFRTier returns null for A1
statusReason: expected undefined to be null

[Killed] ArrayDeclaration
src/lib/level-system.ts:296:34
  */
 export function getPreviousCEFRTier(currentLevel: number): CEFRLevel | null {
   const currentCEFR = numericLevelToCEFR(currentLevel);
-  const tierOrder: CEFRLevel[] = ["A1", "A2", "B1", "B2", "C1", "C2"];
+  const tierOrder: CEFRLevel[] = [];
   const currentIndex = tierOrder.indexOf(currentCEFR);
   if (currentIndex <= 0) return null;
killedBy: getPreviousCEFRTier returns A1 for A2 level
statusReason: expected null to be 'A1' // Object.is equality

[Killed] StringLiteral
src/lib/level-system.ts:296:35
  */
 export function getPreviousCEFRTier(currentLevel: number): CEFRLevel | null {
   const currentCEFR = numericLevelToCEFR(currentLevel);
-  const tierOrder: CEFRLevel[] = ["A1", "A2", "B1", "B2", "C1", "C2"];
+  const tierOrder: CEFRLevel[] = ["", "A2", "B1", "B2", "C1", "C2"];
   const currentIndex = tierOrder.indexOf(currentCEFR);
   if (currentIndex <= 0) return null;
killedBy: getPreviousCEFRTier returns A1 for A2 level
statusReason: expected '' to be 'A1' // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:298:7
   const currentCEFR = numericLevelToCEFR(currentLevel);
   const tierOrder: CEFRLevel[] = ["A1", "A2", "B1", "B2", "C1", "C2"];
   const currentIndex = tierOrder.indexOf(currentCEFR);
-  if (currentIndex <= 0) return null;
+  if (false) return null;
   return tierOrder[currentIndex - 1];
 }
killedBy: getPreviousCEFRTier returns null for A1
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/lib/level-system.ts:298:7
   const currentCEFR = numericLevelToCEFR(currentLevel);
   const tierOrder: CEFRLevel[] = ["A1", "A2", "B1", "B2", "C1", "C2"];
   const currentIndex = tierOrder.indexOf(currentCEFR);
-  if (currentIndex <= 0) return null;
+  if (true) return null;
   return tierOrder[currentIndex - 1];
 }
killedBy: getPreviousCEFRTier returns A1 for A2 level
statusReason: expected null to be 'A1' // Object.is equality

[Killed] ArithmeticOperator
src/lib/level-system.ts:299:20
   const tierOrder: CEFRLevel[] = ["A1", "A2", "B1", "B2", "C1", "C2"];
   const currentIndex = tierOrder.indexOf(currentCEFR);
   if (currentIndex <= 0) return null;
-  return tierOrder[currentIndex - 1];
+  return tierOrder[currentIndex + 1];
 }
 
killedBy: getPreviousCEFRTier returns A1 for A2 level
statusReason: expected 'B1' to be 'A1' // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:309:80
 /**
  * Calculate the weighted overall level from individual skill levels.
  */
-export function calculateWeightedOverallLevel(skills: UserSkillLevels): number {
-  return Math.floor(
-    skills.reading_level * skills.reading_weight +
-      skills.vocabulary_level * skills.vocabulary_weight +
-      skills.grammar_level * skills.grammar_weight
-  );
-}
+export function calculateWeightedOverallLevel(skills: UserSkillLevels): number {}
 
 /**
killedBy: calculateWeightedOverallLevel calculates weighted floor correctly
statusReason: expected undefined to be 8 // Object.is equality

[Killed] ArithmeticOperator
src/lib/level-system.ts:311:5
  */
 export function calculateWeightedOverallLevel(skills: UserSkillLevels): number {
   return Math.floor(
-    skills.reading_level * skills.reading_weight +
-      skills.vocabulary_level * skills.vocabulary_weight +
-      skills.grammar_level * skills.grammar_weight
+    skills.reading_level * skills.reading_weight + skills.vocabulary_level * skills.vocabulary_weight - skills.grammar_level * skills.grammar_weight
   );
 }
killedBy: calculateWeightedOverallLevel calculates weighted floor correctly
statusReason: expected 4 to be 8 // Object.is equality

[Killed] ArithmeticOperator
src/lib/level-system.ts:311:5
  */
 export function calculateWeightedOverallLevel(skills: UserSkillLevels): number {
   return Math.floor(
-    skills.reading_level * skills.reading_weight +
+    skills.reading_level / skills.reading_weight +
       skills.vocabulary_level * skills.vocabulary_weight +
       skills.grammar_level * skills.grammar_weight
killedBy: calculateWeightedOverallLevel calculates weighted floor correctly
statusReason: expected 34 to be 8 // Object.is equality

[Killed] ArithmeticOperator
src/lib/level-system.ts:312:7
 export function calculateWeightedOverallLevel(skills: UserSkillLevels): number {
   return Math.floor(
     skills.reading_level * skills.reading_weight +
-      skills.vocabulary_level * skills.vocabulary_weight +
+      skills.vocabulary_level / skills.vocabulary_weight +
       skills.grammar_level * skills.grammar_weight
   );
killedBy: calculateWeightedOverallLevel calculates weighted floor correctly
statusReason: expected 29 to be 8 // Object.is equality

[Killed] ArithmeticOperator
src/lib/level-system.ts:313:7
   return Math.floor(
     skills.reading_level * skills.reading_weight +
       skills.vocabulary_level * skills.vocabulary_weight +
-      skills.grammar_level * skills.grammar_weight
+      skills.grammar_level / skills.grammar_weight
   );
 }
killedBy: calculateWeightedOverallLevel calculates weighted floor correctly
statusReason: expected 24 to be 8 // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:320:68
 /**
  * Get the CEFR level for the overall weighted level.
  */
-export function getOverallCEFR(skills: UserSkillLevels): CEFRLevel {
-  const overall = calculateWeightedOverallLevel(skills);
-  return numericLevelToCEFR(overall);
-}
+export function getOverallCEFR(skills: UserSkillLevels): CEFRLevel {}
 
 // ============================================================================
killedBy: calculateWeightedOverallLevel getOverallCEFR returns correct CEFR for weighted level
statusReason: expected undefined to be 'B1' // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:339:27
 export function suggestContentLevel(
   skills: UserSkillLevels,
   focusSkill?: SkillType
-): ContentLevelSuggestion {
-  let baseLevel: number;
-
-  if (focusSkill) {
-    // Use the specific skill level
-    baseLevel = skills[`${focusSkill}_level` as keyof UserSkillLevels] as number;
-  } else {
-    // Use overall weighted level
-    baseLevel = calculateWeightedOverallLevel(skills);
-  }
-
-  // Allow content slightly below to slightly above user's level
-  const minLevel = Math.max(1, baseLevel - 2);
-  const maxLevel = Math.min(MAX_LEVEL, baseLevel + 2);
-
-  return {
-    minLevel,
-    maxLevel,
-    idealLevel: baseLevel,
-    cefrRange: {
-      min: numericLevelToCEFR(minLevel),
-      max: numericLevelToCEFR(maxLevel),
-    },
-  };
-}
+): ContentLevelSuggestion {}
 
 /**
killedBy: suggestContentLevel suggests range ±2 around overall level
statusReason: Cannot read properties of undefined (reading 'idealLevel')

[Killed] ConditionalExpression
src/lib/level-system.ts:342:7
 ): ContentLevelSuggestion {
   let baseLevel: number;
 
-  if (focusSkill) {
+  if (true) {
     // Use the specific skill level
     baseLevel = skills[`${focusSkill}_level` as keyof UserSkillLevels] as number;
killedBy: suggestContentLevel suggests range ±2 around overall level
statusReason: expected undefined to be 8 // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:342:19
 ): ContentLevelSuggestion {
   let baseLevel: number;
 
-  if (focusSkill) {
-    // Use the specific skill level
-    baseLevel = skills[`${focusSkill}_level` as keyof UserSkillLevels] as number;
-  } else {
+  if (focusSkill) {} else {
     // Use overall weighted level
     baseLevel = calculateWeightedOverallLevel(skills);
killedBy: suggestContentLevel uses specific skill level when focusSkill provided
statusReason: expected undefined to be 10 // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:345:10
   if (focusSkill) {
     // Use the specific skill level
     baseLevel = skills[`${focusSkill}_level` as keyof UserSkillLevels] as number;
-  } else {
-    // Use overall weighted level
-    baseLevel = calculateWeightedOverallLevel(skills);
-  }
+  } else {}
 
   // Allow content slightly below to slightly above user's level
killedBy: suggestContentLevel suggests range ±2 around overall level
statusReason: expected undefined to be 8 // Object.is equality

[Killed] ArithmeticOperator
src/lib/level-system.ts:351:32
   }
 
   // Allow content slightly below to slightly above user's level
-  const minLevel = Math.max(1, baseLevel - 2);
+  const minLevel = Math.max(1, baseLevel + 2);
   const maxLevel = Math.min(MAX_LEVEL, baseLevel + 2);
 
killedBy: suggestContentLevel suggests range ±2 around overall level
statusReason: expected 10 to be 6 // Object.is equality

[Killed] MethodExpression
src/lib/level-system.ts:351:20
   }
 
   // Allow content slightly below to slightly above user's level
-  const minLevel = Math.max(1, baseLevel - 2);
+  const minLevel = Math.min(1, baseLevel - 2);
   const maxLevel = Math.min(MAX_LEVEL, baseLevel + 2);
 
killedBy: suggestContentLevel suggests range ±2 around overall level
statusReason: expected 1 to be 6 // Object.is equality

[Killed] MethodExpression
src/lib/level-system.ts:352:20
 
   // Allow content slightly below to slightly above user's level
   const minLevel = Math.max(1, baseLevel - 2);
-  const maxLevel = Math.min(MAX_LEVEL, baseLevel + 2);
+  const maxLevel = Math.max(MAX_LEVEL, baseLevel + 2);
 
   return {
killedBy: suggestContentLevel suggests range ±2 around overall level
statusReason: expected 20 to be 10 // Object.is equality

[Killed] ArithmeticOperator
src/lib/level-system.ts:352:40
 
   // Allow content slightly below to slightly above user's level
   const minLevel = Math.max(1, baseLevel - 2);
-  const maxLevel = Math.min(MAX_LEVEL, baseLevel + 2);
+  const maxLevel = Math.min(MAX_LEVEL, baseLevel - 2);
 
   return {
killedBy: suggestContentLevel suggests range ±2 around overall level
statusReason: expected 6 to be 10 // Object.is equality

[Killed] ObjectLiteral
src/lib/level-system.ts:354:10
   const minLevel = Math.max(1, baseLevel - 2);
   const maxLevel = Math.min(MAX_LEVEL, baseLevel + 2);
 
-  return {
-    minLevel,
-    maxLevel,
-    idealLevel: baseLevel,
-    cefrRange: {
-      min: numericLevelToCEFR(minLevel),
-      max: numericLevelToCEFR(maxLevel),
-    },
-  };
+  return {};
 }
 
killedBy: suggestContentLevel suggests range ±2 around overall level
statusReason: expected undefined to be 8 // Object.is equality

[Killed] ArithmeticOperator
src/lib/level-system.ts:376:16
   contentLevel: number,
   userLevel: number
 ): { appropriate: boolean; reason: string; difficulty: "easy" | "appropriate" | "challenging" | "too_hard" } {
-  const diff = contentLevel - userLevel;
+  const diff = contentLevel + userLevel;
 
   if (diff < -4) {
killedBy: isContentAppropriate flags 'easy' when diff < -4
statusReason: expected 'too_hard' to be 'easy' // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:378:7
 ): { appropriate: boolean; reason: string; difficulty: "easy" | "appropriate" | "challenging" | "too_hard" } {
   const diff = contentLevel - userLevel;
 
-  if (diff < -4) {
+  if (false) {
     return {
       appropriate: false,
killedBy: isContentAppropriate flags 'easy' when diff < -4
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:378:7
 ): { appropriate: boolean; reason: string; difficulty: "easy" | "appropriate" | "challenging" | "too_hard" } {
   const diff = contentLevel - userLevel;
 
-  if (diff < -4) {
+  if (diff <= -4) {
     return {
       appropriate: false,
killedBy: isContentAppropriate returns appropriate=true for slightly easy (diff -3 to -4)
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/level-system.ts:379:12
   const diff = contentLevel - userLevel;
 
   if (diff < -4) {
-    return {
-      appropriate: false,
-      reason: "Content is too easy and won't help you progress",
-      difficulty: "easy",
-    };
+    return {};
   }
   if (diff > 4) {
killedBy: isContentAppropriate flags 'easy' when diff < -4
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/level-system.ts:380:20
 
   if (diff < -4) {
     return {
-      appropriate: false,
+      appropriate: true,
       reason: "Content is too easy and won't help you progress",
       difficulty: "easy",
killedBy: isContentAppropriate flags 'easy' when diff < -4
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/lib/level-system.ts:381:15
   if (diff < -4) {
     return {
       appropriate: false,
-      reason: "Content is too easy and won't help you progress",
+      reason: "",
       difficulty: "easy",
     };

[Killed] EqualityOperator
src/lib/level-system.ts:385:7
       difficulty: "easy",
     };
   }
-  if (diff > 4) {
+  if (diff <= 4) {
     return {
       appropriate: false,
killedBy: isContentAppropriate flags 'too_hard' when diff > 4
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:385:17
       difficulty: "easy",
     };
   }
-  if (diff > 4) {
-    return {
-      appropriate: false,
-      reason: "Content is too difficult for your current level",
-      difficulty: "too_hard",
-    };
-  }
+  if (diff > 4) {}
   if (diff >= -2 && diff <= 0) {
     return {
killedBy: isContentAppropriate flags 'too_hard' when diff > 4
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/lib/level-system.ts:386:12
     };
   }
   if (diff > 4) {
-    return {
-      appropriate: false,
-      reason: "Content is too difficult for your current level",
-      difficulty: "too_hard",
-    };
+    return {};
   }
   if (diff >= -2 && diff <= 0) {
killedBy: isContentAppropriate flags 'too_hard' when diff > 4
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:392:21
       difficulty: "too_hard",
     };
   }
-  if (diff >= -2 && diff <= 0) {
+  if (diff >= -2 && diff > 0) {
     return {
       appropriate: true,
killedBy: isContentAppropriate returns 'appropriate' when diff is -2 to 0
statusReason: expected 'easy' to be 'appropriate' // Object.is equality

[Killed] EqualityOperator
src/lib/level-system.ts:392:7
       difficulty: "too_hard",
     };
   }
-  if (diff >= -2 && diff <= 0) {
+  if (diff < -2 && diff <= 0) {
     return {
       appropriate: true,
killedBy: isContentAppropriate returns 'appropriate' when diff is -2 to 0
statusReason: expected 'easy' to be 'appropriate' // Object.is equality

[Survived] BooleanLiteral
src/lib/level-system.ts:394:20
   }
   if (diff >= -2 && diff <= 0) {
     return {
-      appropriate: true,
+      appropriate: false,
       reason: "Content matches your level well",
       difficulty: "appropriate",

[Killed] StringLiteral
src/lib/level-system.ts:396:19
     return {
       appropriate: true,
       reason: "Content matches your level well",
-      difficulty: "appropriate",
+      difficulty: "",
     };
   }
killedBy: isContentAppropriate returns 'appropriate' when diff is -2 to 0
statusReason: expected '' to be 'appropriate' // Object.is equality

[Killed] LogicalOperator
src/lib/level-system.ts:399:7
       difficulty: "appropriate",
     };
   }
-  if (diff > 0 && diff <= 2) {
+  if (diff > 0 || diff <= 2) {
     return {
       appropriate: true,
killedBy: isContentAppropriate returns appropriate=true for slightly easy (diff -3 to -4)
statusReason: expected 'challenging' to be 'easy' // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:399:7
       difficulty: "appropriate",
     };
   }
-  if (diff > 0 && diff <= 2) {
+  if (true) {
     return {
       appropriate: true,
killedBy: isContentAppropriate returns appropriate=true for slightly easy (diff -3 to -4)
statusReason: expected 'challenging' to be 'easy' // Object.is equality

[Survived] EqualityOperator
src/lib/level-system.ts:409:13
   // diff between -4 and -2, or between 2 and 4
   return {
     appropriate: true,
-    reason: diff < 0 ? "Content is slightly easy" : "Content is quite challenging",
+    reason: diff <= 0 ? "Content is slightly easy" : "Content is quite challenging",
     difficulty: diff < 0 ? "easy" : "challenging",
   };

[Survived] ConditionalExpression
src/lib/level-system.ts:409:13
   // diff between -4 and -2, or between 2 and 4
   return {
     appropriate: true,
-    reason: diff < 0 ? "Content is slightly easy" : "Content is quite challenging",
+    reason: true ? "Content is slightly easy" : "Content is quite challenging",
     difficulty: diff < 0 ? "easy" : "challenging",
   };

[Killed] EqualityOperator
src/lib/level-system.ts:410:17
   return {
     appropriate: true,
     reason: diff < 0 ? "Content is slightly easy" : "Content is quite challenging",
-    difficulty: diff < 0 ? "easy" : "challenging",
+    difficulty: diff >= 0 ? "easy" : "challenging",
   };
 }
killedBy: isContentAppropriate returns appropriate=true for slightly easy (diff -3 to -4)
statusReason: expected 'challenging' to be 'easy' // Object.is equality

[Killed] ConditionalExpression
src/lib/level-system.ts:410:17
   return {
     appropriate: true,
     reason: diff < 0 ? "Content is slightly easy" : "Content is quite challenging",
-    difficulty: diff < 0 ? "easy" : "challenging",
+    difficulty: false ? "easy" : "challenging",
   };
 }
killedBy: isContentAppropriate returns appropriate=true for slightly easy (diff -3 to -4)
statusReason: expected 'challenging' to be 'easy' // Object.is equality

[Killed] ObjectLiteral
src/lib/level-system.ts:469:6
 /** Detailed descriptions for each of the 20 levels */
 export const LEVEL_DESCRIPTIONS: Record<number, LevelDescription> = {
   // A1 - Absolute Beginner (Levels 1-3)
-  1: {
-    level: 1,
-    cefr: "A1",
-    title: "First Steps",
-    description: "Recognize the alphabet/script. Say 'hello' and 'thank you'. Count to 10.",
-  },
+  1: {},
   2: {
     level: 2,
killedBy: getLevelDescription returns correct description for level 1
statusReason: expected undefined to be 'First Steps' // Object.is equality

[Survived] StringLiteral
src/lib/level-system.ts:473:18
     level: 1,
     cefr: "A1",
     title: "First Steps",
-    description: "Recognize the alphabet/script. Say 'hello' and 'thank you'. Count to 10.",
+    description: "",
   },
   2: {

[Survived] StringLiteral
src/lib/level-system.ts:485:18
     level: 3,
     cefr: "A1",
     title: "Simple Interactions",
-    description: "Ask and answer simple questions ('Where is...?', 'How much?'). Order food by pointing and using single words. Recognize common signs.",
+    description: "",
   },
 

[Survived] StringLiteral
src/lib/level-system.ts:493:18
     level: 4,
     cefr: "A2",
     title: "Everyday Basics",
-    description: "Describe your family and home. Ask for directions and understand simple replies. Handle basic shopping situations.",
+    description: "",
   },
   5: {

[Survived] StringLiteral
src/lib/level-system.ts:503:11
   },
   6: {
     level: 6,
-    cefr: "A2",
+    cefr: "",
     title: "Getting Around",
     description: "Make simple travel arrangements (hotels, tickets). Describe past events in basic terms. Follow simple instructions and recipes.",

[Killed] StringLiteral
src/lib/level-system.ts:511:11
   // B1 - Intermediate (Levels 7-10)
   7: {
     level: 7,
-    cefr: "B1",
+    cefr: "",
     title: "Basic Conversations",
     description: "Hold a basic conversation on familiar topics. Understand the main points of clear TV/radio programs. Write personal letters describing experiences.",
killedBy: getDescriptionsForCEFR returns 4 descriptions for B1 (levels 7-10)
statusReason: expected [ Array(3) ] to have a length of 4 but got 3

[Killed] ObjectLiteral
src/lib/level-system.ts:515:6
     title: "Basic Conversations",
     description: "Hold a basic conversation on familiar topics. Understand the main points of clear TV/radio programs. Write personal letters describing experiences.",
   },
-  8: {
-    level: 8,
-    cefr: "B1",
-    title: "Expressing Opinions",
-    description: "Express opinions and explain your reasoning. Understand most of what's said at normal speed on familiar topics. Read straightforward factual texts.",
-  },
+  8: {},
   9: {
     level: 9,
killedBy: getDescriptionsForCEFR returns 4 descriptions for B1 (levels 7-10)
statusReason: expected [ Array(3) ] to have a length of 4 but got 3

[Killed] StringLiteral
src/lib/level-system.ts:517:11
   },
   8: {
     level: 8,
-    cefr: "B1",
+    cefr: "",
     title: "Expressing Opinions",
     description: "Express opinions and explain your reasoning. Understand most of what's said at normal speed on familiar topics. Read straightforward factual texts.",
killedBy: getDescriptionsForCEFR returns 4 descriptions for B1 (levels 7-10)
statusReason: expected [ Array(3) ] to have a length of 4 but got 3

[Survived] StringLiteral
src/lib/level-system.ts:518:12
   8: {
     level: 8,
     cefr: "B1",
-    title: "Expressing Opinions",
+    title: "",
     description: "Express opinions and explain your reasoning. Understand most of what's said at normal speed on familiar topics. Read straightforward factual texts.",
   },

[Survived] StringLiteral
src/lib/level-system.ts:525:18
     level: 9,
     cefr: "B1",
     title: "Independent Travel",
-    description: "Handle most travel situations without preparation. Follow TV shows and films with subtitles. Write connected text on topics of personal interest.",
+    description: "",
   },
   10: {

[Survived] ObjectLiteral
src/lib/level-system.ts:547:7
     title: "Fluent Interaction",
     description: "Communicate fluently with native speakers without strain for either party. Read novels adapted for learners. Understand specialized articles in your field.",
   },
-  13: {
-    level: 13,
-    cefr: "B2",
-    title: "Spontaneous Expression",
-    description: "Express yourself spontaneously without obvious searching for words. Follow complex lines of argument. Write detailed descriptions of real or imaginary events.",
-  },
+  13: {},
   14: {
     level: 14,

[Survived] StringLiteral
src/lib/level-system.ts:551:18
     level: 13,
     cefr: "B2",
     title: "Spontaneous Expression",
-    description: "Express yourself spontaneously without obvious searching for words. Follow complex lines of argument. Write detailed descriptions of real or imaginary events.",
+    description: "",
   },
   14: {

[Survived] StringLiteral
src/lib/level-system.ts:569:11
   },
   16: {
     level: 16,
-    cefr: "C1",
+    cefr: "",
     title: "Nuanced Understanding",
     description: "Use language flexibly for social, academic, and professional purposes. Recognize implicit meaning, irony, and humor. Produce detailed, well-organized text on complex subjects.",

[Survived] StringLiteral
src/lib/level-system.ts:571:18
     level: 16,
     cefr: "C1",
     title: "Nuanced Understanding",
-    description: "Use language flexibly for social, academic, and professional purposes. Recognize implicit meaning, irony, and humor. Produce detailed, well-organized text on complex subjects.",
+    description: "",
   },
   17: {

[Survived] ObjectLiteral
src/lib/level-system.ts:581:7
   },
 
   // C2 - Mastery (Levels 18-20)
-  18: {
-    level: 18,
-    cefr: "C2",
-    title: "Effortless Understanding",
-    description: "Understand with ease virtually everything heard or read. Summarize information from different sources, reconstructing arguments coherently.",
-  },
+  18: {},
   19: {
     level: 19,

[Survived] ObjectLiteral
src/lib/level-system.ts:587:7
     title: "Effortless Understanding",
     description: "Understand with ease virtually everything heard or read. Summarize information from different sources, reconstructing arguments coherently.",
   },
-  19: {
-    level: 19,
-    cefr: "C2",
-    title: "Cultural Fluency",
-    description: "Express yourself spontaneously, very fluently and precisely. Appreciate subtle distinctions in meaning, humor, and cultural references in any type of text.",
-  },
+  19: {},
   20: {
     level: 20,

[Survived] StringLiteral
src/lib/level-system.ts:596:12
   20: {
     level: 20,
     cefr: "C2",
-    title: "Full Mastery",
+    title: "",
     description: "Indistinguishable from an educated native speaker. Complete command of the language including idiomatic expressions, colloquialisms, and cultural nuances.",
   },

[Survived] StringLiteral
src/lib/level-system.ts:597:18
     level: 20,
     cefr: "C2",
     title: "Full Mastery",
-    description: "Indistinguishable from an educated native speaker. Complete command of the language including idiomatic expressions, colloquialisms, and cultural nuances.",
+    description: "",
   },
 };

[Killed] BlockStatement
src/lib/level-system.ts:604:70
 /**
  * Get the description for a specific level.
  */
-export function getLevelDescription(level: number): LevelDescription {
-  const clampedLevel = Math.max(1, Math.min(MAX_LEVEL, level));
-  return LEVEL_DESCRIPTIONS[clampedLevel];
-}
+export function getLevelDescription(level: number): LevelDescription {}
 
 /**
killedBy: getLevelDescription returns correct description for level 1
statusReason: Cannot read properties of undefined (reading 'title')
