[Killed] MethodExpression
src/lib/level-system.ts:605:24
  * Get the description for a specific level.
  */
 export function getLevelDescription(level: number): LevelDescription {
-  const clampedLevel = Math.max(1, Math.min(MAX_LEVEL, level));
+  const clampedLevel = Math.min(1, Math.min(MAX_LEVEL, level));
   return LEVEL_DESCRIPTIONS[clampedLevel];
 }
killedBy: getLevelDescription clamps to valid range
statusReason: Cannot read properties of undefined (reading 'level')

[Killed] MethodExpression
src/lib/level-system.ts:605:36
  * Get the description for a specific level.
  */
 export function getLevelDescription(level: number): LevelDescription {
-  const clampedLevel = Math.max(1, Math.min(MAX_LEVEL, level));
+  const clampedLevel = Math.max(1, Math.max(MAX_LEVEL, level));
   return LEVEL_DESCRIPTIONS[clampedLevel];
 }
killedBy: getLevelDescription returns correct description for level 1
statusReason: expected 'Full Mastery' to be 'First Steps' // Object.is equality

[Killed] BlockStatement
src/lib/level-system.ts:612:77
 /**
  * Get descriptions for a CEFR range.
  */
-export function getDescriptionsForCEFR(cefr: CEFRLevel): LevelDescription[] {
-  return Object.values(LEVEL_DESCRIPTIONS).filter((desc) => desc.cefr === cefr);
-}
+export function getDescriptionsForCEFR(cefr: CEFRLevel): LevelDescription[] {}
 
killedBy: getDescriptionsForCEFR returns 3 descriptions for A1 (levels 1-3)
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
src/lib/level-system.ts:613:51
  * Get descriptions for a CEFR range.
  */
 export function getDescriptionsForCEFR(cefr: CEFRLevel): LevelDescription[] {
-  return Object.values(LEVEL_DESCRIPTIONS).filter((desc) => desc.cefr === cefr);
+  return Object.values(LEVEL_DESCRIPTIONS).filter(() => undefined);
 }
 
killedBy: getDescriptionsForCEFR returns 3 descriptions for A1 (levels 1-3)
statusReason: expected [] to have a length of 3 but got +0

[Killed] ConditionalExpression
src/lib/level-system.ts:613:61
  * Get descriptions for a CEFR range.
  */
 export function getDescriptionsForCEFR(cefr: CEFRLevel): LevelDescription[] {
-  return Object.values(LEVEL_DESCRIPTIONS).filter((desc) => desc.cefr === cefr);
+  return Object.values(LEVEL_DESCRIPTIONS).filter((desc) => true);
 }
 
killedBy: getDescriptionsForCEFR returns 3 descriptions for A1 (levels 1-3)
statusReason: expected [ …(20) ] to have a length of 3 but got 20
