[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:54:5
   let newRepetitions = repetitions;
 
   switch (response) {
-    case 'again':
-      // Failed to recall - reset progress
-      newEase = Math.max(MIN_EASE_FACTOR, currentEase - 0.2);
-      newInterval = 1;
-      newRepetitions = 0;
-      break;
+    case 'again':
 
     case 'hard':
killedBy: calculateNextReview response: again resets repetitions to 0
statusReason: expected 5 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:56:43
   switch (response) {
     case 'again':
       // Failed to recall - reset progress
-      newEase = Math.max(MIN_EASE_FACTOR, currentEase - 0.2);
+      newEase = Math.max(MIN_EASE_FACTOR, currentEase + 0.2);
       newInterval = 1;
       newRepetitions = 0;
killedBy: calculateNextReview response: again decreases ease factor by 0.2
statusReason: expected 2.7 to be 2.3 // Object.is equality

[Killed] MethodExpression
src/lib/spaced-repetition.ts:56:17
   switch (response) {
     case 'again':
       // Failed to recall - reset progress
-      newEase = Math.max(MIN_EASE_FACTOR, currentEase - 0.2);
+      newEase = Math.min(MIN_EASE_FACTOR, currentEase - 0.2);
       newInterval = 1;
       newRepetitions = 0;
killedBy: calculateNextReview response: again decreases ease factor by 0.2
statusReason: expected 1.3 to be 2.3 // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:61:5
       newRepetitions = 0;
       break;
 
-    case 'hard':
-      // Recalled with difficulty
-      newEase = Math.max(MIN_EASE_FACTOR, currentEase - 0.15);
-      newInterval = Math.max(1, Math.round(currentInterval * HARD_MULTIPLIER));
-      // Don't increment repetitions on hard
-      break;
+    case 'hard':
 
     case 'good':
killedBy: calculateNextReview response: hard decreases ease factor by 0.15
statusReason: expected 2.5 to be 2.35 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:63:43
 
     case 'hard':
       // Recalled with difficulty
-      newEase = Math.max(MIN_EASE_FACTOR, currentEase - 0.15);
+      newEase = Math.max(MIN_EASE_FACTOR, currentEase + 0.15);
       newInterval = Math.max(1, Math.round(currentInterval * HARD_MULTIPLIER));
       // Don't increment repetitions on hard
killedBy: calculateNextReview response: hard decreases ease factor by 0.15
statusReason: expected 2.65 to be 2.35 // Object.is equality

[Killed] MethodExpression
src/lib/spaced-repetition.ts:63:17
 
     case 'hard':
       // Recalled with difficulty
-      newEase = Math.max(MIN_EASE_FACTOR, currentEase - 0.15);
+      newEase = Math.min(MIN_EASE_FACTOR, currentEase - 0.15);
       newInterval = Math.max(1, Math.round(currentInterval * HARD_MULTIPLIER));
       // Don't increment repetitions on hard
killedBy: calculateNextReview response: hard decreases ease factor by 0.15
statusReason: expected 1.3 to be 2.35 // Object.is equality

[Killed] MethodExpression
src/lib/spaced-repetition.ts:64:21
     case 'hard':
       // Recalled with difficulty
       newEase = Math.max(MIN_EASE_FACTOR, currentEase - 0.15);
-      newInterval = Math.max(1, Math.round(currentInterval * HARD_MULTIPLIER));
+      newInterval = Math.min(1, Math.round(currentInterval * HARD_MULTIPLIER));
       // Don't increment repetitions on hard
       break;
killedBy: calculateNextReview response: hard multiplies interval by 1.2 (hard multiplier)
statusReason: expected 1 to be 12 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:64:44
     case 'hard':
       // Recalled with difficulty
       newEase = Math.max(MIN_EASE_FACTOR, currentEase - 0.15);
-      newInterval = Math.max(1, Math.round(currentInterval * HARD_MULTIPLIER));
+      newInterval = Math.max(1, Math.round(currentInterval / HARD_MULTIPLIER));
       // Don't increment repetitions on hard
       break;
killedBy: calculateNextReview response: hard multiplies interval by 1.2 (hard multiplier)
statusReason: expected 8 to be 12 // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:68:5
       // Don't increment repetitions on hard
       break;
 
-    case 'good':
-      // Normal recall
-      if (repetitions === 0) {
-        newInterval = 1;
-      } else if (repetitions === 1) {
-        newInterval = 6;
-      } else {
-        newInterval = Math.round(currentInterval * currentEase);
-      }
-      newRepetitions = repetitions + 1;
-      break;
+    case 'good':
 
     case 'easy':
killedBy: calculateNextReview response: good sets interval to 1 on first review (rep=0)
statusReason: expected 4 to be 1 // Object.is equality

[Killed] StringLiteral
src/lib/spaced-repetition.ts:68:10
       // Don't increment repetitions on hard
       break;
 
-    case 'good':
+    case "":
       // Normal recall
       if (repetitions === 0) {
killedBy: calculateNextReview response: good sets interval to 1 on first review (rep=0)
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/spaced-repetition.ts:70:30
 
     case 'good':
       // Normal recall
-      if (repetitions === 0) {
-        newInterval = 1;
-      } else if (repetitions === 1) {
+      if (repetitions === 0) {} else if (repetitions === 1) {
         newInterval = 6;
       } else {
killedBy: calculateNextReview response: good sets interval to 1 on first review (rep=0)
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:70:11
 
     case 'good':
       // Normal recall
-      if (repetitions === 0) {
+      if (true) {
         newInterval = 1;
       } else if (repetitions === 1) {
killedBy: calculateNextReview response: good sets interval to 6 on second review (rep=1)
statusReason: expected 1 to be 6 // Object.is equality

[Killed] BlockStatement
src/lib/spaced-repetition.ts:72:37
       // Normal recall
       if (repetitions === 0) {
         newInterval = 1;
-      } else if (repetitions === 1) {
-        newInterval = 6;
-      } else {
+      } else if (repetitions === 1) {} else {
         newInterval = Math.round(currentInterval * currentEase);
       }
killedBy: calculateNextReview response: good sets interval to 6 on second review (rep=1)
statusReason: expected undefined to be 6 // Object.is equality

[Killed] EqualityOperator
src/lib/spaced-repetition.ts:72:18
       // Normal recall
       if (repetitions === 0) {
         newInterval = 1;
-      } else if (repetitions === 1) {
+      } else if (repetitions !== 1) {
         newInterval = 6;
       } else {
killedBy: calculateNextReview response: good sets interval to 6 on second review (rep=1)
statusReason: expected 3 to be 6 // Object.is equality

[Killed] BlockStatement
src/lib/spaced-repetition.ts:74:14
         newInterval = 1;
       } else if (repetitions === 1) {
         newInterval = 6;
-      } else {
-        newInterval = Math.round(currentInterval * currentEase);
-      }
+      } else {}
       newRepetitions = repetitions + 1;
       break;
killedBy: calculateNextReview response: good multiplies interval by ease factor for rep>=2
statusReason: expected undefined to be 15 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:75:34
       } else if (repetitions === 1) {
         newInterval = 6;
       } else {
-        newInterval = Math.round(currentInterval * currentEase);
+        newInterval = Math.round(currentInterval / currentEase);
       }
       newRepetitions = repetitions + 1;
killedBy: calculateNextReview response: good multiplies interval by ease factor for rep>=2
statusReason: expected 2 to be 15 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:77:24
       } else {
         newInterval = Math.round(currentInterval * currentEase);
       }
-      newRepetitions = repetitions + 1;
+      newRepetitions = repetitions - 1;
       break;
 
killedBy: calculateNextReview response: good increments repetitions
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:80:5
       newRepetitions = repetitions + 1;
       break;
 
-    case 'easy':
-      // Easy recall - bonus interval
-      if (repetitions === 0) {
-        newInterval = 4; // Skip ahead for easy new cards
-      } else if (repetitions === 1) {
-        newInterval = Math.round(6 * EASY_BONUS);
-      } else {
-        newInterval = Math.round(currentInterval * currentEase * EASY_BONUS);
-      }
-      newEase = currentEase + 0.15;
-      newRepetitions = repetitions + 1;
-      break;
+    case 'easy':
   }
 
killedBy: calculateNextReview response: easy sets interval to 4 on first review (rep=0)
statusReason: expected undefined to be 4 // Object.is equality

[Killed] StringLiteral
src/lib/spaced-repetition.ts:80:10
       newRepetitions = repetitions + 1;
       break;
 
-    case 'easy':
+    case "":
       // Easy recall - bonus interval
       if (repetitions === 0) {
killedBy: calculateNextReview response: easy sets interval to 4 on first review (rep=0)
statusReason: expected undefined to be 4 // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:82:11
 
     case 'easy':
       // Easy recall - bonus interval
-      if (repetitions === 0) {
+      if (false) {
         newInterval = 4; // Skip ahead for easy new cards
       } else if (repetitions === 1) {
killedBy: calculateNextReview response: easy sets interval to 4 on first review (rep=0)
statusReason: expected +0 to be 4 // Object.is equality

[Killed] BlockStatement
src/lib/spaced-repetition.ts:82:30
 
     case 'easy':
       // Easy recall - bonus interval
-      if (repetitions === 0) {
-        newInterval = 4; // Skip ahead for easy new cards
-      } else if (repetitions === 1) {
+      if (repetitions === 0) {} else if (repetitions === 1) {
         newInterval = Math.round(6 * EASY_BONUS);
       } else {
killedBy: calculateNextReview response: easy sets interval to 4 on first review (rep=0)
statusReason: expected undefined to be 4 // Object.is equality

[Killed] EqualityOperator
src/lib/spaced-repetition.ts:84:18
       // Easy recall - bonus interval
       if (repetitions === 0) {
         newInterval = 4; // Skip ahead for easy new cards
-      } else if (repetitions === 1) {
+      } else if (repetitions !== 1) {
         newInterval = Math.round(6 * EASY_BONUS);
       } else {
killedBy: calculateNextReview response: easy sets interval to round(6 * 1.3) = 8 on second review (rep=1)
statusReason: expected 3 to be 8 // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:84:18
       // Easy recall - bonus interval
       if (repetitions === 0) {
         newInterval = 4; // Skip ahead for easy new cards
-      } else if (repetitions === 1) {
+      } else if (false) {
         newInterval = Math.round(6 * EASY_BONUS);
       } else {
killedBy: calculateNextReview response: easy sets interval to round(6 * 1.3) = 8 on second review (rep=1)
statusReason: expected 3 to be 8 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:85:34
       if (repetitions === 0) {
         newInterval = 4; // Skip ahead for easy new cards
       } else if (repetitions === 1) {
-        newInterval = Math.round(6 * EASY_BONUS);
+        newInterval = Math.round(6 / EASY_BONUS);
       } else {
         newInterval = Math.round(currentInterval * currentEase * EASY_BONUS);
killedBy: calculateNextReview response: easy sets interval to round(6 * 1.3) = 8 on second review (rep=1)
statusReason: expected 5 to be 8 // Object.is equality

[Killed] BlockStatement
src/lib/spaced-repetition.ts:86:14
         newInterval = 4; // Skip ahead for easy new cards
       } else if (repetitions === 1) {
         newInterval = Math.round(6 * EASY_BONUS);
-      } else {
-        newInterval = Math.round(currentInterval * currentEase * EASY_BONUS);
-      }
+      } else {}
       newEase = currentEase + 0.15;
       newRepetitions = repetitions + 1;
killedBy: calculateNextReview response: easy multiplies interval by ease * EASY_BONUS for rep>=2
statusReason: expected undefined to be 20 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:87:34
       } else if (repetitions === 1) {
         newInterval = Math.round(6 * EASY_BONUS);
       } else {
-        newInterval = Math.round(currentInterval * currentEase * EASY_BONUS);
+        newInterval = Math.round(currentInterval * currentEase / EASY_BONUS);
       }
       newEase = currentEase + 0.15;
killedBy: calculateNextReview response: easy multiplies interval by ease * EASY_BONUS for rep>=2
statusReason: expected 12 to be 20 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:87:34
       } else if (repetitions === 1) {
         newInterval = Math.round(6 * EASY_BONUS);
       } else {
-        newInterval = Math.round(currentInterval * currentEase * EASY_BONUS);
+        newInterval = Math.round(currentInterval / currentEase * EASY_BONUS);
       }
       newEase = currentEase + 0.15;
killedBy: calculateNextReview response: easy multiplies interval by ease * EASY_BONUS for rep>=2
statusReason: expected 3 to be 20 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:89:17
       } else {
         newInterval = Math.round(currentInterval * currentEase * EASY_BONUS);
       }
-      newEase = currentEase + 0.15;
+      newEase = currentEase - 0.15;
       newRepetitions = repetitions + 1;
       break;
killedBy: calculateNextReview response: easy increases ease factor by 0.15
statusReason: expected 2.35 to be 2.65 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:90:24
         newInterval = Math.round(currentInterval * currentEase * EASY_BONUS);
       }
       newEase = currentEase + 0.15;
-      newRepetitions = repetitions + 1;
+      newRepetitions = repetitions - 1;
       break;
   }
killedBy: calculateNextReview response: easy increments repetitions
statusReason: expected 1 to be 3 // Object.is equality

[Killed] MethodExpression
src/lib/spaced-repetition.ts:96:3
 
   // Calculate next review date
   const nextReviewDate = new Date();
-  nextReviewDate.setDate(nextReviewDate.getDate() + newInterval);
+  nextReviewDate.setTime(nextReviewDate.getDate() + newInterval);
 
   return {
killedBy: calculateNextReview sets nextReviewDate to today + newInterval days
statusReason: expected 'Wed Dec 31 1969' to be 'Sun Jun 30 2024' // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:96:26
 
   // Calculate next review date
   const nextReviewDate = new Date();
-  nextReviewDate.setDate(nextReviewDate.getDate() + newInterval);
+  nextReviewDate.setDate(nextReviewDate.getDate() - newInterval);
 
   return {
killedBy: calculateNextReview sets nextReviewDate to today + newInterval days
statusReason: expected 'Fri May 31 2024' to be 'Sun Jun 30 2024' // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:99:20
   nextReviewDate.setDate(nextReviewDate.getDate() + newInterval);
 
   return {
-    newEaseFactor: Math.round(newEase * 100) / 100, // Round to 2 decimal places
+    newEaseFactor: Math.round(newEase * 100) * 100, // Round to 2 decimal places
     newInterval,
     newRepetitions,
killedBy: calculateNextReview response: again decreases ease factor by 0.2
statusReason: expected 23000 to be 2.3 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:99:31
   nextReviewDate.setDate(nextReviewDate.getDate() + newInterval);
 
   return {
-    newEaseFactor: Math.round(newEase * 100) / 100, // Round to 2 decimal places
+    newEaseFactor: Math.round(newEase / 100) / 100, // Round to 2 decimal places
     newInterval,
     newRepetitions,
killedBy: calculateNextReview response: again decreases ease factor by 0.2
statusReason: expected +0 to be 2.3 // Object.is equality

[Killed] BlockStatement
src/lib/spaced-repetition.ts:114:20
   currentEase: number,
   currentInterval: number,
   repetitions: number
-): IntervalPreview {
-  return {
-    again: calculateNextReview(currentEase, currentInterval, repetitions, 'again').newInterval,
-    hard: calculateNextReview(currentEase, currentInterval, repetitions, 'hard').newInterval,
-    good: calculateNextReview(currentEase, currentInterval, repetitions, 'good').newInterval,
-    easy: calculateNextReview(currentEase, currentInterval, repetitions, 'easy').newInterval,
-  };
-}
+): IntervalPreview {}
 
 /**
killedBy: calculateIntervalPreview returns intervals for all four responses
statusReason: expected undefined to deeply equal { again: 1, hard: 7, good: 15, …(1) }

[Killed] StringLiteral
src/lib/spaced-repetition.ts:118:74
   return {
     again: calculateNextReview(currentEase, currentInterval, repetitions, 'again').newInterval,
     hard: calculateNextReview(currentEase, currentInterval, repetitions, 'hard').newInterval,
-    good: calculateNextReview(currentEase, currentInterval, repetitions, 'good').newInterval,
+    good: calculateNextReview(currentEase, currentInterval, repetitions, "").newInterval,
     easy: calculateNextReview(currentEase, currentInterval, repetitions, 'easy').newInterval,
   };
killedBy: calculateIntervalPreview returns intervals for all four responses
statusReason: expected { again: 1, hard: 7, …(2) } to deeply equal { again: 1, hard: 7, good: 15, …(1) }

[Killed] BlockStatement
src/lib/spaced-repetition.ts:126:54
 /**
  * Format interval for display (e.g., "1d", "2w", "3mo")
  */
-export function formatInterval(days: number): string {
-  if (days < 1) {
-    return '<1d';
-  } else if (days === 1) {
-    return '1d';
-  } else if (days < 7) {
-    return `${days}d`;
-  } else if (days < 30) {
-    const weeks = Math.round(days / 7);
-    return `${weeks}w`;
-  } else if (days < 365) {
-    const months = Math.round(days / 30);
-    return `${months}mo`;
-  } else {
-    const years = Math.round(days / 365 * 10) / 10;
-    return `${years}y`;
-  }
-}
+export function formatInterval(days: number): string {}
 
 /**
killedBy: formatInterval returns '<1d' for sub-day values
statusReason: expected undefined to be '<1d' // Object.is equality

[Killed] BlockStatement
src/lib/spaced-repetition.ts:127:17
  * Format interval for display (e.g., "1d", "2w", "3mo")
  */
 export function formatInterval(days: number): string {
-  if (days < 1) {
-    return '<1d';
-  } else if (days === 1) {
+  if (days < 1) {} else if (days === 1) {
     return '1d';
   } else if (days < 7) {
killedBy: formatInterval returns '<1d' for sub-day values
statusReason: expected undefined to be '<1d' // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:127:7
  * Format interval for display (e.g., "1d", "2w", "3mo")
  */
 export function formatInterval(days: number): string {
-  if (days < 1) {
+  if (true) {
     return '<1d';
   } else if (days === 1) {
killedBy: formatInterval returns '1d' for exactly 1
statusReason: expected '<1d' to be '1d' // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:129:14
 export function formatInterval(days: number): string {
   if (days < 1) {
     return '<1d';
-  } else if (days === 1) {
+  } else if (true) {
     return '1d';
   } else if (days < 7) {
killedBy: formatInterval returns days for 2-6
statusReason: expected '1d' to be '3d' // Object.is equality

[Killed] EqualityOperator
src/lib/spaced-repetition.ts:129:14
 export function formatInterval(days: number): string {
   if (days < 1) {
     return '<1d';
-  } else if (days === 1) {
+  } else if (days !== 1) {
     return '1d';
   } else if (days < 7) {
killedBy: formatInterval returns days for 2-6
statusReason: expected '1d' to be '3d' // Object.is equality

[Killed] StringLiteral
src/lib/spaced-repetition.ts:130:12
   if (days < 1) {
     return '<1d';
   } else if (days === 1) {
-    return '1d';
+    return "";
   } else if (days < 7) {
     return `${days}d`;
killedBy: formatInterval returns '1d' for exactly 1
statusReason: expected '' to be '1d' // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:131:14
     return '<1d';
   } else if (days === 1) {
     return '1d';
-  } else if (days < 7) {
+  } else if (true) {
     return `${days}d`;
   } else if (days < 30) {
killedBy: formatInterval returns weeks for 7-29
statusReason: expected '7d' to be '1w' // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:131:14
     return '<1d';
   } else if (days === 1) {
     return '1d';
-  } else if (days < 7) {
+  } else if (false) {
     return `${days}d`;
   } else if (days < 30) {
killedBy: formatInterval returns days for 2-6
statusReason: expected '0w' to be '3d' // Object.is equality

[Killed] EqualityOperator
src/lib/spaced-repetition.ts:133:14
     return '1d';
   } else if (days < 7) {
     return `${days}d`;
-  } else if (days < 30) {
+  } else if (days <= 30) {
     const weeks = Math.round(days / 7);
     return `${weeks}w`;
killedBy: formatInterval returns months for 30-364
statusReason: expected '4w' to be '1mo' // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:133:14
     return '1d';
   } else if (days < 7) {
     return `${days}d`;
-  } else if (days < 30) {
+  } else if (false) {
     const weeks = Math.round(days / 7);
     return `${weeks}w`;
killedBy: formatInterval returns weeks for 7-29
statusReason: expected '0mo' to be '1w' // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:134:30
   } else if (days < 7) {
     return `${days}d`;
   } else if (days < 30) {
-    const weeks = Math.round(days / 7);
+    const weeks = Math.round(days * 7);
     return `${weeks}w`;
   } else if (days < 365) {
killedBy: formatInterval returns weeks for 7-29
statusReason: expected '49w' to be '1w' // Object.is equality

[Killed] StringLiteral
src/lib/spaced-repetition.ts:135:12
     return `${days}d`;
   } else if (days < 30) {
     const weeks = Math.round(days / 7);
-    return `${weeks}w`;
+    return ``;
   } else if (days < 365) {
     const months = Math.round(days / 30);
killedBy: formatInterval returns weeks for 7-29
statusReason: expected '' to be '1w' // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:136:14
   } else if (days < 30) {
     const weeks = Math.round(days / 7);
     return `${weeks}w`;
-  } else if (days < 365) {
+  } else if (true) {
     const months = Math.round(days / 30);
     return `${months}mo`;
killedBy: formatInterval returns years for 365+
statusReason: expected '12mo' to be '1y' // Object.is equality

[Killed] EqualityOperator
src/lib/spaced-repetition.ts:136:14
   } else if (days < 30) {
     const weeks = Math.round(days / 7);
     return `${weeks}w`;
-  } else if (days < 365) {
+  } else if (days <= 365) {
     const months = Math.round(days / 30);
     return `${months}mo`;
killedBy: formatInterval returns years for 365+
statusReason: expected '12mo' to be '1y' // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:137:31
     const weeks = Math.round(days / 7);
     return `${weeks}w`;
   } else if (days < 365) {
-    const months = Math.round(days / 30);
+    const months = Math.round(days * 30);
     return `${months}mo`;
   } else {
killedBy: formatInterval returns months for 30-364
statusReason: expected '900mo' to be '1mo' // Object.is equality

[Killed] BlockStatement
src/lib/spaced-repetition.ts:139:10
   } else if (days < 365) {
     const months = Math.round(days / 30);
     return `${months}mo`;
-  } else {
-    const years = Math.round(days / 365 * 10) / 10;
-    return `${years}y`;
-  }
+  } else {}
 }
 
killedBy: formatInterval returns years for 365+
statusReason: expected undefined to be '1y' // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:140:19
     const months = Math.round(days / 30);
     return `${months}mo`;
   } else {
-    const years = Math.round(days / 365 * 10) / 10;
+    const years = Math.round(days / 365 * 10) * 10;
     return `${years}y`;
   }
killedBy: formatInterval returns years for 365+
statusReason: expected '100y' to be '1y' // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:140:30
     const months = Math.round(days / 30);
     return `${months}mo`;
   } else {
-    const years = Math.round(days / 365 * 10) / 10;
+    const years = Math.round(days * 365 * 10) / 10;
     return `${years}y`;
   }
killedBy: formatInterval returns years for 365+
statusReason: expected '133225y' to be '1y' // Object.is equality

[Killed] BlockStatement
src/lib/spaced-repetition.ts:148:67
 /**
  * Check if a card is due for review
  */
-export function isCardDue(nextReviewDate: string | Date): boolean {
-  const reviewDate = new Date(nextReviewDate);
-  const today = new Date();
-  today.setHours(0, 0, 0, 0);
-  reviewDate.setHours(0, 0, 0, 0);
-  return reviewDate <= today;
-}
+export function isCardDue(nextReviewDate: string | Date): boolean {}
 
 /**
killedBy: isCardDue returns true if review date is today
statusReason: expected undefined to be true // Object.is equality

[Killed] MethodExpression
src/lib/spaced-repetition.ts:152:3
   const reviewDate = new Date(nextReviewDate);
   const today = new Date();
   today.setHours(0, 0, 0, 0);
-  reviewDate.setHours(0, 0, 0, 0);
+  reviewDate.setMinutes(0, 0, 0, 0);
   return reviewDate <= today;
 }
killedBy: isCardDue returns true if review date is today
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:153:10
   const today = new Date();
   today.setHours(0, 0, 0, 0);
   reviewDate.setHours(0, 0, 0, 0);
-  return reviewDate <= today;
+  return true;
 }
 
killedBy: isCardDue returns false if review date is in the future
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/spaced-repetition.ts:153:10
   const today = new Date();
   today.setHours(0, 0, 0, 0);
   reviewDate.setHours(0, 0, 0, 0);
-  return reviewDate <= today;
+  return reviewDate < today;
 }
 
killedBy: isCardDue returns true if review date is today
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/spaced-repetition.ts:159:72
 /**
  * Calculate days until next review (negative if overdue)
  */
-export function daysUntilReview(nextReviewDate: string | Date): number {
-  const reviewDate = new Date(nextReviewDate);
-  const today = new Date();
-  today.setHours(0, 0, 0, 0);
-  reviewDate.setHours(0, 0, 0, 0);
-  const diffTime = reviewDate.getTime() - today.getTime();
-  return Math.ceil(diffTime / (1000 * 60 * 60 * 24));
-}
+export function daysUntilReview(nextReviewDate: string | Date): number {}
 
killedBy: daysUntilReview returns 0 for today
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:164:20
   const today = new Date();
   today.setHours(0, 0, 0, 0);
   reviewDate.setHours(0, 0, 0, 0);
-  const diffTime = reviewDate.getTime() - today.getTime();
+  const diffTime = reviewDate.getTime() + today.getTime();
   return Math.ceil(diffTime / (1000 * 60 * 60 * 24));
 }
killedBy: daysUntilReview returns 0 for today
statusReason: expected 39779 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:165:32
   today.setHours(0, 0, 0, 0);
   reviewDate.setHours(0, 0, 0, 0);
   const diffTime = reviewDate.getTime() - today.getTime();
-  return Math.ceil(diffTime / (1000 * 60 * 60 * 24));
+  return Math.ceil(diffTime / (1000 / 60 * 60 * 24));
 }
 
killedBy: daysUntilReview returns positive for future dates
statusReason: expected 18000 to be 5 // Object.is equality

[Killed] ArithmeticOperator
src/lib/spaced-repetition.ts:165:20
   today.setHours(0, 0, 0, 0);
   reviewDate.setHours(0, 0, 0, 0);
   const diffTime = reviewDate.getTime() - today.getTime();
-  return Math.ceil(diffTime / (1000 * 60 * 60 * 24));
+  return Math.ceil(diffTime * (1000 * 60 * 60 * 24));
 }
 
killedBy: daysUntilReview returns positive for future dates
statusReason: expected 37324800000000000 to be 5 // Object.is equality
