[Survived] ArrayDeclaration
src/components/flashcards/Deck.tsx:28:55
 }
 
 export function Deck({ contentId, contentTitle }: DeckProps) {
-  const [cards, setCards] = useState<FlashcardItem[]>([]);
+  const [cards, setCards] = useState<FlashcardItem[]>(["Stryker was here"]);
   const [current, setCurrent] = useState(0);
   const [isFlipped, setIsFlipped] = useState(false);

[Killed] BooleanLiteral
src/components/flashcards/Deck.tsx:30:46
 export function Deck({ contentId, contentTitle }: DeckProps) {
   const [cards, setCards] = useState<FlashcardItem[]>([]);
   const [current, setCurrent] = useState(0);
-  const [isFlipped, setIsFlipped] = useState(false);
+  const [isFlipped, setIsFlipped] = useState(true);
   const [loading, setLoading] = useState(true);
   const [error, setError] = useState<string | null>(null);
killedBy: Deck clicking the card div flips the card and clicking again restores it
statusReason: expect(element).toHaveStyle()

- Expected

- transform: rotateY(0deg);
+ transform: rotateY(180deg);

[Survived] BooleanLiteral
src/components/flashcards/Deck.tsx:31:42
   const [cards, setCards] = useState<FlashcardItem[]>([]);
   const [current, setCurrent] = useState(0);
   const [isFlipped, setIsFlipped] = useState(false);
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
   const [error, setError] = useState<string | null>(null);
 

[Killed] BlockStatement
src/components/flashcards/Deck.tsx:35:32
   const [error, setError] = useState<string | null>(null);
 
   useEffect(() => {
-    async function loadCards() {
-      setLoading(true);
-      setError(null);
-
-      try {
-        const response = await fetch(`/api/vocabulary?contentId=${contentId}`, {
-          credentials: "include",
-        });
-
-        if (!response.ok) {
-          throw new Error("Failed to fetch vocabulary");
-        }
-
-        const data: FlashcardItem[] = await response.json();
-        setCards(data.filter((item) => item.vocabulary?.word));
-      } catch (err) {
-        console.error(err);
-        setError(err instanceof Error ? err.message : "Unknown error");
-      } finally {
-        setLoading(false);
-      }
-    }
+    async function loadCards() {}
 
     loadCards();
killedBy: Deck renders loading then cards from API
statusReason: Unable to find an element with the text: Book One. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center justify-center py-12"
    >

[Killed] BooleanLiteral
src/components/flashcards/Deck.tsx:36:18
 
   useEffect(() => {
     async function loadCards() {
-      setLoading(true);
+      setLoading(false);
       setError(null);
 
killedBy: Deck renders loading then cards from API
statusReason: Unable to find an element with the text: /loading flashcards/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm"
      data-

[Killed] BlockStatement
src/components/flashcards/Deck.tsx:39:11
       setLoading(true);
       setError(null);
 
-      try {
-        const response = await fetch(`/api/vocabulary?contentId=${contentId}`, {
-          credentials: "include",
-        });
-
-        if (!response.ok) {
-          throw new Error("Failed to fetch vocabulary");
-        }
-
-        const data: FlashcardItem[] = await response.json();
-        setCards(data.filter((item) => item.vocabulary?.word));
-      } catch (err) {
+      try {} catch (err) {
         console.error(err);
         setError(err instanceof Error ? err.message : "Unknown error");
killedBy: Deck renders loading then cards from API
statusReason: Unable to find an element with the text: /loading flashcards/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm"
      data-

[Survived] ObjectLiteral
src/components/flashcards/Deck.tsx:40:80
       setError(null);
 
       try {
-        const response = await fetch(`/api/vocabulary?contentId=${contentId}`, {
-          credentials: "include",
-        });
+        const response = await fetch(`/api/vocabulary?contentId=${contentId}`, {});
 
         if (!response.ok) {

[Killed] BlockStatement
src/components/flashcards/Deck.tsx:44:27
           credentials: "include",
         });
 
-        if (!response.ok) {
-          throw new Error("Failed to fetch vocabulary");
-        }
+        if (!response.ok) {}
 
         const data: FlashcardItem[] = await response.json();
killedBy: Deck shows API error state
statusReason: Unable to find an element with the text: Failed to fetch vocabulary. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm"

[Killed] MethodExpression
src/components/flashcards/Deck.tsx:49:18
         }
 
         const data: FlashcardItem[] = await response.json();
-        setCards(data.filter((item) => item.vocabulary?.word));
+        setCards(data);
       } catch (err) {
         console.error(err);
killedBy: Deck renders loading then cards from API
statusReason: Unable to find an element with the text: 1 / 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >

[Killed] ArrowFunction
src/components/flashcards/Deck.tsx:49:30
         }
 
         const data: FlashcardItem[] = await response.json();
-        setCards(data.filter((item) => item.vocabulary?.word));
+        setCards(data.filter(() => undefined));
       } catch (err) {
         console.error(err);
killedBy: Deck renders loading then cards from API
statusReason: Unable to find an element with the text: Book One. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm"
      data-slot="card"

[Killed] BlockStatement
src/components/flashcards/Deck.tsx:50:21
 
         const data: FlashcardItem[] = await response.json();
         setCards(data.filter((item) => item.vocabulary?.word));
-      } catch (err) {
-        console.error(err);
-        setError(err instanceof Error ? err.message : "Unknown error");
-      } finally {
+      } catch (err) {} finally {
         setLoading(false);
       }
killedBy: Deck shows API error state
statusReason: Unable to find an element with the text: Failed to fetch vocabulary. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm"

[Survived] StringLiteral
src/components/flashcards/Deck.tsx:52:55
         setCards(data.filter((item) => item.vocabulary?.word));
       } catch (err) {
         console.error(err);
-        setError(err instanceof Error ? err.message : "Unknown error");
+        setError(err instanceof Error ? err.message : "");
       } finally {
         setLoading(false);

[Killed] BlockStatement
src/components/flashcards/Deck.tsx:53:17
       } catch (err) {
         console.error(err);
         setError(err instanceof Error ? err.message : "Unknown error");
-      } finally {
-        setLoading(false);
-      }
+      } finally {}
     }
 
killedBy: Deck renders loading then cards from API
statusReason: Unable to find an element with the text: Book One. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center justify-center py-12"
    >

[Killed] BlockStatement
src/components/flashcards/Deck.tsx:61:26
     loadCards();
   }, [contentId]);
 
-  const goToPrev = () => {
-    setIsFlipped(false);
-    setCurrent((i) => Math.max(0, i - 1));
-  };
+  const goToPrev = () => {};
 
   const goToNext = () => {
killedBy: Deck navigates back to the first card with the prev button
statusReason: Unable to find an element with the text: 1 / 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >

[Survived] BooleanLiteral
src/components/flashcards/Deck.tsx:62:18
   }, [contentId]);
 
   const goToPrev = () => {
-    setIsFlipped(false);
+    setIsFlipped(true);
     setCurrent((i) => Math.max(0, i - 1));
   };

[Killed] ArrowFunction
src/components/flashcards/Deck.tsx:63:16
 
   const goToPrev = () => {
     setIsFlipped(false);
-    setCurrent((i) => Math.max(0, i - 1));
+    setCurrent(() => undefined);
   };
 
killedBy: Deck navigates back to the first card with the prev button
statusReason: Cannot read properties of undefined (reading 'vocabulary')

[Killed] ArithmeticOperator
src/components/flashcards/Deck.tsx:63:35
 
   const goToPrev = () => {
     setIsFlipped(false);
-    setCurrent((i) => Math.max(0, i - 1));
+    setCurrent((i) => Math.max(0, i + 1));
   };
 
killedBy: Deck navigates back to the first card with the prev button
statusReason: Cannot read properties of undefined (reading 'vocabulary')

[Killed] BlockStatement
src/components/flashcards/Deck.tsx:66:26
     setCurrent((i) => Math.max(0, i - 1));
   };
 
-  const goToNext = () => {
-    setIsFlipped(false);
-    setCurrent((i) => Math.min(cards.length - 1, i + 1));
-  };
+  const goToNext = () => {};
 
   const getTranslation = (vocab: VocabularyItem) => {
killedBy: Deck navigates between cards and flips with keyboard
statusReason: Unable to find an element with the text: perro. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >

[Survived] BooleanLiteral
src/components/flashcards/Deck.tsx:67:18
   };
 
   const goToNext = () => {
-    setIsFlipped(false);
+    setIsFlipped(true);
     setCurrent((i) => Math.min(cards.length - 1, i + 1));
   };

[Killed] ArithmeticOperator
src/components/flashcards/Deck.tsx:68:50
 
   const goToNext = () => {
     setIsFlipped(false);
-    setCurrent((i) => Math.min(cards.length - 1, i + 1));
+    setCurrent((i) => Math.min(cards.length - 1, i - 1));
   };
 
killedBy: Deck navigates between cards and flips with keyboard
statusReason: Cannot read properties of undefined (reading 'vocabulary')

[Killed] ArrowFunction
src/components/flashcards/Deck.tsx:68:16
 
   const goToNext = () => {
     setIsFlipped(false);
-    setCurrent((i) => Math.min(cards.length - 1, i + 1));
+    setCurrent(() => undefined);
   };
 
killedBy: Deck navigates between cards and flips with keyboard
statusReason: Cannot read properties of undefined (reading 'vocabulary')

[Killed] BlockStatement
src/components/flashcards/Deck.tsx:71:53
     setCurrent((i) => Math.min(cards.length - 1, i + 1));
   };
 
-  const getTranslation = (vocab: VocabularyItem) => {
-    if (vocab.definitions?.translation) return vocab.definitions.translation;
-    if (vocab.definitions?.definitions?.[0]) return vocab.definitions.definitions[0];
-    return "No translation";
-  };
+  const getTranslation = (vocab: VocabularyItem) => {};
 
   if (loading) {
killedBy: Deck shows definitions[0] as translation on back when no translation property
statusReason: Unable to find an element with the text: dog. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >

[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:72:9
   };
 
   const getTranslation = (vocab: VocabularyItem) => {
-    if (vocab.definitions?.translation) return vocab.definitions.translation;
+    if (true) return vocab.definitions.translation;
     if (vocab.definitions?.definitions?.[0]) return vocab.definitions.definitions[0];
     return "No translation";
killedBy: Deck shows definitions[0] as translation on back when no translation property
statusReason: Unable to find an element with the text: dog. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >

[Killed] OptionalChaining
src/components/flashcards/Deck.tsx:72:9
   };
 
   const getTranslation = (vocab: VocabularyItem) => {
-    if (vocab.definitions?.translation) return vocab.definitions.translation;
+    if (vocab.definitions.translation) return vocab.definitions.translation;
     if (vocab.definitions?.definitions?.[0]) return vocab.definitions.definitions[0];
     return "No translation";
killedBy: Deck shows "No translation" on back when definitions are null
statusReason: Unable to find an element with the text: unknown. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] OptionalChaining
src/components/flashcards/Deck.tsx:73:9
 
   const getTranslation = (vocab: VocabularyItem) => {
     if (vocab.definitions?.translation) return vocab.definitions.translation;
-    if (vocab.definitions?.definitions?.[0]) return vocab.definitions.definitions[0];
+    if (vocab.definitions.definitions?.[0]) return vocab.definitions.definitions[0];
     return "No translation";
   };
killedBy: Deck shows "No translation" on back when definitions are null
statusReason: Unable to find an element with the text: unknown. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:73:9
 
   const getTranslation = (vocab: VocabularyItem) => {
     if (vocab.definitions?.translation) return vocab.definitions.translation;
-    if (vocab.definitions?.definitions?.[0]) return vocab.definitions.definitions[0];
+    if (true) return vocab.definitions.definitions[0];
     return "No translation";
   };
killedBy: Deck shows "No translation" on back when definitions are null
statusReason: Unable to find an element with the text: unknown. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/components/flashcards/Deck.tsx:86:14
     );
   }
 
-  if (error) {
-    return (
-      <Card>
-        <CardContent className="flex flex-col items-center justify-center py-12">
-          <p className="text-destructive">{error}</p>
-        </CardContent>
-      </Card>
-    );
-  }
+  if (error) {}
 
   if (cards.length === 0) {
killedBy: Deck shows API error state
statusReason: Unable to find an element with the text: Failed to fetch vocabulary. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm"

[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:96:7
     );
   }
 
-  if (cards.length === 0) {
+  if (false) {
     return (
       <Card>
killedBy: Deck shows empty state when no saved vocabulary exists
statusReason: Unable to find an element with the text: No flashcards found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/components/flashcards/Deck.tsx:96:27
     );
   }
 
-  if (cards.length === 0) {
-    return (
-      <Card>
-        <CardContent className="flex flex-col items-center justify-center py-12">
-          <BookOpen className="h-12 w-12 text-muted-foreground" />
-          <h3 className="mt-4 text-lg font-semibold">No flashcards found</h3>
-          <p className="mt-2 text-center text-sm text-muted-foreground">
-            No vocabulary has been saved from this book yet.
-          </p>
-        </CardContent>
-      </Card>
-    );
-  }
+  if (cards.length === 0) {}
 
   const currentCard = cards[current];
killedBy: Deck shows empty state when no saved vocabulary exists
statusReason: Unable to find an element with the text: No flashcards found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:115:8
 
   return (
     <div className="flex flex-col items-center space-y-6">
-      {contentTitle && (
-        <p className="text-muted-foreground">{contentTitle}</p>
-      )}
+      {true}
 
       {/* Flip card */}
killedBy: Deck renders loading then cards from API
statusReason: Unable to find an element with the text: Book One. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >

[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:115:8
 
   return (
     <div className="flex flex-col items-center space-y-6">
-      {contentTitle && (
-        <p className="text-muted-foreground">{contentTitle}</p>
-      )}
+      {false}
 
       {/* Flip card */}
killedBy: Deck renders loading then cards from API
statusReason: Unable to find an element with the text: Book One. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >

[Killed] ArrowFunction
src/components/flashcards/Deck.tsx:123:18
       <div
         className="w-full max-w-xl cursor-pointer"
         style={{ perspective: "1000px" }}
-        onClick={() => setIsFlipped(!isFlipped)}
+        onClick={() => undefined}
         onKeyDown={(e) => {
           if (e.key === "Enter" || e.key === " ") {
killedBy: Deck clicking the card div flips the card and clicking again restores it
statusReason: expect(element).toHaveStyle()

- Expected

- transform: rotateY(180deg);
+ transform: rotateY(0deg);

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/components/flashcards/Deck.tsx:123:37
       <div
         className="w-full max-w-xl cursor-pointer"
         style={{ perspective: "1000px" }}
-        onClick={() => setIsFlipped(!isFlipped)}
+        onClick={() => setIsFlipped(isFlipped)}
         onKeyDown={(e) => {
           if (e.key === "Enter" || e.key === " ") {
killedBy: Deck clicking the card div flips the card and clicking again restores it
statusReason: expect(element).toHaveStyle()

- Expected

- transform: rotateY(180deg);
+ transform: rotateY(0deg);

Ignored nodes: comments, script, style

[Survived] BlockStatement
src/components/flashcards/Deck.tsx:124:27
         className="w-full max-w-xl cursor-pointer"
         style={{ perspective: "1000px" }}
         onClick={() => setIsFlipped(!isFlipped)}
-        onKeyDown={(e) => {
-          if (e.key === "Enter" || e.key === " ") {
-            e.preventDefault();
-            setIsFlipped(!isFlipped);
-          }
-        }}
+        onKeyDown={(e) => {}}
         role="button"
         tabIndex={0}

[Survived] ConditionalExpression
src/components/flashcards/Deck.tsx:125:15
         style={{ perspective: "1000px" }}
         onClick={() => setIsFlipped(!isFlipped)}
         onKeyDown={(e) => {
-          if (e.key === "Enter" || e.key === " ") {
+          if (true) {
             e.preventDefault();
             setIsFlipped(!isFlipped);

[Survived] ConditionalExpression
src/components/flashcards/Deck.tsx:125:15
         style={{ perspective: "1000px" }}
         onClick={() => setIsFlipped(!isFlipped)}
         onKeyDown={(e) => {
-          if (e.key === "Enter" || e.key === " ") {
+          if (false) {
             e.preventDefault();
             setIsFlipped(!isFlipped);

[Survived] BooleanLiteral
src/components/flashcards/Deck.tsx:127:26
         onKeyDown={(e) => {
           if (e.key === "Enter" || e.key === " ") {
             e.preventDefault();
-            setIsFlipped(!isFlipped);
+            setIsFlipped(isFlipped);
           }
         }}

[Killed] ObjectLiteral
src/components/flashcards/Deck.tsx:135:18
       >
         <div
           className="relative transition-transform duration-500"
-          style={{
-            transformStyle: "preserve-3d",
-            transform: isFlipped ? "rotateY(180deg)" : "rotateY(0deg)",
-          }}
+          style={{}}
         >
           {/* Front */}
killedBy: Deck clicking the card div flips the card and clicking again restores it
statusReason: expect(element).toHaveStyle()

- Expected

- transform: rotateY(0deg);

[Survived] ConditionalExpression
src/components/flashcards/Deck.tsx:144:15
           <Card
             className={cn(
               "min-h-[300px]",
-              isFlipped && "invisible"
+              false
             )}
             style={{ backfaceVisibility: "hidden" }}

[Survived] ConditionalExpression
src/components/flashcards/Deck.tsx:144:15
           <Card
             className={cn(
               "min-h-[300px]",
-              isFlipped && "invisible"
+              true
             )}
             style={{ backfaceVisibility: "hidden" }}

[Survived] StringLiteral
src/components/flashcards/Deck.tsx:146:42
               "min-h-[300px]",
               isFlipped && "invisible"
             )}
-            style={{ backfaceVisibility: "hidden" }}
+            style={{ backfaceVisibility: "" }}
           >
             <CardContent className="flex flex-col items-center justify-center min-h-[300px] p-8">

[Survived] ConditionalExpression
src/components/flashcards/Deck.tsx:150:16
           >
             <CardContent className="flex flex-col items-center justify-center min-h-[300px] p-8">
               <h2 className="text-4xl font-bold text-center mb-4">{vocab.word}</h2>
-              {vocab.pronunciation && (
-                <p className="text-lg text-muted-foreground mb-4">
-                  {vocab.pronunciation}
-                </p>
-              )}
+              {true}
               <p className="text-sm text-muted-foreground">Click to reveal</p>
             </CardContent>

[Survived] ConditionalExpression
src/components/flashcards/Deck.tsx:150:16
           >
             <CardContent className="flex flex-col items-center justify-center min-h-[300px] p-8">
               <h2 className="text-4xl font-bold text-center mb-4">{vocab.word}</h2>
-              {vocab.pronunciation && (
-                <p className="text-lg text-muted-foreground mb-4">
-                  {vocab.pronunciation}
-                </p>
-              )}
+              {false}
               <p className="text-sm text-muted-foreground">Click to reveal</p>
             </CardContent>

[Survived] LogicalOperator
src/components/flashcards/Deck.tsx:163:15
           <Card
             className={cn(
               "min-h-[300px] absolute inset-0",
-              !isFlipped && "invisible"
+              !isFlipped || "invisible"
             )}
             style={{

[Survived] ConditionalExpression
src/components/flashcards/Deck.tsx:163:15
           <Card
             className={cn(
               "min-h-[300px] absolute inset-0",
-              !isFlipped && "invisible"
+              false
             )}
             style={{

[Survived] LogicalOperator
src/components/flashcards/Deck.tsx:172:16
           >
             <CardContent className="flex flex-col items-center justify-center min-h-[300px] p-8">
               <h2 className="text-2xl font-bold text-center mb-2">{vocab.word}</h2>
-              {vocab.pronunciation && (
-                <p className="text-muted-foreground mb-3">{vocab.pronunciation}</p>
-              )}
+              {vocab.pronunciation || <p className="text-muted-foreground mb-3">{vocab.pronunciation}</p>}
               <p className="text-2xl font-semibold text-primary mb-3 text-center">
                 {getTranslation(vocab)}

[Survived] ConditionalExpression
src/components/flashcards/Deck.tsx:172:16
           >
             <CardContent className="flex flex-col items-center justify-center min-h-[300px] p-8">
               <h2 className="text-2xl font-bold text-center mb-2">{vocab.word}</h2>
-              {vocab.pronunciation && (
-                <p className="text-muted-foreground mb-3">{vocab.pronunciation}</p>
-              )}
+              {true}
               <p className="text-2xl font-semibold text-primary mb-3 text-center">
                 {getTranslation(vocab)}

[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:178:16
               <p className="text-2xl font-semibold text-primary mb-3 text-center">
                 {getTranslation(vocab)}
               </p>
-              {vocab.part_of_speech && (
-                <span className="text-sm bg-muted px-3 py-1 rounded-full mb-3">
-                  {vocab.part_of_speech}
-                </span>
-              )}
+              {false}
               {currentCard.context_sentence && (
                 <p className="text-sm text-muted-foreground italic text-center max-w-md mt-2">
killedBy: Deck shows pronunciation, part of speech, and context sentence on back after flip
statusReason: Unable to find an element with the text: noun. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >

[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:178:16
               <p className="text-2xl font-semibold text-primary mb-3 text-center">
                 {getTranslation(vocab)}
               </p>
-              {vocab.part_of_speech && (
-                <span className="text-sm bg-muted px-3 py-1 rounded-full mb-3">
-                  {vocab.part_of_speech}
-                </span>
-              )}
+              {true}
               {currentCard.context_sentence && (
                 <p className="text-sm text-muted-foreground italic text-center max-w-md mt-2">
killedBy: Deck shows pronunciation, part of speech, and context sentence on back after flip
statusReason: Unable to find an element with the text: noun. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >
