[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:183:16
                   {vocab.part_of_speech}
                 </span>
               )}
-              {currentCard.context_sentence && (
-                <p className="text-sm text-muted-foreground italic text-center max-w-md mt-2">
-                  &ldquo;{currentCard.context_sentence}&rdquo;
-                </p>
-              )}
+              {false}
             </CardContent>
           </Card>
killedBy: Deck shows pronunciation, part of speech, and context sentence on back after flip
statusReason: Unable to find an element with the text: /El gato duerme/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >

[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:183:16
                   {vocab.part_of_speech}
                 </span>
               )}
-              {currentCard.context_sentence && (
-                <p className="text-sm text-muted-foreground italic text-center max-w-md mt-2">
-                  &ldquo;{currentCard.context_sentence}&rdquo;
-                </p>
-              )}
+              {true}
             </CardContent>
           </Card>
killedBy: Deck shows pronunciation, part of speech, and context sentence on back after flip
statusReason: Unable to find an element with the text: /El gato duerme/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >

[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:199:21
           variant="outline"
           size="icon"
           onClick={goToPrev}
-          disabled={current === 0}
+          disabled={false}
         >
           <ArrowLeft className="h-4 w-4" />
killedBy: Deck prev button is disabled at index 0; next button is disabled at the last card
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  data-size="icon"
  data-slot="button"
  data-variant="outline"

[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:199:21
           variant="outline"
           size="icon"
           onClick={goToPrev}
-          disabled={current === 0}
+          disabled={true}
         >
           <ArrowLeft className="h-4 w-4" />
killedBy: Deck prev button is disabled at index 0; next button is disabled at the last card
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  data-size="icon"
  data-slot="button"
  data-variant="outline"

[Killed] ArithmeticOperator
src/components/flashcards/Deck.tsx:204:12
           <ArrowLeft className="h-4 w-4" />
         </Button>
         <span className="text-sm font-medium min-w-[80px] text-center">
-          {current + 1} / {cards.length}
+          {current - 1} / {cards.length}
         </span>
         <Button
killedBy: Deck renders loading then cards from API
statusReason: Unable to find an element with the text: 1 / 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >

[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:210:21
           variant="outline"
           size="icon"
           onClick={goToNext}
-          disabled={current === cards.length - 1}
+          disabled={true}
         >
           <ArrowRight className="h-4 w-4" />
killedBy: Deck navigates between cards and flips with keyboard
statusReason: Unable to find an element with the text: perro. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center space-y-6"
    >

[Killed] ConditionalExpression
src/components/flashcards/Deck.tsx:210:21
           variant="outline"
           size="icon"
           onClick={goToNext}
-          disabled={current === cards.length - 1}
+          disabled={false}
         >
           <ArrowRight className="h-4 w-4" />
killedBy: Deck prev button is disabled at index 0; next button is disabled at the last card
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  data-size="icon"
  data-slot="button"
  data-variant="outline"
