[Killed] BooleanLiteral
src/components/flashcards/Flashcard.tsx:16:48
   showAnswer?: boolean;
 }
 
-export function FlashCard({ card, showAnswer = false }: FlashCardProps) {
+export function FlashCard({ card, showAnswer = true }: FlashCardProps) {
   const [isFlipped, setIsFlipped] = useState(showAnswer);
 
killedBy: FlashCard toggles flip state on click
statusReason: expect(element).not.toHaveClass("rotate-y-180")

Expected the element not to have class:
  rotate-y-180
Received:
  relative w-full h-full duration-500 preserve-3d rotate-y-180

[Killed] BlockStatement
src/components/flashcards/Flashcard.tsx:20:19
   const [isFlipped, setIsFlipped] = useState(showAnswer);
 
   // Sync isFlipped state when showAnswer prop changes
-  useEffect(() => {
-    setIsFlipped(showAnswer);
-  }, [showAnswer]);
+  useEffect(() => {}, [showAnswer]);
 
   return (
killedBy: FlashCard syncs with showAnswer prop changes
statusReason: expect(element).toHaveClass("rotate-y-180")

Expected the element to have class:
  rotate-y-180
Received:
  relative w-full h-full duration-500 preserve-3d

[Killed] BooleanLiteral
src/components/flashcards/Flashcard.tsx:29:35
       role="button"
       tabIndex={0}
       className="relative w-full h-80 md:h-96 cursor-pointer perspective-1000 group focus:outline-none focus:ring-2 focus:ring-offset-2 rounded-xl"
-      onClick={() => setIsFlipped(!isFlipped)}
+      onClick={() => setIsFlipped(isFlipped)}
       onKeyDown={(e) => {
         if (e.key === 'Enter' || e.key === ' ') {
killedBy: FlashCard toggles flip state on click
statusReason: expect(element).toHaveClass("rotate-y-180")

Expected the element to have class:
  rotate-y-180
Received:
  relative w-full h-full duration-500 preserve-3d

[Killed] ArrowFunction
src/components/flashcards/Flashcard.tsx:29:16
       role="button"
       tabIndex={0}
       className="relative w-full h-80 md:h-96 cursor-pointer perspective-1000 group focus:outline-none focus:ring-2 focus:ring-offset-2 rounded-xl"
-      onClick={() => setIsFlipped(!isFlipped)}
+      onClick={() => undefined}
       onKeyDown={(e) => {
         if (e.key === 'Enter' || e.key === ' ') {
killedBy: FlashCard toggles flip state on click
statusReason: expect(element).toHaveClass("rotate-y-180")

Expected the element to have class:
  rotate-y-180
Received:
  relative w-full h-full duration-500 preserve-3d

[Killed] BlockStatement
src/components/flashcards/Flashcard.tsx:30:25
       tabIndex={0}
       className="relative w-full h-80 md:h-96 cursor-pointer perspective-1000 group focus:outline-none focus:ring-2 focus:ring-offset-2 rounded-xl"
       onClick={() => setIsFlipped(!isFlipped)}
-      onKeyDown={(e) => {
-        if (e.key === 'Enter' || e.key === ' ') {
-          e.preventDefault();
-          setIsFlipped(!isFlipped);
-        }
-      }}
+      onKeyDown={(e) => {}}
     >
       <div
killedBy: FlashCard toggles flip state with keyboard Enter and Space
statusReason: expect(element).toHaveClass("rotate-y-180")

Expected the element to have class:
  rotate-y-180
Received:
  relative w-full h-full duration-500 preserve-3d

[Killed] BlockStatement
src/components/flashcards/Flashcard.tsx:31:49
       className="relative w-full h-80 md:h-96 cursor-pointer perspective-1000 group focus:outline-none focus:ring-2 focus:ring-offset-2 rounded-xl"
       onClick={() => setIsFlipped(!isFlipped)}
       onKeyDown={(e) => {
-        if (e.key === 'Enter' || e.key === ' ') {
-          e.preventDefault();
-          setIsFlipped(!isFlipped);
-        }
+        if (e.key === 'Enter' || e.key === ' ') {}
       }}
     >
killedBy: FlashCard toggles flip state with keyboard Enter and Space
statusReason: expect(element).toHaveClass("rotate-y-180")

Expected the element to have class:
  rotate-y-180
Received:
  relative w-full h-full duration-500 preserve-3d

[Killed] ConditionalExpression
src/components/flashcards/Flashcard.tsx:31:13
       className="relative w-full h-80 md:h-96 cursor-pointer perspective-1000 group focus:outline-none focus:ring-2 focus:ring-offset-2 rounded-xl"
       onClick={() => setIsFlipped(!isFlipped)}
       onKeyDown={(e) => {
-        if (e.key === 'Enter' || e.key === ' ') {
+        if (false) {
           e.preventDefault();
           setIsFlipped(!isFlipped);
killedBy: FlashCard toggles flip state with keyboard Enter and Space
statusReason: expect(element).toHaveClass("rotate-y-180")

Expected the element to have class:
  rotate-y-180
Received:
  relative w-full h-full duration-500 preserve-3d

[Survived] StringLiteral
src/components/flashcards/Flashcard.tsx:38:100
       }}
     >
       <div
-        className={`relative w-full h-full duration-500 preserve-3d ${isFlipped ? 'rotate-y-180' : ''
+        className={`relative w-full h-full duration-500 preserve-3d ${isFlipped ? 'rotate-y-180' : "Stryker was here!"
           }`}
       >
