[Killed] BooleanLiteral
src/components/flashcards/FlashcardCard.tsx:43:62
 }
 
 export function FlashcardCard({ card, isFlipped, onFlip }: FlashcardCardProps) {
-  const [showPronunciation, setShowPronunciation] = useState(false);
+  const [showPronunciation, setShowPronunciation] = useState(true);
   const [showHint, setShowHint] = useState(false);
 
killedBy: FlashcardCard second pronunciation click hides the pronunciation text
statusReason: expected [ <p …(1)></p> ] to have a length of 2 but got 1

[Killed] BooleanLiteral
src/components/flashcards/FlashcardCard.tsx:44:44
 
 export function FlashcardCard({ card, isFlipped, onFlip }: FlashcardCardProps) {
   const [showPronunciation, setShowPronunciation] = useState(false);
-  const [showHint, setShowHint] = useState(false);
+  const [showHint, setShowHint] = useState(true);
 
   const vocab = card.vocabulary;
killedBy: FlashcardCard second hint click hides the context sentence
statusReason: expected [ <p …(1)></p> ] to have a length of 2 but got 1

[Killed] BlockStatement
src/components/flashcards/FlashcardCard.tsx:48:32
 
   const vocab = card.vocabulary;
 
-  const getTranslation = () => {
-    if (vocab.definitions?.translation) return vocab.definitions.translation;
-    if (vocab.definitions?.definitions?.[0]) return vocab.definitions.definitions[0];
-    return "No translation";
-  };
+  const getTranslation = () => {};
 
   const handleCardClick = () => {
killedBy: FlashcardCard renders back-side details when flipped
statusReason: Unable to find an element with the text: book. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="perspective-1000 w-full max-w-xl mx-auto"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:49:9
   const vocab = card.vocabulary;
 
   const getTranslation = () => {
-    if (vocab.definitions?.translation) return vocab.definitions.translation;
+    if (true) return vocab.definitions.translation;
     if (vocab.definitions?.definitions?.[0]) return vocab.definitions.definitions[0];
     return "No translation";
killedBy: FlashcardCard falls back to first definition when translation is missing
statusReason: Unable to find an element with the text: fallback definition. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="perspective-1000 w-full max-w-xl mx-auto"
    >

[Killed] OptionalChaining
src/components/flashcards/FlashcardCard.tsx:49:9
   const vocab = card.vocabulary;
 
   const getTranslation = () => {
-    if (vocab.definitions?.translation) return vocab.definitions.translation;
+    if (vocab.definitions.translation) return vocab.definitions.translation;
     if (vocab.definitions?.definitions?.[0]) return vocab.definitions.definitions[0];
     return "No translation";
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:50:9
 
   const getTranslation = () => {
     if (vocab.definitions?.translation) return vocab.definitions.translation;
-    if (vocab.definitions?.definitions?.[0]) return vocab.definitions.definitions[0];
+    if (false) return vocab.definitions.definitions[0];
     return "No translation";
   };
killedBy: FlashcardCard falls back to first definition when translation is missing
statusReason: Unable to find an element with the text: fallback definition. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="perspective-1000 w-full max-w-xl mx-auto"
    >

[Killed] BlockStatement
src/components/flashcards/FlashcardCard.tsx:54:33
     return "No translation";
   };
 
-  const handleCardClick = () => {
-    if (!isFlipped) {
-      onFlip();
-    }
-  };
+  const handleCardClick = () => {};
 
   const handlePronunciationClick = (e: React.MouseEvent) => {
killedBy: FlashcardCard calls onFlip from container click only when not flipped
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/components/flashcards/FlashcardCard.tsx:55:9
   };
 
   const handleCardClick = () => {
-    if (!isFlipped) {
+    if (isFlipped) {
       onFlip();
     }
killedBy: FlashcardCard calls onFlip from container click only when not flipped
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/components/flashcards/FlashcardCard.tsx:55:21
   };
 
   const handleCardClick = () => {
-    if (!isFlipped) {
-      onFlip();
-    }
+    if (!isFlipped) {}
   };
 
killedBy: FlashcardCard calls onFlip from container click only when not flipped
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/components/flashcards/FlashcardCard.tsx:60:61
     }
   };
 
-  const handlePronunciationClick = (e: React.MouseEvent) => {
-    e.stopPropagation();
-    setShowPronunciation(!showPronunciation);
-  };
+  const handlePronunciationClick = (e: React.MouseEvent) => {};
 
   const handleHintClick = (e: React.MouseEvent) => {
killedBy: FlashcardCard second pronunciation click hides the pronunciation text
statusReason: expected [ <p …(1)></p> ] to have a length of 2 but got 1

[Killed] BooleanLiteral
src/components/flashcards/FlashcardCard.tsx:62:26
 
   const handlePronunciationClick = (e: React.MouseEvent) => {
     e.stopPropagation();
-    setShowPronunciation(!showPronunciation);
+    setShowPronunciation(showPronunciation);
   };
 
killedBy: FlashcardCard second pronunciation click hides the pronunciation text
statusReason: expected [ <p …(1)></p> ] to have a length of 2 but got 1

[Killed] BlockStatement
src/components/flashcards/FlashcardCard.tsx:65:52
     setShowPronunciation(!showPronunciation);
   };
 
-  const handleHintClick = (e: React.MouseEvent) => {
-    e.stopPropagation();
-    setShowHint(!showHint);
-  };
+  const handleHintClick = (e: React.MouseEvent) => {};
 
   return (
killedBy: FlashcardCard second hint click hides the context sentence
statusReason: expected [ <p …(1)></p> ] to have a length of 2 but got 1

[Killed] BooleanLiteral
src/components/flashcards/FlashcardCard.tsx:67:17
 
   const handleHintClick = (e: React.MouseEvent) => {
     e.stopPropagation();
-    setShowHint(!showHint);
+    setShowHint(showHint);
   };
 
killedBy: FlashcardCard second hint click hides the context sentence
statusReason: expected [ <p …(1)></p> ] to have a length of 2 but got 1

[Survived] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:75:11
       <div
         className={cn(
           "relative transition-transform duration-500 transform-style-3d cursor-pointer",
-          isFlipped && "rotate-y-180"
+          true
         )}
         style={{

[Survived] LogicalOperator
src/components/flashcards/FlashcardCard.tsx:75:11
       <div
         className={cn(
           "relative transition-transform duration-500 transform-style-3d cursor-pointer",
-          isFlipped && "rotate-y-180"
+          isFlipped || "rotate-y-180"
         )}
         style={{

[Survived] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:87:13
         <Card
           className={cn(
             "min-h-[400px] backface-hidden",
-            isFlipped && "invisible"
+            true
           )}
           style={{ backfaceVisibility: "hidden" }}

[Survived] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:87:13
         <Card
           className={cn(
             "min-h-[400px] backface-hidden",
-            isFlipped && "invisible"
+            false
           )}
           style={{ backfaceVisibility: "hidden" }}

[Killed] LogicalOperator
src/components/flashcards/FlashcardCard.tsx:96:16
 
             {/* Hint buttons */}
             <div className="flex gap-2 mb-6">
-              {vocab.pronunciation && (
-                <Button
-                  variant="outline"
-                  size="sm"
-                  onClick={handlePronunciationClick}
-                  className="gap-2"
-                >
-                  <Volume2 className="h-4 w-4" />
-                  Pronunciation
-                </Button>
-              )}
+              {vocab.pronunciation || <Button variant="outline" size="sm" onClick={handlePronunciationClick} className="gap-2">
+                  <Volume2 className="h-4 w-4" />
+                  Pronunciation
+                </Button>}
               {card.context_sentence && (
                 <Button
killedBy: FlashcardCard renders front content and hint controls
statusReason: Unable to find an accessible element with the role "button" and name `/pronunciation/i`

Here are the accessible roles:

  heading:

  Name "libro":
  <h2

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:96:16
 
             {/* Hint buttons */}
             <div className="flex gap-2 mb-6">
-              {vocab.pronunciation && (
-                <Button
-                  variant="outline"
-                  size="sm"
-                  onClick={handlePronunciationClick}
-                  className="gap-2"
-                >
-                  <Volume2 className="h-4 w-4" />
-                  Pronunciation
-                </Button>
-              )}
+              {false}
               {card.context_sentence && (
                 <Button
killedBy: FlashcardCard renders front content and hint controls
statusReason: Unable to find an accessible element with the role "button" and name `/pronunciation/i`

Here are the accessible roles:

  heading:

  Name "libro":
  <h2

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:107:16
                   Pronunciation
                 </Button>
               )}
-              {card.context_sentence && (
-                <Button
-                  variant="outline"
-                  size="sm"
-                  onClick={handleHintClick}
-                  className="gap-2"
-                >
-                  <Lightbulb className="h-4 w-4" />
-                  Hint
-                </Button>
-              )}
+              {true}
             </div>
 
killedBy: FlashcardCard renders front content and hint controls
statusReason: Unable to find an accessible element with the role "button" and name `/hint/i`

Here are the accessible roles:

  heading:

  Name "libro":
  <h2

[Killed] LogicalOperator
src/components/flashcards/FlashcardCard.tsx:107:16
                   Pronunciation
                 </Button>
               )}
-              {card.context_sentence && (
-                <Button
-                  variant="outline"
-                  size="sm"
-                  onClick={handleHintClick}
-                  className="gap-2"
-                >
-                  <Lightbulb className="h-4 w-4" />
-                  Hint
-                </Button>
-              )}
+              {card.context_sentence || <Button variant="outline" size="sm" onClick={handleHintClick} className="gap-2">
+                  <Lightbulb className="h-4 w-4" />
+                  Hint
+                </Button>}
             </div>
 
killedBy: FlashcardCard renders front content and hint controls
statusReason: Unable to find an accessible element with the role "button" and name `/hint/i`

Here are the accessible roles:

  heading:

  Name "libro":
  <h2

[Killed] LogicalOperator
src/components/flashcards/FlashcardCard.tsx:121:14
             </div>
 
             {/* Pronunciation hint */}
-            {showPronunciation && vocab.pronunciation && (
+            {showPronunciation || vocab.pronunciation && (
               <p className="text-lg text-muted-foreground mb-2">
                 {vocab.pronunciation}
killedBy: FlashcardCard second pronunciation click hides the pronunciation text
statusReason: expected [ <p …(1)></p>, <p …(1)></p> ] to have a length of 1 but got 2

[Killed] LogicalOperator
src/components/flashcards/FlashcardCard.tsx:121:14
             </div>
 
             {/* Pronunciation hint */}
-            {showPronunciation && vocab.pronunciation && (
-              <p className="text-lg text-muted-foreground mb-2">
-                {vocab.pronunciation}
-              </p>
-            )}
+            {showPronunciation && vocab.pronunciation || <p className="text-lg text-muted-foreground mb-2">
+                {vocab.pronunciation}
+              </p>}
 
             {/* Context hint */}
killedBy: FlashcardCard second pronunciation click hides the pronunciation text
statusReason: expected [ <p …(1)></p>, <p …(1)></p> ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:128:14
             )}
 
             {/* Context hint */}
-            {showHint && card.context_sentence && (
-              <p className="text-sm text-muted-foreground italic text-center max-w-xs">
-                &ldquo;{card.context_sentence}&rdquo;
-              </p>
-            )}
+            {true}
 
             <Button variant="default" className="mt-6" onClick={onFlip}>
killedBy: FlashcardCard second hint click hides the context sentence
statusReason: expected [ <p …(1)></p> ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:128:14
             )}
 
             {/* Context hint */}
-            {showHint && card.context_sentence && (
+            {true && (
               <p className="text-sm text-muted-foreground italic text-center max-w-xs">
                 &ldquo;{card.context_sentence}&rdquo;
killedBy: FlashcardCard second hint click hides the context sentence
statusReason: expected [ <p …(1)></p>, <p …(1)></p> ] to have a length of 1 but got 2

[Survived] BooleanLiteral
src/components/flashcards/FlashcardCard.tsx:144:13
         <Card
           className={cn(
             "min-h-[400px] absolute inset-0 backface-hidden",
-            !isFlipped && "invisible"
+            isFlipped && "invisible"
           )}
           style={{

[Survived] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:144:13
         <Card
           className={cn(
             "min-h-[400px] absolute inset-0 backface-hidden",
-            !isFlipped && "invisible"
+            true
           )}
           style={{

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:154:14
           <CardContent className="flex flex-col items-center justify-center min-h-[400px] p-8">
             <h2 className="text-3xl font-bold text-center mb-2">{vocab.word}</h2>
 
-            {vocab.pronunciation && (
-              <p className="text-lg text-muted-foreground mb-3">
-                {vocab.pronunciation}
-              </p>
-            )}
+            {true}
 
             <p className="text-2xl font-semibold text-primary mb-3 text-center">
killedBy: FlashcardCard second pronunciation click hides the pronunciation text
statusReason: expected [ <p …(1)></p> ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:154:14
           <CardContent className="flex flex-col items-center justify-center min-h-[400px] p-8">
             <h2 className="text-3xl font-bold text-center mb-2">{vocab.word}</h2>
 
-            {vocab.pronunciation && (
-              <p className="text-lg text-muted-foreground mb-3">
-                {vocab.pronunciation}
-              </p>
-            )}
+            {false}
 
             <p className="text-2xl font-semibold text-primary mb-3 text-center">
killedBy: FlashcardCard second pronunciation click hides the pronunciation text
statusReason: expected [ <p …(1)></p> ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:164:14
               {getTranslation()}
             </p>
 
-            {vocab.part_of_speech && (
-              <span className="text-sm bg-muted px-3 py-1 rounded-full mb-3">
-                {vocab.part_of_speech}
-              </span>
-            )}
+            {false}
 
             {vocab.definitions?.definitions && vocab.definitions.definitions.length > 1 && (
killedBy: FlashcardCard renders back-side details when flipped
statusReason: Unable to find an element with the text: noun. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="perspective-1000 w-full max-w-xl mx-auto"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:164:14
               {getTranslation()}
             </p>
 
-            {vocab.part_of_speech && (
-              <span className="text-sm bg-muted px-3 py-1 rounded-full mb-3">
-                {vocab.part_of_speech}
-              </span>
-            )}
+            {true}
 
             {vocab.definitions?.definitions && vocab.definitions.definitions.length > 1 && (
killedBy: FlashcardCard renders back-side details when flipped
statusReason: Unable to find an element with the text: noun. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="perspective-1000 w-full max-w-xl mx-auto"
    >

[Killed] EqualityOperator
src/components/flashcards/FlashcardCard.tsx:170:48
               </span>
             )}
 
-            {vocab.definitions?.definitions && vocab.definitions.definitions.length > 1 && (
+            {vocab.definitions?.definitions && vocab.definitions.definitions.length <= 1 && (
               <div className="text-sm text-muted-foreground mb-3 text-center max-w-md">
                 {vocab.definitions.definitions.slice(1, 3).map((def, i) => (
killedBy: FlashcardCard renders back-side details when flipped
statusReason: Unable to find an element with the text: volume. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="perspective-1000 w-full max-w-xl mx-auto"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:170:14
               </span>
             )}
 
-            {vocab.definitions?.definitions && vocab.definitions.definitions.length > 1 && (
+            {true && (
               <div className="text-sm text-muted-foreground mb-3 text-center max-w-md">
                 {vocab.definitions.definitions.slice(1, 3).map((def, i) => (
killedBy: FlashcardCard shows "No translation" when definitions object is empty
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] ArrowFunction
src/components/flashcards/FlashcardCard.tsx:172:64
 
             {vocab.definitions?.definitions && vocab.definitions.definitions.length > 1 && (
               <div className="text-sm text-muted-foreground mb-3 text-center max-w-md">
-                {vocab.definitions.definitions.slice(1, 3).map((def, i) => (
-                  <p key={i}>{def}</p>
-                ))}
+                {vocab.definitions.definitions.slice(1, 3).map(() => undefined)}
               </div>
             )}
killedBy: FlashcardCard renders back-side details when flipped
statusReason: Unable to find an element with the text: volume. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="perspective-1000 w-full max-w-xl mx-auto"
    >

[Killed] MethodExpression
src/components/flashcards/FlashcardCard.tsx:172:18
 
             {vocab.definitions?.definitions && vocab.definitions.definitions.length > 1 && (
               <div className="text-sm text-muted-foreground mb-3 text-center max-w-md">
-                {vocab.definitions.definitions.slice(1, 3).map((def, i) => (
+                {vocab.definitions.definitions.map((def, i) => (
                   <p key={i}>{def}</p>
                 ))}
killedBy: FlashcardCard renders back-side details when flipped
statusReason: Found multiple elements with the text: book

Here are the matching elements:

Ignored nodes: comments, script, style
<p
  class="text-2xl font-semibold text-primary mb-3 text-center"
>

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:178:14
               </div>
             )}
 
-            {card.context_sentence && (
-              <p className="text-sm text-muted-foreground italic text-center max-w-md mt-2">
-                &ldquo;{card.context_sentence}&rdquo;
-              </p>
-            )}
+            {true}
 
             <div className="mt-4 text-xs text-muted-foreground">
killedBy: FlashcardCard second hint click hides the context sentence
statusReason: expected [ <p …(1)></p> ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/components/flashcards/FlashcardCard.tsx:178:14
               </div>
             )}
 
-            {card.context_sentence && (
-              <p className="text-sm text-muted-foreground italic text-center max-w-md mt-2">
-                &ldquo;{card.context_sentence}&rdquo;
-              </p>
-            )}
+            {false}
 
             <div className="mt-4 text-xs text-muted-foreground">
killedBy: FlashcardCard second hint click hides the context sentence
statusReason: expected [ <p …(1)></p> ] to have a length of 2 but got 1
