[Survived] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:29:46
 export function FlashcardReview({ onClose }: FlashcardReviewProps) {
   const [reviewState, setReviewState] = useState<ReviewState | null>(null);
   const [currentIndex, setCurrentIndex] = useState(0);
-  const [isFlipped, setIsFlipped] = useState(false);
+  const [isFlipped, setIsFlipped] = useState(true);
   const [isLoading, setIsLoading] = useState(true);
   const [isSubmitting, setIsSubmitting] = useState(false);

[Survived] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:30:46
   const [reviewState, setReviewState] = useState<ReviewState | null>(null);
   const [currentIndex, setCurrentIndex] = useState(0);
   const [isFlipped, setIsFlipped] = useState(false);
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
   const [isSubmitting, setIsSubmitting] = useState(false);
   const [error, setError] = useState<string | null>(null);

[Killed] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:31:52
   const [currentIndex, setCurrentIndex] = useState(0);
   const [isFlipped, setIsFlipped] = useState(false);
   const [isLoading, setIsLoading] = useState(true);
-  const [isSubmitting, setIsSubmitting] = useState(false);
+  const [isSubmitting, setIsSubmitting] = useState(true);
   const [error, setError] = useState<string | null>(null);
   const [completedCount, setCompletedCount] = useState(0);
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] BlockStatement
src/components/flashcards/FlashcardReview.tsx:35:46
   const [error, setError] = useState<string | null>(null);
   const [completedCount, setCompletedCount] = useState(0);
 
-  const fetchCards = useCallback(async () => {
-    try {
-      setIsLoading(true);
-      setError(null);
-      const response = await fetch("/api/vocabulary/review");
-      if (!response.ok) throw new Error("Failed to fetch cards");
-      const data = await response.json();
-      setReviewState(data);
-    } catch (err) {
-      setError(err instanceof Error ? err.message : "Failed to load cards");
-    } finally {
-      setIsLoading(false);
-    }
-  }, []);
+  const fetchCards = useCallback(async () => {}, []);
 
   useEffect(() => {
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: Review Session. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex items-center justify-center"
    >

[Killed] BlockStatement
src/components/flashcards/FlashcardReview.tsx:36:9
   const [completedCount, setCompletedCount] = useState(0);
 
   const fetchCards = useCallback(async () => {
-    try {
-      setIsLoading(true);
-      setError(null);
-      const response = await fetch("/api/vocabulary/review");
-      if (!response.ok) throw new Error("Failed to fetch cards");
-      const data = await response.json();
-      setReviewState(data);
-    } catch (err) {
+    try {} catch (err) {
       setError(err instanceof Error ? err.message : "Failed to load cards");
     } finally {
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: Review Session. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:40:11
       setIsLoading(true);
       setError(null);
       const response = await fetch("/api/vocabulary/review");
-      if (!response.ok) throw new Error("Failed to fetch cards");
+      if (true) throw new Error("Failed to fetch cards");
       const data = await response.json();
       setReviewState(data);
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: Review Session. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex items-center justify-center p-4"
    >

[Killed] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:40:11
       setIsLoading(true);
       setError(null);
       const response = await fetch("/api/vocabulary/review");
-      if (!response.ok) throw new Error("Failed to fetch cards");
+      if (response.ok) throw new Error("Failed to fetch cards");
       const data = await response.json();
       setReviewState(data);
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: Review Session. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex items-center justify-center p-4"
    >

[Killed] BlockStatement
src/components/flashcards/FlashcardReview.tsx:43:19
       if (!response.ok) throw new Error("Failed to fetch cards");
       const data = await response.json();
       setReviewState(data);
-    } catch (err) {
-      setError(err instanceof Error ? err.message : "Failed to load cards");
-    } finally {
+    } catch (err) {} finally {
       setIsLoading(false);
     }
killedBy: FlashcardReview renders error state and retries
statusReason: Unable to find an element with the text: Failed to fetch cards. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/components/flashcards/FlashcardReview.tsx:45:15
       setReviewState(data);
     } catch (err) {
       setError(err instanceof Error ? err.message : "Failed to load cards");
-    } finally {
-      setIsLoading(false);
-    }
+    } finally {}
   }, []);
 
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: Review Session. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex items-center justify-center"
    >

[Killed] BlockStatement
src/components/flashcards/FlashcardReview.tsx:50:19
     }
   }, []);
 
-  useEffect(() => {
-    fetchCards();
-  }, [fetchCards]);
+  useEffect(() => {}, [fetchCards]);
 
   const handleResponse = async (response: ResponseQuality) => {
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: Review Session. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex items-center justify-center"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:55:9
   }, [fetchCards]);
 
   const handleResponse = async (response: ResponseQuality) => {
-    if (!reviewState || isSubmitting) return;
+    if (true) return;
 
     const currentCard = reviewState.cards[currentIndex];
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:55:9
   }, [fetchCards]);
 
   const handleResponse = async (response: ResponseQuality) => {
-    if (!reviewState || isSubmitting) return;
+    if (reviewState || isSubmitting) return;
 
     const currentCard = reviewState.cards[currentIndex];
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:58:9
     if (!reviewState || isSubmitting) return;
 
     const currentCard = reviewState.cards[currentIndex];
-    if (!currentCard) return;
+    if (currentCard) return;
 
     try {
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:58:9
     if (!reviewState || isSubmitting) return;
 
     const currentCard = reviewState.cards[currentIndex];
-    if (!currentCard) return;
+    if (true) return;
 
     try {
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Survived] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:61:23
     if (!currentCard) return;
 
     try {
-      setIsSubmitting(true);
+      setIsSubmitting(false);
       const res = await fetch("/api/vocabulary/review", {
         method: "POST",

[Killed] StringLiteral
src/components/flashcards/FlashcardReview.tsx:62:31
 
     try {
       setIsSubmitting(true);
-      const res = await fetch("/api/vocabulary/review", {
+      const res = await fetch("", {
         method: "POST",
         headers: { "Content-Type": "application/json" },
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: expected "vi.fn()" to be called with arguments: [ '/api/vocabulary/review', …(1) ]

Received:

  1st vi.fn() call:

  [
    "/api/vocabulary/review",

[Killed] ObjectLiteral
src/components/flashcards/FlashcardReview.tsx:65:30
       const res = await fetch("/api/vocabulary/review", {
         method: "POST",
         headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({
-          cardId: currentCard.id,
-          response,
-        }),
+        body: JSON.stringify({}),
       });
 
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: expected "vi.fn()" to be called with arguments: [ '/api/vocabulary/review', …(1) ]

Received:

  1st vi.fn() call:

  [
    "/api/vocabulary/review",

[Survived] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:73:13
 
       if (!res.ok) {
         const data = await res.json();
-        if (data.limitReached) {
+        if (false) {
           setReviewState((prev) =>
             prev ? { ...prev, limitReached: true } : null

[Survived] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:73:13
 
       if (!res.ok) {
         const data = await res.json();
-        if (data.limitReached) {
+        if (true) {
           setReviewState((prev) =>
             prev ? { ...prev, limitReached: true } : null

[Survived] ArrowFunction
src/components/flashcards/FlashcardReview.tsx:74:26
       if (!res.ok) {
         const data = await res.json();
         if (data.limitReached) {
-          setReviewState((prev) =>
-            prev ? { ...prev, limitReached: true } : null
+          setReviewState(() => undefined
           );
           return;

[Survived] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:75:45
         const data = await res.json();
         if (data.limitReached) {
           setReviewState((prev) =>
-            prev ? { ...prev, limitReached: true } : null
+            prev ? { ...prev, limitReached: false } : null
           );
           return;

[Survived] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:79:25
           );
           return;
         }
-        throw new Error(data.error || "Failed to submit review");
+        throw new Error(true);
       }
 

[Survived] LogicalOperator
src/components/flashcards/FlashcardReview.tsx:79:25
           );
           return;
         }
-        throw new Error(data.error || "Failed to submit review");
+        throw new Error(data.error && "Failed to submit review");
       }
 

[Survived] ArithmeticOperator
src/components/flashcards/FlashcardReview.tsx:85:35
       const result = await res.json();
 
       // Update state
-      setCompletedCount((prev) => prev + 1);
+      setCompletedCount((prev) => prev - 1);
       setReviewState((prev) =>
         prev

[Survived] ArrowFunction
src/components/flashcards/FlashcardReview.tsx:85:25
       const result = await res.json();
 
       // Update state
-      setCompletedCount((prev) => prev + 1);
+      setCompletedCount(() => undefined);
       setReviewState((prev) =>
         prev

[Killed] ArrowFunction
src/components/flashcards/FlashcardReview.tsx:86:22
 
       // Update state
       setCompletedCount((prev) => prev + 1);
-      setReviewState((prev) =>
-        prev
-          ? {
-              ...prev,
-              dailyReviewsUsed: result.dailyReviewsUsed,
-              remainingReviews: result.remainingReviews,
-              limitReached: result.limitReached,
-            }
-          : null
+      setReviewState(() => undefined
       );
 
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:98:20
       );
 
       // Move to next card
-      setIsFlipped(false);
+      setIsFlipped(true);
       setCurrentIndex((prev) => prev + 1);
     } catch (err) {

[Killed] ArithmeticOperator
src/components/flashcards/FlashcardReview.tsx:99:33
 
       // Move to next card
       setIsFlipped(false);
-      setCurrentIndex((prev) => prev + 1);
+      setCurrentIndex((prev) => prev - 1);
     } catch (err) {
       setError(err instanceof Error ? err.message : "Failed to submit review");
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
src/components/flashcards/FlashcardReview.tsx:99:23
 
       // Move to next card
       setIsFlipped(false);
-      setCurrentIndex((prev) => prev + 1);
+      setCurrentIndex(() => undefined);
     } catch (err) {
       setError(err instanceof Error ? err.message : "Failed to submit review");
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] BlockStatement
src/components/flashcards/FlashcardReview.tsx:100:19
       // Move to next card
       setIsFlipped(false);
       setCurrentIndex((prev) => prev + 1);
-    } catch (err) {
-      setError(err instanceof Error ? err.message : "Failed to submit review");
-    } finally {
+    } catch (err) {} finally {
       setIsSubmitting(false);
     }

[Survived] StringLiteral
src/components/flashcards/FlashcardReview.tsx:101:53
       setIsFlipped(false);
       setCurrentIndex((prev) => prev + 1);
     } catch (err) {
-      setError(err instanceof Error ? err.message : "Failed to submit review");
+      setError(err instanceof Error ? err.message : "");
     } finally {
       setIsSubmitting(false);

[Survived] BlockStatement
src/components/flashcards/FlashcardReview.tsx:102:15
       setCurrentIndex((prev) => prev + 1);
     } catch (err) {
       setError(err instanceof Error ? err.message : "Failed to submit review");
-    } finally {
-      setIsSubmitting(false);
-    }
+    } finally {}
   };
 

[Killed] BlockStatement
src/components/flashcards/FlashcardReview.tsx:107:28
     }
   };
 
-  const handleFlip = () => {
-    setIsFlipped(true);
-  };
+  const handleFlip = () => {};
 
   useEffect(() => {
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: Unable to find an accessible element with the role "button" and name `/^good$/i`

Here are the accessible roles:

  heading:

  Name "Review Session":
  <h2

[Killed] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:108:18
   };
 
   const handleFlip = () => {
-    setIsFlipped(true);
+    setIsFlipped(false);
   };
 
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: Unable to find an accessible element with the role "button" and name `/^good$/i`

Here are the accessible roles:

  heading:

  Name "Review Session":
  <h2

[Killed] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:113:11
 
   useEffect(() => {
     const handleKeyDown = (event: KeyboardEvent) => {
-      if (!reviewState || isLoading || isSubmitting || reviewState.limitReached) {
+      if (reviewState || isLoading || isSubmitting || reviewState.limitReached) {
         return;
       }
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:113:11
 
   useEffect(() => {
     const handleKeyDown = (event: KeyboardEvent) => {
-      if (!reviewState || isLoading || isSubmitting || reviewState.limitReached) {
+      if (true) {
         return;
       }
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:117:11
         return;
       }
 
-      if (event.repeat) {
+      if (true) {
         return;
       }
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Survived] BlockStatement
src/components/flashcards/FlashcardReview.tsx:117:25
         return;
       }
 
-      if (event.repeat) {
-        return;
-      }
+      if (event.repeat) {}
 
       const target = event.target as HTMLElement | null;

[Killed] LogicalOperator
src/components/flashcards/FlashcardReview.tsx:123:9
 
       const target = event.target as HTMLElement | null;
       if (
-        target &&
-        (target.tagName === "INPUT" ||
-          target.tagName === "TEXTAREA" ||
-          target.tagName === "SELECT" ||
-          target.isContentEditable)
+        target || target.tagName === "INPUT" || target.tagName === "TEXTAREA" || target.tagName === "SELECT" || target.isContentEditable
       ) {
         return;
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:123:9
 
       const target = event.target as HTMLElement | null;
       if (
-        target &&
-        (target.tagName === "INPUT" ||
-          target.tagName === "TEXTAREA" ||
-          target.tagName === "SELECT" ||
-          target.isContentEditable)
+        true
       ) {
         return;
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] EqualityOperator
src/components/flashcards/FlashcardReview.tsx:124:10
       const target = event.target as HTMLElement | null;
       if (
         target &&
-        (target.tagName === "INPUT" ||
+        (target.tagName !== "INPUT" ||
           target.tagName === "TEXTAREA" ||
           target.tagName === "SELECT" ||
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] LogicalOperator
src/components/flashcards/FlashcardReview.tsx:124:10
       const target = event.target as HTMLElement | null;
       if (
         target &&
-        (target.tagName === "INPUT" ||
-          target.tagName === "TEXTAREA" ||
-          target.tagName === "SELECT" ||
-          target.isContentEditable)
+        ((target.tagName === "INPUT" || target.tagName === "TEXTAREA" || target.tagName === "SELECT") && target.isContentEditable)
       ) {
         return;
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] EqualityOperator
src/components/flashcards/FlashcardReview.tsx:125:11
       if (
         target &&
         (target.tagName === "INPUT" ||
-          target.tagName === "TEXTAREA" ||
+          target.tagName !== "TEXTAREA" ||
           target.tagName === "SELECT" ||
           target.isContentEditable)
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Survived] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:125:11
       if (
         target &&
         (target.tagName === "INPUT" ||
-          target.tagName === "TEXTAREA" ||
+          false ||
           target.tagName === "SELECT" ||
           target.isContentEditable)

[Killed] EqualityOperator
src/components/flashcards/FlashcardReview.tsx:126:11
         target &&
         (target.tagName === "INPUT" ||
           target.tagName === "TEXTAREA" ||
-          target.tagName === "SELECT" ||
+          target.tagName !== "SELECT" ||
           target.isContentEditable)
       ) {
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Survived] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:126:11
         target &&
         (target.tagName === "INPUT" ||
           target.tagName === "TEXTAREA" ||
-          target.tagName === "SELECT" ||
+          false ||
           target.isContentEditable)
       ) {

[Survived] BlockStatement
src/components/flashcards/FlashcardReview.tsx:128:9
           target.tagName === "TEXTAREA" ||
           target.tagName === "SELECT" ||
           target.isContentEditable)
-      ) {
-        return;
-      }
+      ) {}
 
       const key = event.key;

[Killed] EqualityOperator
src/components/flashcards/FlashcardReview.tsx:134:11
 
       const key = event.key;
 
-      if (key === " " || key === "Spacebar") {
+      if (key !== " " || key === "Spacebar") {
         if (!isFlipped) {
           event.preventDefault();
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] EqualityOperator
src/components/flashcards/FlashcardReview.tsx:134:26
 
       const key = event.key;
 
-      if (key === " " || key === "Spacebar") {
+      if (key === " " || key !== "Spacebar") {
         if (!isFlipped) {
           event.preventDefault();
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >
