[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:135:13
       const key = event.key;
 
       if (key === " " || key === "Spacebar") {
-        if (!isFlipped) {
+        if (false) {
           event.preventDefault();
           handleFlip();
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] BlockStatement
src/components/flashcards/FlashcardReview.tsx:135:25
       const key = event.key;
 
       if (key === " " || key === "Spacebar") {
-        if (!isFlipped) {
-          event.preventDefault();
-          handleFlip();
-        }
+        if (!isFlipped) {}
         return;
       }
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:142:11
         return;
       }
 
-      if (!isFlipped) {
+      if (true) {
         return;
       }
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:142:11
         return;
       }
 
-      if (!isFlipped) {
+      if (isFlipped) {
         return;
       }
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Survived] StringLiteral
src/components/flashcards/FlashcardReview.tsx:148:14
 
       const responseByKey: Partial<Record<string, ResponseQuality>> = {
         "1": "again",
-        "2": "hard",
+        "2": "",
         "3": "good",
         "4": "easy",

[Killed] StringLiteral
src/components/flashcards/FlashcardReview.tsx:149:14
       const responseByKey: Partial<Record<string, ResponseQuality>> = {
         "1": "again",
         "2": "hard",
-        "3": "good",
+        "3": "",
         "4": "easy",
       };
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Survived] StringLiteral
src/components/flashcards/FlashcardReview.tsx:150:14
         "1": "again",
         "2": "hard",
         "3": "good",
-        "4": "easy",
+        "4": "",
       };
 

[Killed] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:154:11
       };
 
       const response = responseByKey[key];
-      if (!response) {
+      if (response) {
         return;
       }
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:154:11
       };
 
       const response = responseByKey[key];
-      if (!response) {
+      if (true) {
         return;
       }
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] StringLiteral
src/components/flashcards/FlashcardReview.tsx:162:29
       handleResponse(response);
     };
 
-    window.addEventListener("keydown", handleKeyDown);
+    window.addEventListener("", handleKeyDown);
     return () => window.removeEventListener("keydown", handleKeyDown);
   }, [reviewState, isLoading, isSubmitting, isFlipped, handleResponse]);
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] ArrowFunction
src/components/flashcards/FlashcardReview.tsx:163:12
     };
 
     window.addEventListener("keydown", handleKeyDown);
-    return () => window.removeEventListener("keydown", handleKeyDown);
+    return () => undefined;
   }, [reviewState, isLoading, isSubmitting, isFlipped, handleResponse]);
 
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex items-center justify-center p-4"
    >

[Killed] ArrayDeclaration
src/components/flashcards/FlashcardReview.tsx:164:6
 
     window.addEventListener("keydown", handleKeyDown);
     return () => window.removeEventListener("keydown", handleKeyDown);
-  }, [reviewState, isLoading, isSubmitting, isFlipped, handleResponse]);
+  }, []);
 
   // Loading state
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:167:7
   }, [reviewState, isLoading, isSubmitting, isFlipped, handleResponse]);
 
   // Loading state
-  if (isLoading) {
+  if (true) {
     return (
       <div className="fixed inset-0 bg-background z-50 flex items-center justify-center">
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: Review Session. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex items-center justify-center"
    >

[Survived] BlockStatement
src/components/flashcards/FlashcardReview.tsx:167:18
   }, [reviewState, isLoading, isSubmitting, isFlipped, handleResponse]);
 
   // Loading state
-  if (isLoading) {
-    return (
-      <div className="fixed inset-0 bg-background z-50 flex items-center justify-center">
-        <Loader2 className="h-8 w-8 animate-spin text-primary" />
-      </div>
-    );
-  }
+  if (isLoading) {}
 
   // Error state

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:176:7
   }
 
   // Error state
-  if (error) {
+  if (false) {
     return (
       <div className="fixed inset-0 bg-background z-50 flex items-center justify-center p-4">
killedBy: FlashcardReview renders error state and retries
statusReason: Unable to find an element with the text: Failed to fetch cards. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:194:7
     );
   }
 
-  if (!reviewState) return null;
+  if (reviewState) return null;
 
   // No cards due
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: Review Session. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:194:7
     );
   }
 
-  if (!reviewState) return null;
+  if (true) return null;
 
   // No cards due
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: Review Session. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/components/flashcards/FlashcardReview.tsx:197:41
   if (!reviewState) return null;
 
   // No cards due
-  if (reviewState.cards.length === 0 && !reviewState.limitReached) {
+  if (reviewState.cards.length === 0 && reviewState.limitReached) {
     return (
       <div className="fixed inset-0 bg-background z-50 flex items-center justify-center p-4">
killedBy: FlashcardReview renders all-caught-up state when there are no cards
statusReason: Unable to find an element with the text: All caught up!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex items-center justify-center p-4"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:197:7
   if (!reviewState) return null;
 
   // No cards due
-  if (reviewState.cards.length === 0 && !reviewState.limitReached) {
+  if (true) {
     return (
       <div className="fixed inset-0 bg-background z-50 flex items-center justify-center p-4">
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: Review Session. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex items-center justify-center p-4"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:215:7
   }
 
   // Limit reached (paywall)
-  if (reviewState.limitReached) {
+  if (true) {
     return (
       <div className="fixed inset-0 bg-background z-50 flex items-center justify-center p-4">
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: Review Session. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex items-center justify-center p-4"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:215:7
   }
 
   // Limit reached (paywall)
-  if (reviewState.limitReached) {
+  if (false) {
     return (
       <div className="fixed inset-0 bg-background z-50 flex items-center justify-center p-4">
killedBy: FlashcardReview renders limit reached upgrade state
statusReason: Unable to find an element with the text: Daily Limit Reached. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Killed] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:228:7
   }
 
   // All cards completed
-  if (currentIndex >= reviewState.cards.length) {
+  if (false) {
     return (
       <div className="fixed inset-0 bg-background z-50 flex items-center justify-center p-4">
killedBy: FlashcardReview submits response after flipping and completes session
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] EqualityOperator
src/components/flashcards/FlashcardReview.tsx:228:7
   }
 
   // All cards completed
-  if (currentIndex >= reviewState.cards.length) {
+  if (currentIndex < reviewState.cards.length) {
     return (
       <div className="fixed inset-0 bg-background z-50 flex items-center justify-center p-4">
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: Review Session. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex items-center justify-center p-4"
    >

[Survived] ConditionalExpression
src/components/flashcards/FlashcardReview.tsx:237:16
             <h3 className="text-lg font-semibold mb-2">Session Complete!</h3>
             <p className="text-muted-foreground mb-4">
               You reviewed {completedCount} cards.
-              {!reviewState.isPremium && (
-                <span className="block mt-1">
-                  {reviewState.remainingReviews} reviews remaining today.
-                </span>
-              )}
+              {false}
             </p>
             <Button onClick={onClose}>Done</Button>

[Survived] LogicalOperator
src/components/flashcards/FlashcardReview.tsx:237:16
             <h3 className="text-lg font-semibold mb-2">Session Complete!</h3>
             <p className="text-muted-foreground mb-4">
               You reviewed {completedCount} cards.
-              {!reviewState.isPremium && (
-                <span className="block mt-1">
-                  {reviewState.remainingReviews} reviews remaining today.
-                </span>
-              )}
+              {!reviewState.isPremium || <span className="block mt-1">
+                  {reviewState.remainingReviews} reviews remaining today.
+                </span>}
             </p>
             <Button onClick={onClose}>Done</Button>
