[Killed] ObjectLiteral
src/components/flashcards/ReviewButtons.tsx:28:3
   variant: "destructive" | "outline" | "default" | "secondary";
   className: string;
 }[] = [
-  {
-    response: "again",
-    label: "Again",
-    variant: "destructive",
-    className: "flex-1",
-  },
+  {},
   {
     response: "hard",
killedBy: ReviewButtons should render all four buttons
statusReason: Unable to find an element with the text: Again. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex gap-2 w-full max-w-xl mx-auto"
    >

[Killed] StringLiteral
src/components/flashcards/ReviewButtons.tsx:41:15
     className: "flex-1 border-orange-500 text-orange-600 hover:bg-orange-50 hover:text-orange-700",
   },
   {
-    response: "good",
+    response: "",
     label: "Good",
     variant: "default",
killedBy: ReviewButtons should display interval previews
statusReason: Unable to find an element with the text: 6d. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex gap-2 w-full max-w-xl mx-auto"
    >

[Killed] StringLiteral
src/components/flashcards/ReviewButtons.tsx:47:15
     className: "flex-1",
   },
   {
-    response: "easy",
+    response: "",
     label: "Easy",
     variant: "secondary",
killedBy: ReviewButtons should display interval previews
statusReason: Unable to find an element with the text: 2w. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex gap-2 w-full max-w-xl mx-auto"
    >

[Killed] StringLiteral
src/components/flashcards/ReviewButtons.tsx:48:12
   },
   {
     response: "easy",
-    label: "Easy",
+    label: "",
     variant: "secondary",
     className: "flex-1 bg-green-100 text-green-700 hover:bg-green-200",
killedBy: ReviewButtons should render all four buttons
statusReason: Unable to find an element with the text: Easy. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex gap-2 w-full max-w-xl mx-auto"
    >

[Killed] BooleanLiteral
src/components/flashcards/ReviewButtons.tsx:57:14
 export function ReviewButtons({
   intervalPreview,
   onResponse,
-  disabled = false,
+  disabled = true,
 }: ReviewButtonsProps) {
   return (
killedBy: ReviewButtons should call onResponse with correct response when button clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'again' ]

Number of calls: 0

[Killed] BlockStatement
src/components/flashcards/ReviewButtons.tsx:58:24
   intervalPreview,
   onResponse,
   disabled = false,
-}: ReviewButtonsProps) {
-  return (
-    <div className="flex gap-2 w-full max-w-xl mx-auto">
-      {buttonConfig.map(({ response, label, variant, className }) => (
-        <Button
-          key={response}
-          variant={variant}
-          className={cn("flex-col h-auto py-3", className)}
-          onClick={() => onResponse(response)}
-          disabled={disabled}
-        >
-          <span className="font-semibold">{label}</span>
-          <span className="text-xs opacity-80">
-            {formatInterval(intervalPreview[response])}
-          </span>
-        </Button>
-      ))}
-    </div>
-  );
-}
+}: ReviewButtonsProps) {}
 
 export type { ResponseQuality, IntervalPreview };
killedBy: ReviewButtons should render all four buttons
statusReason: Unable to find an element with the text: Again. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/components/flashcards/ReviewButtons.tsx:61:25
 }: ReviewButtonsProps) {
   return (
     <div className="flex gap-2 w-full max-w-xl mx-auto">
-      {buttonConfig.map(({ response, label, variant, className }) => (
-        <Button
-          key={response}
-          variant={variant}
-          className={cn("flex-col h-auto py-3", className)}
-          onClick={() => onResponse(response)}
-          disabled={disabled}
-        >
-          <span className="font-semibold">{label}</span>
-          <span className="text-xs opacity-80">
-            {formatInterval(intervalPreview[response])}
-          </span>
-        </Button>
-      ))}
+      {buttonConfig.map(() => undefined)}
     </div>
   );
killedBy: ReviewButtons should render all four buttons
statusReason: Unable to find an element with the text: Again. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex gap-2 w-full max-w-xl mx-auto"
    />

[Killed] ArrowFunction
src/components/flashcards/ReviewButtons.tsx:66:20
           key={response}
           variant={variant}
           className={cn("flex-col h-auto py-3", className)}
-          onClick={() => onResponse(response)}
+          onClick={() => undefined}
           disabled={disabled}
         >
killedBy: ReviewButtons should call onResponse with correct response when button clicked
statusReason: expected "vi.fn()" to be called with arguments: [ 'again' ]

Number of calls: 0
