[Survived] BooleanLiteral
src/components/flashcards/ReviewProgress.tsx:16:15
   completed,
   total,
   remainingReviews,
-  isPremium = false,
+  isPremium = true,
 }: ReviewProgressProps) {
   const progress = total > 0 ? (completed / total) * 100 : 0;

[Killed] BlockStatement
src/components/flashcards/ReviewProgress.tsx:17:25
   total,
   remainingReviews,
   isPremium = false,
-}: ReviewProgressProps) {
-  const progress = total > 0 ? (completed / total) * 100 : 0;
-
-  return (
-    <div className="w-full max-w-xl mx-auto space-y-2">
-      <div className="flex justify-between items-center text-sm">
-        <span className="text-muted-foreground">
-          {completed} / {total} cards
-        </span>
-        {!isPremium && remainingReviews !== undefined && (
-          <span className="text-muted-foreground">
-            {remainingReviews} reviews left today
-          </span>
-        )}
-      </div>
-      <Progress value={progress} className="h-2" />
-    </div>
-  );
-}
+}: ReviewProgressProps) {}
 
killedBy: FlashcardReview loads and shows review session content
statusReason: Unable to find an element with the text: 0 / 1 cards. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >

[Survived] EqualityOperator
src/components/flashcards/ReviewProgress.tsx:18:20
   remainingReviews,
   isPremium = false,
 }: ReviewProgressProps) {
-  const progress = total > 0 ? (completed / total) * 100 : 0;
+  const progress = total >= 0 ? (completed / total) * 100 : 0;
 
   return (

[Survived] EqualityOperator
src/components/flashcards/ReviewProgress.tsx:18:20
   remainingReviews,
   isPremium = false,
 }: ReviewProgressProps) {
-  const progress = total > 0 ? (completed / total) * 100 : 0;
+  const progress = total <= 0 ? (completed / total) * 100 : 0;
 
   return (

[Killed] LogicalOperator
src/components/flashcards/ReviewProgress.tsx:26:10
         <span className="text-muted-foreground">
           {completed} / {total} cards
         </span>
-        {!isPremium && remainingReviews !== undefined && (
-          <span className="text-muted-foreground">
-            {remainingReviews} reviews left today
-          </span>
-        )}
+        {!isPremium && remainingReviews !== undefined || <span className="text-muted-foreground">
+            {remainingReviews} reviews left today
+          </span>}
       </div>
       <Progress value={progress} className="h-2" />
killedBy: ReviewProgress shows remaining reviews for free users
statusReason: Unable to find an element with the text: 9 reviews left today. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-full max-w-xl mx-auto space-y-2"
    >

[Killed] LogicalOperator
src/components/flashcards/ReviewProgress.tsx:26:10
         <span className="text-muted-foreground">
           {completed} / {total} cards
         </span>
-        {!isPremium && remainingReviews !== undefined && (
+        {!isPremium || remainingReviews !== undefined && (
           <span className="text-muted-foreground">
             {remainingReviews} reviews left today
killedBy: ReviewProgress hides remaining reviews for premium users
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="text-muted-foreground"
>
  9
   reviews left today
</span> instead
