[Killed] BooleanLiteral
src/components/quiz/FillBlankQuestion.tsx:20:16
   question,
   answer,
   onAnswer,
-  showResult = false,
+  showResult = true,
   disabled = false,
 }: FillBlankQuestionProps) {
killedBy: FillBlankQuestion renders question, context, and hint
statusReason: Unable to find an element with the text: /Hint:/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-4"
    >

[Killed] BooleanLiteral
src/components/quiz/FillBlankQuestion.tsx:21:14
   answer,
   onAnswer,
   showResult = false,
-  disabled = false,
+  disabled = true,
 }: FillBlankQuestionProps) {
   const isCorrect = question.correct;
killedBy: FillBlankQuestion calls onAnswer on input change when enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'es' ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/quiz/FillBlankQuestion.tsx:29:10
     <div className="space-y-4">
       <div>
         <h3 className="text-lg font-medium">{question.question}</h3>
-        {question.context && (
-          <p className="text-sm text-muted-foreground mt-1">
-            {question.context}
-          </p>
-        )}
+        {false}
         {question.hint && !showResult && (
           <p className="text-sm text-muted-foreground mt-1 italic">
killedBy: FillBlankQuestion renders question, context, and hint
statusReason: Unable to find an element with the text: The house is big.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-4"
    >

[Killed] ConditionalExpression
src/components/quiz/FillBlankQuestion.tsx:29:10
     <div className="space-y-4">
       <div>
         <h3 className="text-lg font-medium">{question.question}</h3>
-        {question.context && (
-          <p className="text-sm text-muted-foreground mt-1">
-            {question.context}
-          </p>
-        )}
+        {true}
         {question.hint && !showResult && (
           <p className="text-sm text-muted-foreground mt-1 italic">
killedBy: FillBlankQuestion renders question, context, and hint
statusReason: Unable to find an element with the text: The house is big.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-4"
    >

[Killed] ConditionalExpression
src/components/quiz/FillBlankQuestion.tsx:34:10
             {question.context}
           </p>
         )}
-        {question.hint && !showResult && (
-          <p className="text-sm text-muted-foreground mt-1 italic">
-            Hint: {question.hint}
-          </p>
-        )}
+        {true}
       </div>
 
killedBy: FillBlankQuestion renders question, context, and hint
statusReason: Unable to find an element with the text: /Hint:/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-4"
    >

[Killed] ConditionalExpression
src/components/quiz/FillBlankQuestion.tsx:34:10
             {question.context}
           </p>
         )}
-        {question.hint && !showResult && (
+        {true && (
           <p className="text-sm text-muted-foreground mt-1 italic">
             Hint: {question.hint}
killedBy: FillBlankQuestion shows correct result state and hides hint while showing results
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  class="text-sm text-muted-foreground mt-1 italic"
>
  Hint: 
  Think of the verb 'to be'.
</p> instead

[Killed] BooleanLiteral
src/components/quiz/FillBlankQuestion.tsx:45:28
         <Input
           type="text"
           value={answer}
-          onChange={(e) => !disabled && onAnswer(e.target.value)}
+          onChange={(e) => disabled && onAnswer(e.target.value)}
           placeholder="Type your answer..."
           disabled={disabled}
killedBy: FillBlankQuestion calls onAnswer on input change when enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'es' ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/quiz/FillBlankQuestion.tsx:45:28
         <Input
           type="text"
           value={answer}
-          onChange={(e) => !disabled && onAnswer(e.target.value)}
+          onChange={(e) => true}
           placeholder="Type your answer..."
           disabled={disabled}
killedBy: FillBlankQuestion calls onAnswer on input change when enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'es' ]

Number of calls: 0

[Killed] ConditionalExpression
src/components/quiz/FillBlankQuestion.tsx:50:13
           disabled={disabled}
           className={cn(
             "text-lg pr-10",
-            showResult && isCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",
+            false,
             showResult && !isCorrect && "border-red-500 bg-red-50 dark:bg-red-950/20"
           )}
killedBy: FillBlankQuestion shows correct result state and hides hint while showing results
statusReason: expect(element).toHaveClass("border-green-500")

Expected the element to have class:
  border-green-500
Received:

[Killed] ConditionalExpression
src/components/quiz/FillBlankQuestion.tsx:50:13
           disabled={disabled}
           className={cn(
             "text-lg pr-10",
-            showResult && isCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",
+            true,
             showResult && !isCorrect && "border-red-500 bg-red-50 dark:bg-red-950/20"
           )}
killedBy: FillBlankQuestion shows correct result state and hides hint while showing results
statusReason: expect(element).toHaveClass("border-green-500")

Expected the element to have class:
  border-green-500
Received:

[Killed] ConditionalExpression
src/components/quiz/FillBlankQuestion.tsx:51:13
           className={cn(
             "text-lg pr-10",
             showResult && isCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",
-            showResult && !isCorrect && "border-red-500 bg-red-50 dark:bg-red-950/20"
+            true
           )}
         />
killedBy: FillBlankQuestion shows incorrect result state and correct answer
statusReason: expect(element).toHaveClass("border-red-500")

Expected the element to have class:
  border-red-500
Received:

[Killed] ConditionalExpression
src/components/quiz/FillBlankQuestion.tsx:51:13
           className={cn(
             "text-lg pr-10",
             showResult && isCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",
-            showResult && !isCorrect && "border-red-500 bg-red-50 dark:bg-red-950/20"
+            true && "border-red-500 bg-red-50 dark:bg-red-950/20"
           )}
         />
killedBy: FillBlankQuestion shows correct result state and hides hint while showing results
statusReason: expect(element).toHaveClass("border-green-500")

Expected the element to have class:
  border-green-500
Received:

[Survived] ConditionalExpression
src/components/quiz/FillBlankQuestion.tsx:54:10
             showResult && !isCorrect && "border-red-500 bg-red-50 dark:bg-red-950/20"
           )}
         />
-        {showResult && (
-          <div className="absolute right-3 top-1/2 -translate-y-1/2">
-            {isCorrect ? (
-              <CheckCircle2 className="h-5 w-5 text-green-500" />
-            ) : (
-              <XCircle className="h-5 w-5 text-red-500" />
-            )}
-          </div>
-        )}
+        {true}
       </div>
 

[Survived] ConditionalExpression
src/components/quiz/FillBlankQuestion.tsx:54:10
             showResult && !isCorrect && "border-red-500 bg-red-50 dark:bg-red-950/20"
           )}
         />
-        {showResult && (
-          <div className="absolute right-3 top-1/2 -translate-y-1/2">
-            {isCorrect ? (
-              <CheckCircle2 className="h-5 w-5 text-green-500" />
-            ) : (
-              <XCircle className="h-5 w-5 text-red-500" />
-            )}
-          </div>
-        )}
+        {false}
       </div>
 

[Killed] ConditionalExpression
src/components/quiz/FillBlankQuestion.tsx:65:8
         )}
       </div>
 
-      {showResult && !isCorrect && (
-        <div className="text-sm">
-          <span className="text-muted-foreground">Correct answer: </span>
-          <span className="font-medium text-green-600 dark:text-green-400">
-            {question.correct_answer}
-          </span>
-        </div>
-      )}
+      {true}
     </div>
   );
killedBy: FillBlankQuestion shows incorrect result state and correct answer
statusReason: Unable to find an element with the text: /Correct answer:/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-4"
    >

[Killed] LogicalOperator
src/components/quiz/FillBlankQuestion.tsx:65:8
         )}
       </div>
 
-      {showResult && !isCorrect && (
-        <div className="text-sm">
-          <span className="text-muted-foreground">Correct answer: </span>
-          <span className="font-medium text-green-600 dark:text-green-400">
-            {question.correct_answer}
-          </span>
-        </div>
-      )}
+      {showResult && !isCorrect || <div className="text-sm">
+          <span className="text-muted-foreground">Correct answer: </span>
+          <span className="font-medium text-green-600 dark:text-green-400">
+            {question.correct_answer}
+          </span>
+        </div>}
     </div>
   );
killedBy: FillBlankQuestion shows incorrect result state and correct answer
statusReason: Unable to find an element with the text: /Correct answer:/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-4"
    >
