[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:22:19
   showResult = false,
   disabled = false,
 }: MCQQuestionProps) {
-  const options = question.options || [];
+  const options = false;
 
   return (
killedBy: MCQQuestion renders question, options, and hint
statusReason: options.map is not a function

[Killed] LogicalOperator
src/components/quiz/MCQQuestion.tsx:22:19
   showResult = false,
   disabled = false,
 }: MCQQuestionProps) {
-  const options = question.options || [];
+  const options = question.options && [];
 
   return (
killedBy: MCQQuestion renders question, options, and hint
statusReason: Unable to find an element with the text: Option A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-4"
    >

[Killed] BooleanLiteral
src/components/quiz/MCQQuestion.tsx:28:27
     <div className="space-y-4">
       <div>
         <h3 className="text-lg font-medium">{question.question}</h3>
-        {question.hint && !showResult && (
+        {question.hint && showResult && (
           <p className="text-sm text-muted-foreground mt-1">
             Hint: {question.hint}
killedBy: MCQQuestion renders question, options, and hint
statusReason: Unable to find an element with the text: /Hint: Focus on the opening paragraph/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-4"
    >

[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:28:10
     <div className="space-y-4">
       <div>
         <h3 className="text-lg font-medium">{question.question}</h3>
-        {question.hint && !showResult && (
-          <p className="text-sm text-muted-foreground mt-1">
-            Hint: {question.hint}
-          </p>
-        )}
+        {true}
       </div>
 
killedBy: MCQQuestion renders question, options, and hint
statusReason: Unable to find an element with the text: /Hint: Focus on the opening paragraph/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-4"
    >

[Killed] EqualityOperator
src/components/quiz/MCQQuestion.tsx:37:30
 
       <div className="space-y-2">
         {options.map((option, index) => {
-          const isSelected = selectedAnswer === option;
+          const isSelected = selectedAnswer !== option;
           const isCorrect = option === question.correct_answer;
           const showCorrect = showResult && isCorrect;
killedBy: MCQQuestion shows result styling and correct-answer helper when incorrect
statusReason: expect(element).toHaveClass("border-red-500")

Expected the element to have class:
  border-red-500
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3

[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:37:30
 
       <div className="space-y-2">
         {options.map((option, index) => {
-          const isSelected = selectedAnswer === option;
+          const isSelected = false;
           const isCorrect = option === question.correct_answer;
           const showCorrect = showResult && isCorrect;
killedBy: MCQQuestion shows result styling and correct-answer helper when incorrect
statusReason: expect(element).toHaveClass("border-red-500")

Expected the element to have class:
  border-red-500
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3

[Killed] EqualityOperator
src/components/quiz/MCQQuestion.tsx:38:29
       <div className="space-y-2">
         {options.map((option, index) => {
           const isSelected = selectedAnswer === option;
-          const isCorrect = option === question.correct_answer;
+          const isCorrect = option !== question.correct_answer;
           const showCorrect = showResult && isCorrect;
           const showIncorrect = showResult && isSelected && !isCorrect;
killedBy: MCQQuestion shows result styling and correct-answer helper when incorrect
statusReason: expect(element).toHaveClass("border-green-500")

Expected the element to have class:
  border-green-500
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3

[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:38:29
       <div className="space-y-2">
         {options.map((option, index) => {
           const isSelected = selectedAnswer === option;
-          const isCorrect = option === question.correct_answer;
+          const isCorrect = true;
           const showCorrect = showResult && isCorrect;
           const showIncorrect = showResult && isSelected && !isCorrect;
killedBy: MCQQuestion shows result styling and correct-answer helper when incorrect
statusReason: expect(element).toHaveClass("border-red-500")

Expected the element to have class:
  border-red-500
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3 border-green-500 bg-green-50 dark:bg-green-950/20

[Killed] LogicalOperator
src/components/quiz/MCQQuestion.tsx:39:31
         {options.map((option, index) => {
           const isSelected = selectedAnswer === option;
           const isCorrect = option === question.correct_answer;
-          const showCorrect = showResult && isCorrect;
+          const showCorrect = showResult || isCorrect;
           const showIncorrect = showResult && isSelected && !isCorrect;
 
killedBy: MCQQuestion highlights the correct unselected option green and the selected wrong option red in result mode
statusReason: expect(element).not.toHaveClass("border-green-500")

Expected the element not to have class:
  border-green-500
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3 border-green-500 bg-green-50 dark:bg-green-950/20

[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:39:31
         {options.map((option, index) => {
           const isSelected = selectedAnswer === option;
           const isCorrect = option === question.correct_answer;
-          const showCorrect = showResult && isCorrect;
+          const showCorrect = true;
           const showIncorrect = showResult && isSelected && !isCorrect;
 
killedBy: MCQQuestion applies primary border and background to the selected option before result mode
statusReason: expect(element).toHaveClass("border-primary")

Expected the element to have class:
  border-primary
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3 hover:bg-accent hover:border-accent-foreground/20 border-green-500 bg-green-50 dark:bg-green-950/20

[Killed] LogicalOperator
src/components/quiz/MCQQuestion.tsx:40:33
           const isSelected = selectedAnswer === option;
           const isCorrect = option === question.correct_answer;
           const showCorrect = showResult && isCorrect;
-          const showIncorrect = showResult && isSelected && !isCorrect;
+          const showIncorrect = showResult || isSelected && !isCorrect;
 
           return (
killedBy: MCQQuestion applies primary border and background to the selected option before result mode
statusReason: expect(element).toHaveClass("border-primary")

Expected the element to have class:
  border-primary
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3 hover:bg-accent hover:border-accent-foreground/20 border-red-500 bg-red-50 dark:bg-red-950/20

[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:40:33
           const isSelected = selectedAnswer === option;
           const isCorrect = option === question.correct_answer;
           const showCorrect = showResult && isCorrect;
-          const showIncorrect = showResult && isSelected && !isCorrect;
+          const showIncorrect = true;
 
           return (
killedBy: MCQQuestion shows result styling and correct-answer helper when incorrect
statusReason: expect(element).toHaveClass("border-green-500")

Expected the element to have class:
  border-green-500
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3 border-red-500 bg-red-50 dark:bg-red-950/20

[Killed] ArrowFunction
src/components/quiz/MCQQuestion.tsx:46:24
             <button
               key={index}
               type="button"
-              onClick={() => !disabled && onAnswer(option)}
+              onClick={() => undefined}
               disabled={disabled}
               className={cn(
killedBy: MCQQuestion calls onAnswer when option is clicked and enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'Option C' ]

Number of calls: 0

[Killed] LogicalOperator
src/components/quiz/MCQQuestion.tsx:46:30
             <button
               key={index}
               type="button"
-              onClick={() => !disabled && onAnswer(option)}
+              onClick={() => !disabled || onAnswer(option)}
               disabled={disabled}
               className={cn(
killedBy: MCQQuestion calls onAnswer when option is clicked and enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'Option C' ]

Number of calls: 0

[Survived] LogicalOperator
src/components/quiz/MCQQuestion.tsx:51:17
               className={cn(
                 "w-full text-left p-4 rounded-lg border transition-colors",
                 "flex items-center justify-between gap-3",
-                !showResult && !disabled && "hover:bg-accent hover:border-accent-foreground/20",
+                !showResult && !disabled || "hover:bg-accent hover:border-accent-foreground/20",
                 isSelected && !showResult && "border-primary bg-primary/5",
                 showCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",

[Survived] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:51:17
               className={cn(
                 "w-full text-left p-4 rounded-lg border transition-colors",
                 "flex items-center justify-between gap-3",
-                !showResult && !disabled && "hover:bg-accent hover:border-accent-foreground/20",
+                false,
                 isSelected && !showResult && "border-primary bg-primary/5",
                 showCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",

[Killed] LogicalOperator
src/components/quiz/MCQQuestion.tsx:52:17
                 "w-full text-left p-4 rounded-lg border transition-colors",
                 "flex items-center justify-between gap-3",
                 !showResult && !disabled && "hover:bg-accent hover:border-accent-foreground/20",
-                isSelected && !showResult && "border-primary bg-primary/5",
+                isSelected && !showResult || "border-primary bg-primary/5",
                 showCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",
                 showIncorrect && "border-red-500 bg-red-50 dark:bg-red-950/20",
killedBy: MCQQuestion applies primary border and background to the selected option before result mode
statusReason: expect(element).toHaveClass("border-primary")

Expected the element to have class:
  border-primary
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3 hover:bg-accent hover:border-accent-foreground/20

[Killed] LogicalOperator
src/components/quiz/MCQQuestion.tsx:52:17
                 "w-full text-left p-4 rounded-lg border transition-colors",
                 "flex items-center justify-between gap-3",
                 !showResult && !disabled && "hover:bg-accent hover:border-accent-foreground/20",
-                isSelected && !showResult && "border-primary bg-primary/5",
+                isSelected || !showResult && "border-primary bg-primary/5",
                 showCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",
                 showIncorrect && "border-red-500 bg-red-50 dark:bg-red-950/20",
killedBy: MCQQuestion applies primary border and background to the selected option before result mode
statusReason: expect(element).not.toHaveClass("border-primary")

Expected the element not to have class:
  border-primary
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3 hover:bg-accent hover:border-accent-foreground/20 border-primary bg-primary/5

[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:53:17
                 "flex items-center justify-between gap-3",
                 !showResult && !disabled && "hover:bg-accent hover:border-accent-foreground/20",
                 isSelected && !showResult && "border-primary bg-primary/5",
-                showCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",
+                false,
                 showIncorrect && "border-red-500 bg-red-50 dark:bg-red-950/20",
                 disabled && "cursor-not-allowed opacity-60"
killedBy: MCQQuestion shows result styling and correct-answer helper when incorrect
statusReason: expect(element).toHaveClass("border-green-500")

Expected the element to have class:
  border-green-500
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3

[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:53:17
                 "flex items-center justify-between gap-3",
                 !showResult && !disabled && "hover:bg-accent hover:border-accent-foreground/20",
                 isSelected && !showResult && "border-primary bg-primary/5",
-                showCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",
+                true,
                 showIncorrect && "border-red-500 bg-red-50 dark:bg-red-950/20",
                 disabled && "cursor-not-allowed opacity-60"
killedBy: MCQQuestion shows result styling and correct-answer helper when incorrect
statusReason: expect(element).toHaveClass("border-green-500")

Expected the element to have class:
  border-green-500
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3

[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:54:17
                 !showResult && !disabled && "hover:bg-accent hover:border-accent-foreground/20",
                 isSelected && !showResult && "border-primary bg-primary/5",
                 showCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",
-                showIncorrect && "border-red-500 bg-red-50 dark:bg-red-950/20",
+                false,
                 disabled && "cursor-not-allowed opacity-60"
               )}
killedBy: MCQQuestion shows result styling and correct-answer helper when incorrect
statusReason: expect(element).toHaveClass("border-red-500")

Expected the element to have class:
  border-red-500
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3

[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:54:17
                 !showResult && !disabled && "hover:bg-accent hover:border-accent-foreground/20",
                 isSelected && !showResult && "border-primary bg-primary/5",
                 showCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",
-                showIncorrect && "border-red-500 bg-red-50 dark:bg-red-950/20",
+                true,
                 disabled && "cursor-not-allowed opacity-60"
               )}
killedBy: MCQQuestion shows result styling and correct-answer helper when incorrect
statusReason: expect(element).toHaveClass("border-red-500")

Expected the element to have class:
  border-red-500
Received:
  w-full text-left p-4 rounded-lg border transition-colors flex items-center justify-between gap-3

[Survived] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:55:17
                 isSelected && !showResult && "border-primary bg-primary/5",
                 showCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",
                 showIncorrect && "border-red-500 bg-red-50 dark:bg-red-950/20",
-                disabled && "cursor-not-allowed opacity-60"
+                true
               )}
             >

[Survived] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:55:17
                 isSelected && !showResult && "border-primary bg-primary/5",
                 showCorrect && "border-green-500 bg-green-50 dark:bg-green-950/20",
                 showIncorrect && "border-red-500 bg-red-50 dark:bg-red-950/20",
-                disabled && "cursor-not-allowed opacity-60"
+                false
               )}
             >

[Survived] StringLiteral
src/components/quiz/MCQQuestion.tsx:61:21
               <span className="flex items-center gap-3">
                 <span
                   className={cn(
-                    "flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium",
+                    "",
                     isSelected && !showResult && "border-primary bg-primary text-primary-foreground",
                     showCorrect && "border-green-500 bg-green-500 text-white",

[Killed] BooleanLiteral
src/components/quiz/MCQQuestion.tsx:62:35
                 <span
                   className={cn(
                     "flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium",
-                    isSelected && !showResult && "border-primary bg-primary text-primary-foreground",
+                    isSelected && showResult && "border-primary bg-primary text-primary-foreground",
                     showCorrect && "border-green-500 bg-green-500 text-white",
                     showIncorrect && "border-red-500 bg-red-500 text-white",
killedBy: MCQQuestion styles the letter badge with primary colors for the selected option before result mode
statusReason: expect(element).toHaveClass("border-primary")

Expected the element to have class:
  border-primary
Received:
  flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium

[Killed] LogicalOperator
src/components/quiz/MCQQuestion.tsx:62:21
                 <span
                   className={cn(
                     "flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium",
-                    isSelected && !showResult && "border-primary bg-primary text-primary-foreground",
+                    isSelected && !showResult || "border-primary bg-primary text-primary-foreground",
                     showCorrect && "border-green-500 bg-green-500 text-white",
                     showIncorrect && "border-red-500 bg-red-500 text-white",
killedBy: MCQQuestion styles the letter badge with primary colors for the selected option before result mode
statusReason: expect(element).toHaveClass("border-primary")

Expected the element to have class:
  border-primary
Received:
  flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium

[Killed] LogicalOperator
src/components/quiz/MCQQuestion.tsx:63:21
                   className={cn(
                     "flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium",
                     isSelected && !showResult && "border-primary bg-primary text-primary-foreground",
-                    showCorrect && "border-green-500 bg-green-500 text-white",
+                    showCorrect || "border-green-500 bg-green-500 text-white",
                     showIncorrect && "border-red-500 bg-red-500 text-white",
                     !isSelected && !showResult && "border-muted-foreground/30"
killedBy: MCQQuestion styles the letter badge with primary colors for the selected option before result mode
statusReason: expect(element).toHaveClass("border-primary")

Expected the element to have class:
  border-primary
Received:
  flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium border-green-500 bg-green-500 text-white

[Survived] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:63:21
                   className={cn(
                     "flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium",
                     isSelected && !showResult && "border-primary bg-primary text-primary-foreground",
-                    showCorrect && "border-green-500 bg-green-500 text-white",
+                    true,
                     showIncorrect && "border-red-500 bg-red-500 text-white",
                     !isSelected && !showResult && "border-muted-foreground/30"

[Killed] LogicalOperator
src/components/quiz/MCQQuestion.tsx:64:21
                     "flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium",
                     isSelected && !showResult && "border-primary bg-primary text-primary-foreground",
                     showCorrect && "border-green-500 bg-green-500 text-white",
-                    showIncorrect && "border-red-500 bg-red-500 text-white",
+                    showIncorrect || "border-red-500 bg-red-500 text-white",
                     !isSelected && !showResult && "border-muted-foreground/30"
                   )}
killedBy: MCQQuestion styles the letter badge with primary colors for the selected option before result mode
statusReason: expect(element).toHaveClass("border-primary")

Expected the element to have class:
  border-primary
Received:
  flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium border-red-500 bg-red-500 text-white

[Survived] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:64:21
                     "flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium",
                     isSelected && !showResult && "border-primary bg-primary text-primary-foreground",
                     showCorrect && "border-green-500 bg-green-500 text-white",
-                    showIncorrect && "border-red-500 bg-red-500 text-white",
+                    false,
                     !isSelected && !showResult && "border-muted-foreground/30"
                   )}

[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:65:21
                     isSelected && !showResult && "border-primary bg-primary text-primary-foreground",
                     showCorrect && "border-green-500 bg-green-500 text-white",
                     showIncorrect && "border-red-500 bg-red-500 text-white",
-                    !isSelected && !showResult && "border-muted-foreground/30"
+                    true
                   )}
                 >
killedBy: MCQQuestion styles the letter badge with primary colors for the selected option before result mode
statusReason: expect(element).toHaveClass("border-muted-foreground/30")

Expected the element to have class:
  border-muted-foreground/30
Received:
  flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium

[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:65:21
                     isSelected && !showResult && "border-primary bg-primary text-primary-foreground",
                     showCorrect && "border-green-500 bg-green-500 text-white",
                     showIncorrect && "border-red-500 bg-red-500 text-white",
-                    !isSelected && !showResult && "border-muted-foreground/30"
+                    true && "border-muted-foreground/30"
                   )}
                 >
killedBy: MCQQuestion styles the letter badge with primary colors for the selected option before result mode
statusReason: expect(element).toHaveClass("border-primary")

Expected the element to have class:
  border-primary
Received:
  flex h-6 w-6 items-center justify-center rounded-full border text-sm font-medium bg-primary text-primary-foreground border-muted-foreground/30

[Survived] ArithmeticOperator
src/components/quiz/MCQQuestion.tsx:68:40
                     !isSelected && !showResult && "border-muted-foreground/30"
                   )}
                 >
-                  {String.fromCharCode(65 + index)}
+                  {String.fromCharCode(65 - index)}
                 </span>
                 <span>{option}</span>

[Survived] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:73:16
                 <span>{option}</span>
               </span>
 
-              {showResult && (
-                <>
-                  {showCorrect && (
-                    <CheckCircle2 className="h-5 w-5 text-green-500 shrink-0" />
-                  )}
-                  {showIncorrect && (
-                    <XCircle className="h-5 w-5 text-red-500 shrink-0" />
-                  )}
-                </>
-              )}
+              {true}
             </button>
           );

[Survived] LogicalOperator
src/components/quiz/MCQQuestion.tsx:73:16
                 <span>{option}</span>
               </span>
 
-              {showResult && (
-                <>
-                  {showCorrect && (
-                    <CheckCircle2 className="h-5 w-5 text-green-500 shrink-0" />
-                  )}
-                  {showIncorrect && (
-                    <XCircle className="h-5 w-5 text-red-500 shrink-0" />
-                  )}
-                </>
-              )}
+              {showResult || <>
+                  {showCorrect && <CheckCircle2 className="h-5 w-5 text-green-500 shrink-0" />}
+                  {showIncorrect && <XCircle className="h-5 w-5 text-red-500 shrink-0" />}
+                </>}
             </button>
           );

[Survived] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:75:20
 
               {showResult && (
                 <>
-                  {showCorrect && (
-                    <CheckCircle2 className="h-5 w-5 text-green-500 shrink-0" />
-                  )}
+                  {false}
                   {showIncorrect && (
                     <XCircle className="h-5 w-5 text-red-500 shrink-0" />

[Survived] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:75:20
 
               {showResult && (
                 <>
-                  {showCorrect && (
-                    <CheckCircle2 className="h-5 w-5 text-green-500 shrink-0" />
-                  )}
+                  {true}
                   {showIncorrect && (
                     <XCircle className="h-5 w-5 text-red-500 shrink-0" />

[Survived] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:78:20
                   {showCorrect && (
                     <CheckCircle2 className="h-5 w-5 text-green-500 shrink-0" />
                   )}
-                  {showIncorrect && (
-                    <XCircle className="h-5 w-5 text-red-500 shrink-0" />
-                  )}
+                  {false}
                 </>
               )}

[Survived] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:78:20
                   {showCorrect && (
                     <CheckCircle2 className="h-5 w-5 text-green-500 shrink-0" />
                   )}
-                  {showIncorrect && (
-                    <XCircle className="h-5 w-5 text-red-500 shrink-0" />
-                  )}
+                  {true}
                 </>
               )}

[Killed] LogicalOperator
src/components/quiz/MCQQuestion.tsx:88:8
         })}
       </div>
 
-      {showResult && question.correct !== undefined && !question.correct && (
+      {showResult && question.correct !== undefined || !question.correct && (
         <p className="text-sm text-muted-foreground">
           Correct answer: <span className="font-medium">{question.correct_answer}</span>
killedBy: MCQQuestion shows green styling for the correct-and-selected option in result mode and omits correct-answer helper
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  class="text-sm text-muted-foreground"
>
  Correct answer: 
  <span
    class="font-medium"

[Killed] ConditionalExpression
src/components/quiz/MCQQuestion.tsx:88:8
         })}
       </div>
 
-      {showResult && question.correct !== undefined && !question.correct && (
-        <p className="text-sm text-muted-foreground">
-          Correct answer: <span className="font-medium">{question.correct_answer}</span>
-        </p>
-      )}
+      {true}
     </div>
   );
killedBy: MCQQuestion shows result styling and correct-answer helper when incorrect
statusReason: Unable to find an element with the text: /Correct answer:/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-4"
    >
