[Killed] BooleanLiteral
src/components/quiz/QuizContainer.tsx:65:46
   const [quiz, setQuiz] = useState<QuizState | null>(null);
   const [currentIndex, setCurrentIndex] = useState(0);
   const [answers, setAnswers] = useState<Record<string, string>>({});
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
   const [isSubmitting, setIsSubmitting] = useState(false);
   const [error, setError] = useState<string | null>(null);
killedBy: QuizContainer loads quiz and renders first question state
statusReason: Unable to find an element with the text: /Generating your quiz/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto ma

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:72:19
   const [startTime] = useState(Date.now());
 
   // Load quiz on mount
-  useEffect(() => {
-    async function loadQuiz() {
-      try {
-        const response = await fetch("/api/quiz/generate", {
-          method: "POST",
-          headers: { "Content-Type": "application/json" },
-          body: JSON.stringify({ contentId }),
-        });
-
-        if (!response.ok) {
-          throw new Error("Failed to generate quiz");
-        }
-
-        const data = await response.json();
-        setQuiz(data);
-      } catch (err) {
-        setError(err instanceof Error ? err.message : "Failed to load quiz");
-      } finally {
-        setIsLoading(false);
-      }
-    }
-
-    loadQuiz();
-  }, [contentId]);
+  useEffect(() => {}, [contentId]);
 
   const handleAnswer = (questionId: string, answer: string) => {
killedBy: QuizContainer loads quiz and renders first question state
statusReason: Unable to find an element with the text: Reading Quiz. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:73:31
 
   // Load quiz on mount
   useEffect(() => {
-    async function loadQuiz() {
-      try {
-        const response = await fetch("/api/quiz/generate", {
-          method: "POST",
-          headers: { "Content-Type": "application/json" },
-          body: JSON.stringify({ contentId }),
-        });
-
-        if (!response.ok) {
-          throw new Error("Failed to generate quiz");
-        }
-
-        const data = await response.json();
-        setQuiz(data);
-      } catch (err) {
-        setError(err instanceof Error ? err.message : "Failed to load quiz");
-      } finally {
-        setIsLoading(false);
-      }
-    }
+    async function loadQuiz() {}
 
     loadQuiz();
killedBy: QuizContainer loads quiz and renders first question state
statusReason: Unable to find an element with the text: Reading Quiz. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:74:11
   // Load quiz on mount
   useEffect(() => {
     async function loadQuiz() {
-      try {
-        const response = await fetch("/api/quiz/generate", {
-          method: "POST",
-          headers: { "Content-Type": "application/json" },
-          body: JSON.stringify({ contentId }),
-        });
-
-        if (!response.ok) {
-          throw new Error("Failed to generate quiz");
-        }
-
-        const data = await response.json();
-        setQuiz(data);
-      } catch (err) {
+      try {} catch (err) {
         setError(err instanceof Error ? err.message : "Failed to load quiz");
       } finally {
killedBy: QuizContainer loads quiz and renders first question state
statusReason: Unable to find an element with the text: /Generating your quiz/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto ma

[Survived] ObjectLiteral
src/components/quiz/QuizContainer.tsx:78:32
         const response = await fetch("/api/quiz/generate", {
           method: "POST",
           headers: { "Content-Type": "application/json" },
-          body: JSON.stringify({ contentId }),
+          body: JSON.stringify({}),
         });
 

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:81:27
           body: JSON.stringify({ contentId }),
         });
 
-        if (!response.ok) {
-          throw new Error("Failed to generate quiz");
-        }
+        if (!response.ok) {}
 
         const data = await response.json();
killedBy: QuizContainer shows load error state when quiz generation fails
statusReason: Unable to find an element with the text: Failed to generate quiz. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
src/components/quiz/QuizContainer.tsx:82:27
         });
 
         if (!response.ok) {
-          throw new Error("Failed to generate quiz");
+          throw new Error("");
         }
 
killedBy: QuizContainer shows load error state when quiz generation fails
statusReason: Unable to find an element with the text: Failed to generate quiz. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto ma

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:87:21
 
         const data = await response.json();
         setQuiz(data);
-      } catch (err) {
-        setError(err instanceof Error ? err.message : "Failed to load quiz");
-      } finally {
+      } catch (err) {} finally {
         setIsLoading(false);
       }
killedBy: QuizContainer shows load error state when quiz generation fails
statusReason: Unable to find an element with the text: Failed to generate quiz. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto ma

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:89:17
         setQuiz(data);
       } catch (err) {
         setError(err instanceof Error ? err.message : "Failed to load quiz");
-      } finally {
-        setIsLoading(false);
-      }
+      } finally {}
     }
 
killedBy: QuizContainer loads quiz and renders first question state
statusReason: Unable to find an element with the text: Reading Quiz. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Survived] ArrayDeclaration
src/components/quiz/QuizContainer.tsx:95:6
     }
 
     loadQuiz();
-  }, [contentId]);
+  }, []);
 
   const handleAnswer = (questionId: string, answer: string) => {

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:97:64
     loadQuiz();
   }, [contentId]);
 
-  const handleAnswer = (questionId: string, answer: string) => {
-    setAnswers((prev) => ({ ...prev, [questionId]: answer }));
-  };
+  const handleAnswer = (questionId: string, answer: string) => {};
 
   const handleNext = () => {
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an element with the text: 1/2 answered. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] ArrowFunction
src/components/quiz/QuizContainer.tsx:98:16
   }, [contentId]);
 
   const handleAnswer = (questionId: string, answer: string) => {
-    setAnswers((prev) => ({ ...prev, [questionId]: answer }));
+    setAnswers(() => undefined);
   };
 
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:101:28
     setAnswers((prev) => ({ ...prev, [questionId]: answer }));
   };
 
-  const handleNext = () => {
-    if (quiz && currentIndex < quiz.questions.length - 1) {
-      setCurrentIndex((prev) => prev + 1);
-    }
-  };
+  const handleNext = () => {};
 
   const handlePrevious = () => {
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an element with the text: Vocabulary. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] ConditionalExpression
src/components/quiz/QuizContainer.tsx:102:9
   };
 
   const handleNext = () => {
-    if (quiz && currentIndex < quiz.questions.length - 1) {
+    if (false) {
       setCurrentIndex((prev) => prev + 1);
     }
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an element with the text: Vocabulary. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] EqualityOperator
src/components/quiz/QuizContainer.tsx:102:17
   };
 
   const handleNext = () => {
-    if (quiz && currentIndex < quiz.questions.length - 1) {
+    if (quiz && currentIndex >= quiz.questions.length - 1) {
       setCurrentIndex((prev) => prev + 1);
     }
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an element with the text: Vocabulary. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] ArithmeticOperator
src/components/quiz/QuizContainer.tsx:103:33
 
   const handleNext = () => {
     if (quiz && currentIndex < quiz.questions.length - 1) {
-      setCurrentIndex((prev) => prev + 1);
+      setCurrentIndex((prev) => prev - 1);
     }
   };
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ArrowFunction
src/components/quiz/QuizContainer.tsx:103:23
 
   const handleNext = () => {
     if (quiz && currentIndex < quiz.questions.length - 1) {
-      setCurrentIndex((prev) => prev + 1);
+      setCurrentIndex(() => undefined);
     }
   };
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Cannot read properties of undefined (reading 'type')

[Survived] BlockStatement
src/components/quiz/QuizContainer.tsx:107:32
     }
   };
 
-  const handlePrevious = () => {
-    if (currentIndex > 0) {
-      setCurrentIndex((prev) => prev - 1);
-    }
-  };
+  const handlePrevious = () => {};
 
   const handleSubmit = async () => {

[Survived] ConditionalExpression
src/components/quiz/QuizContainer.tsx:108:9
   };
 
   const handlePrevious = () => {
-    if (currentIndex > 0) {
+    if (true) {
       setCurrentIndex((prev) => prev - 1);
     }

[Survived] EqualityOperator
src/components/quiz/QuizContainer.tsx:108:9
   };
 
   const handlePrevious = () => {
-    if (currentIndex > 0) {
+    if (currentIndex <= 0) {
       setCurrentIndex((prev) => prev - 1);
     }

[Survived] ArithmeticOperator
src/components/quiz/QuizContainer.tsx:109:33
 
   const handlePrevious = () => {
     if (currentIndex > 0) {
-      setCurrentIndex((prev) => prev - 1);
+      setCurrentIndex((prev) => prev + 1);
     }
   };

[Survived] ArrowFunction
src/components/quiz/QuizContainer.tsx:109:23
 
   const handlePrevious = () => {
     if (currentIndex > 0) {
-      setCurrentIndex((prev) => prev - 1);
+      setCurrentIndex(() => undefined);
     }
   };

[Killed] BooleanLiteral
src/components/quiz/QuizContainer.tsx:114:9
   };
 
   const handleSubmit = async () => {
-    if (!quiz) return;
+    if (quiz) return;
 
     setIsSubmitting(true);
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an element with the text: Results 80%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] ConditionalExpression
src/components/quiz/QuizContainer.tsx:114:9
   };
 
   const handleSubmit = async () => {
-    if (!quiz) return;
+    if (true) return;
 
     setIsSubmitting(true);
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an element with the text: Results 80%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Survived] ArithmeticOperator
src/components/quiz/QuizContainer.tsx:117:42
     if (!quiz) return;
 
     setIsSubmitting(true);
-    const timeTakenSeconds = Math.floor((Date.now() - startTime) / 1000);
+    const timeTakenSeconds = Math.floor((Date.now() + startTime) / 1000);
 
     try {

[Survived] ArithmeticOperator
src/components/quiz/QuizContainer.tsx:117:41
     if (!quiz) return;
 
     setIsSubmitting(true);
-    const timeTakenSeconds = Math.floor((Date.now() - startTime) / 1000);
+    const timeTakenSeconds = Math.floor((Date.now() - startTime) * 1000);
 
     try {

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:119:9
     setIsSubmitting(true);
     const timeTakenSeconds = Math.floor((Date.now() - startTime) / 1000);
 
-    try {
-      const response = await fetch("/api/quiz/submit", {
-        method: "POST",
-        headers: { "Content-Type": "application/json" },
-        body: JSON.stringify({
-          contentId,
-          questions: quiz.questions,
-          answers,
-          timeTakenSeconds,
-        }),
-      });
-
-      if (!response.ok) {
-        throw new Error("Failed to submit quiz");
-      }
-
-      const data = await response.json();
-      setResult(data);
-    } catch (err) {
+    try {} catch (err) {
       setError(err instanceof Error ? err.message : "Failed to submit quiz");
     } finally {
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an element with the text: Results 80%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:131:25
         }),
       });
 
-      if (!response.ok) {
-        throw new Error("Failed to submit quiz");
-      }
+      if (!response.ok) {}
 
       const data = await response.json();
killedBy: QuizContainer shows submit error state when submission fails
statusReason: Unable to find an element with the text: Failed to submit quiz. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:137:19
 
       const data = await response.json();
       setResult(data);
-    } catch (err) {
-      setError(err instanceof Error ? err.message : "Failed to submit quiz");
-    } finally {
+    } catch (err) {} finally {
       setIsSubmitting(false);
     }
killedBy: QuizContainer shows submit error state when submission fails
statusReason: Unable to find an element with the text: Failed to submit quiz. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-

[Survived] BlockStatement
src/components/quiz/QuizContainer.tsx:139:15
       setResult(data);
     } catch (err) {
       setError(err instanceof Error ? err.message : "Failed to submit quiz");
-    } finally {
-      setIsSubmitting(false);
-    }
+    } finally {}
   };
 

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:145:18
   };
 
   // Loading state
-  if (isLoading) {
-    return (
-      <Card className="mx-auto max-w-2xl">
-        <CardContent className="flex flex-col items-center justify-center py-12">
-          <Loader2 className="h-8 w-8 animate-spin text-primary" />
-          <p className="mt-4 text-muted-foreground">Generating your quiz...</p>
-          <p className="text-sm text-muted-foreground">
-            This may take a few seconds
-          </p>
-        </CardContent>
-      </Card>
-    );
-  }
+  if (isLoading) {}
 
   // Error state
killedBy: QuizContainer loads quiz and renders first question state
statusReason: Unable to find an element with the text: /Generating your quiz/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto ma

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:160:14
   }
 
   // Error state
-  if (error) {
-    return (
-      <Card className="mx-auto max-w-2xl">
-        <CardContent className="py-12 text-center">
-          <p className="text-destructive mb-4">{error}</p>
-          <Button onClick={() => window.location.reload()}>Try Again</Button>
-        </CardContent>
-      </Card>
-    );
-  }
+  if (error) {}
 
   // Results state
killedBy: QuizContainer shows load error state when quiz generation fails
statusReason: Unable to find an element with the text: Failed to generate quiz. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto ma

[Survived] ArrowFunction
src/components/quiz/QuizContainer.tsx:165:28
       <Card className="mx-auto max-w-2xl">
         <CardContent className="py-12 text-center">
           <p className="text-destructive mb-4">{error}</p>
-          <Button onClick={() => window.location.reload()}>Try Again</Button>
+          <Button onClick={() => undefined}>Try Again</Button>
         </CardContent>
       </Card>

[Killed] ConditionalExpression
src/components/quiz/QuizContainer.tsx:172:7
   }
 
   // Results state
-  if (result) {
+  if (false) {
     return (
       <div className="mx-auto max-w-2xl">
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an element with the text: Results 80%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] BlockStatement
src/components/quiz/QuizContainer.tsx:172:15
   }
 
   // Results state
-  if (result) {
-    return (
-      <div className="mx-auto max-w-2xl">
-        <QuizResults
-          results={result.results}
-          newLevels={result.newLevels}
-          contentTitle={contentTitle}
-          onContinue={onComplete}
-        />
-      </div>
-    );
-  }
+  if (result) {}
 
   // No quiz loaded
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an element with the text: Results 80%. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] BooleanLiteral
src/components/quiz/QuizContainer.tsx:186:7
   }
 
   // No quiz loaded
-  if (!quiz || quiz.questions.length === 0) {
+  if (quiz || quiz.questions.length === 0) {
     return (
       <Card className="mx-auto max-w-2xl">
killedBy: QuizContainer loads quiz and renders first question state
statusReason: Unable to find an element with the text: Reading Quiz. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] ConditionalExpression
src/components/quiz/QuizContainer.tsx:186:16
   }
 
   // No quiz loaded
-  if (!quiz || quiz.questions.length === 0) {
+  if (!quiz || false) {
     return (
       <Card className="mx-auto max-w-2xl">
killedBy: QuizContainer shows no-questions state
statusReason: Unable to find an element with the text: No questions available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/components/quiz/QuizContainer.tsx:198:23
 
   const currentQuestion = quiz.questions[currentIndex];
   const answeredCount = Object.keys(answers).length;
-  const allAnswered = answeredCount === quiz.questions.length;
+  const allAnswered = false;
   const progressPercent = (answeredCount / quiz.questions.length) * 100;
 
killedBy: QuizContainer navigates, submits, and displays results
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  data-size="default"
  data-slot="button"
  data-variant="default"

[Killed] EqualityOperator
src/components/quiz/QuizContainer.tsx:198:23
 
   const currentQuestion = quiz.questions[currentIndex];
   const answeredCount = Object.keys(answers).length;
-  const allAnswered = answeredCount === quiz.questions.length;
+  const allAnswered = answeredCount !== quiz.questions.length;
   const progressPercent = (answeredCount / quiz.questions.length) * 100;
 
killedBy: QuizContainer navigates, submits, and displays results
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  data-size="default"
  data-slot="button"
  data-variant="default"

[Survived] ArithmeticOperator
src/components/quiz/QuizContainer.tsx:199:28
   const currentQuestion = quiz.questions[currentIndex];
   const answeredCount = Object.keys(answers).length;
   const allAnswered = answeredCount === quiz.questions.length;
-  const progressPercent = (answeredCount / quiz.questions.length) * 100;
+  const progressPercent = (answeredCount * quiz.questions.length) * 100;
 
   return (

[Survived] ArithmeticOperator
src/components/quiz/QuizContainer.tsx:199:27
   const currentQuestion = quiz.questions[currentIndex];
   const answeredCount = Object.keys(answers).length;
   const allAnswered = answeredCount === quiz.questions.length;
-  const progressPercent = (answeredCount / quiz.questions.length) * 100;
+  const progressPercent = answeredCount / quiz.questions.length / 100;
 
   return (

[Killed] ArithmeticOperator
src/components/quiz/QuizContainer.tsx:208:25
           <div>
             <CardTitle>Reading Quiz</CardTitle>
             <CardDescription>
-              Question {currentIndex + 1} of {quiz.questions.length}
+              Question {currentIndex - 1} of {quiz.questions.length}
             </CardDescription>
           </div>
killedBy: QuizContainer loads quiz and renders first question state
statusReason: Unable to find an element with the text: Question 1 of 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Survived] ConditionalExpression
src/components/quiz/QuizContainer.tsx:225:15
         <div className="flex items-center gap-2">
           <span
             className={`text-xs px-2 py-1 rounded-full ${
-              currentQuestion.type === "comprehension_mcq"
+              true
                 ? "bg-blue-100 text-blue-700 dark:bg-blue-900 dark:text-blue-300"
                 : "bg-green-100 text-green-700 dark:bg-green-900 dark:text-green-300"

[Survived] EqualityOperator
src/components/quiz/QuizContainer.tsx:225:15
         <div className="flex items-center gap-2">
           <span
             className={`text-xs px-2 py-1 rounded-full ${
-              currentQuestion.type === "comprehension_mcq"
+              currentQuestion.type !== "comprehension_mcq"
                 ? "bg-blue-100 text-blue-700 dark:bg-blue-900 dark:text-blue-300"
                 : "bg-green-100 text-green-700 dark:bg-green-900 dark:text-green-300"

[Killed] EqualityOperator
src/components/quiz/QuizContainer.tsx:230:14
                 : "bg-green-100 text-green-700 dark:bg-green-900 dark:text-green-300"
             }`}
           >
-            {currentQuestion.type === "comprehension_mcq"
+            {currentQuestion.type !== "comprehension_mcq"
               ? "Reading Comprehension"
               : "Vocabulary"}
killedBy: QuizContainer loads quiz and renders first question state
statusReason: Unable to find an element with the text: Reading Comprehension. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-

[Killed] ConditionalExpression
src/components/quiz/QuizContainer.tsx:230:14
                 : "bg-green-100 text-green-700 dark:bg-green-900 dark:text-green-300"
             }`}
           >
-            {currentQuestion.type === "comprehension_mcq"
+            {false
               ? "Reading Comprehension"
               : "Vocabulary"}
killedBy: QuizContainer loads quiz and renders first question state
statusReason: Unable to find an element with the text: Reading Comprehension. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-
