[Killed] ConditionalExpression
src/components/quiz/QuizContainer.tsx:237:10
         </div>
 
         {/* Question Component */}
-        {currentQuestion.type === "comprehension_mcq" ? (
+        {true ? (
           <MCQQuestion
             question={currentQuestion}
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an element with the text: Mock Fill Blank. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] EqualityOperator
src/components/quiz/QuizContainer.tsx:237:10
         </div>
 
         {/* Question Component */}
-        {currentQuestion.type === "comprehension_mcq" ? (
+        {currentQuestion.type !== "comprehension_mcq" ? (
           <MCQQuestion
             question={currentQuestion}
killedBy: QuizContainer loads quiz and renders first question state
statusReason: Unable to find an element with the text: Mock MCQ. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Killed] ArrowFunction
src/components/quiz/QuizContainer.tsx:241:23
           <MCQQuestion
             question={currentQuestion}
             selectedAnswer={answers[currentQuestion.id]}
-            onAnswer={(answer) => handleAnswer(currentQuestion.id, answer)}
+            onAnswer={() => undefined}
           />
         ) : (
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an element with the text: 1/2 answered. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="bg-card text-card-foreground flex flex-col gap-6 rounded-xl border py-6 shadow-sm mx-auto max-w-2xl"

[Survived] ConditionalExpression
src/components/quiz/QuizContainer.tsx:246:21
         ) : (
           <FillBlankQuestion
             question={currentQuestion}
-            answer={answers[currentQuestion.id] || ""}
+            answer={false}
             onAnswer={(answer) => handleAnswer(currentQuestion.id, answer)}
           />

[Survived] ConditionalExpression
src/components/quiz/QuizContainer.tsx:246:21
         ) : (
           <FillBlankQuestion
             question={currentQuestion}
-            answer={answers[currentQuestion.id] || ""}
+            answer={true}
             onAnswer={(answer) => handleAnswer(currentQuestion.id, answer)}
           />

[Killed] ArrowFunction
src/components/quiz/QuizContainer.tsx:247:23
           <FillBlankQuestion
             question={currentQuestion}
             answer={answers[currentQuestion.id] || ""}
-            onAnswer={(answer) => handleAnswer(currentQuestion.id, answer)}
+            onAnswer={() => undefined}
           />
         )}
killedBy: QuizContainer navigates, submits, and displays results
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  data-size="default"
  data-slot="button"
  data-variant="default"

[Survived] ConditionalExpression
src/components/quiz/QuizContainer.tsx:256:23
           <Button
             variant="outline"
             onClick={handlePrevious}
-            disabled={currentIndex === 0}
+            disabled={false}
           >
             <ChevronLeft className="mr-1 h-4 w-4" />

[Survived] ConditionalExpression
src/components/quiz/QuizContainer.tsx:256:23
           <Button
             variant="outline"
             onClick={handlePrevious}
-            disabled={currentIndex === 0}
+            disabled={true}
           >
             <ChevronLeft className="mr-1 h-4 w-4" />

[Survived] ArrowFunction
src/components/quiz/QuizContainer.tsx:263:33
           </Button>
 
           <div className="flex gap-1">
-            {quiz.questions.map((_, index) => (
-              <button
-                key={index}
-                onClick={() => setCurrentIndex(index)}
-                className={`h-2 w-2 rounded-full transition-colors ${
-                  index === currentIndex
-                    ? "bg-primary"
-                    : answers[quiz.questions[index].id]
-                    ? "bg-primary/50"
-                    : "bg-muted"
-                }`}
-              />
-            ))}
+            {quiz.questions.map(() => undefined)}
           </div>
 

[Survived] ArrowFunction
src/components/quiz/QuizContainer.tsx:266:26
             {quiz.questions.map((_, index) => (
               <button
                 key={index}
-                onClick={() => setCurrentIndex(index)}
+                onClick={() => undefined}
                 className={`h-2 w-2 rounded-full transition-colors ${
                   index === currentIndex

[Survived] StringLiteral
src/components/quiz/QuizContainer.tsx:267:28
               <button
                 key={index}
                 onClick={() => setCurrentIndex(index)}
-                className={`h-2 w-2 rounded-full transition-colors ${
-                  index === currentIndex
-                    ? "bg-primary"
-                    : answers[quiz.questions[index].id]
-                    ? "bg-primary/50"
-                    : "bg-muted"
-                }`}
+                className={``}
               />
             ))}

[Survived] ConditionalExpression
src/components/quiz/QuizContainer.tsx:268:19
                 key={index}
                 onClick={() => setCurrentIndex(index)}
                 className={`h-2 w-2 rounded-full transition-colors ${
-                  index === currentIndex
+                  true
                     ? "bg-primary"
                     : answers[quiz.questions[index].id]

[Survived] ConditionalExpression
src/components/quiz/QuizContainer.tsx:268:19
                 key={index}
                 onClick={() => setCurrentIndex(index)}
                 className={`h-2 w-2 rounded-full transition-colors ${
-                  index === currentIndex
+                  false
                     ? "bg-primary"
                     : answers[quiz.questions[index].id]

[Survived] StringLiteral
src/components/quiz/QuizContainer.tsx:271:23
                   index === currentIndex
                     ? "bg-primary"
                     : answers[quiz.questions[index].id]
-                    ? "bg-primary/50"
+                    ? ""
                     : "bg-muted"
                 }`}

[Killed] ConditionalExpression
src/components/quiz/QuizContainer.tsx:278:12
             ))}
           </div>
 
-          {currentIndex === quiz.questions.length - 1 ? (
+          {false ? (
             <Button
               onClick={handleSubmit}
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an accessible element with the role "button" and name `/Submit Quiz/i`

Here are the accessible roles:

  progressbar:

  Name "":
  <div

[Killed] ConditionalExpression
src/components/quiz/QuizContainer.tsx:278:12
             ))}
           </div>
 
-          {currentIndex === quiz.questions.length - 1 ? (
+          {true ? (
             <Button
               onClick={handleSubmit}
killedBy: QuizContainer navigates, submits, and displays results
statusReason: Unable to find an accessible element with the role "button" and name `/Next/i`

Here are the accessible roles:

  progressbar:

  Name "":
  <div

[Killed] BooleanLiteral
src/components/quiz/QuizContainer.tsx:281:25
           {currentIndex === quiz.questions.length - 1 ? (
             <Button
               onClick={handleSubmit}
-              disabled={!allAnswered || isSubmitting}
+              disabled={allAnswered || isSubmitting}
             >
               {isSubmitting ? (
killedBy: QuizContainer navigates, submits, and displays results
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  data-size="default"
  data-slot="button"
  data-variant="default"

[Killed] ConditionalExpression
src/components/quiz/QuizContainer.tsx:281:25
           {currentIndex === quiz.questions.length - 1 ? (
             <Button
               onClick={handleSubmit}
-              disabled={!allAnswered || isSubmitting}
+              disabled={true}
             >
               {isSubmitting ? (
killedBy: QuizContainer navigates, submits, and displays results
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  data-size="default"
  data-slot="button"
  data-variant="default"
