[Killed] ConditionalExpression
src/components/quiz/QuizResults.tsx:63:22
 }: QuizResultsProps) {
   const { totalScore, totalMaxScore, percentage, reading, vocabulary } = results;
 
-  const hasLevelUp = reading.levelUp || vocabulary.levelUp;
+  const hasLevelUp = true;
   const totalXP = reading.xpAwarded.totalXP + vocabulary.xpAwarded.totalXP;
 
killedBy: QuizResults does not render level-up section when no level ups occurred
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="font-semibold text-purple-700 dark:text-purple-300"
>
  Level Up!
</span> instead

[Killed] ConditionalExpression
src/components/quiz/QuizResults.tsx:63:22
 }: QuizResultsProps) {
   const { totalScore, totalMaxScore, percentage, reading, vocabulary } = results;
 
-  const hasLevelUp = reading.levelUp || vocabulary.levelUp;
+  const hasLevelUp = false;
   const totalXP = reading.xpAwarded.totalXP + vocabulary.xpAwarded.totalXP;
 
killedBy: QuizResults renders level-up section when at least one skill levels up
statusReason: Unable to find an element with the text: Level Up!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ArithmeticOperator
src/components/quiz/QuizResults.tsx:64:19
   const { totalScore, totalMaxScore, percentage, reading, vocabulary } = results;
 
   const hasLevelUp = reading.levelUp || vocabulary.levelUp;
-  const totalXP = reading.xpAwarded.totalXP + vocabulary.xpAwarded.totalXP;
+  const totalXP = reading.xpAwarded.totalXP - vocabulary.xpAwarded.totalXP;
 
   // Determine performance message
killedBy: QuizResults renders score, percentage, XP, and links
statusReason: Unable to find an element with the text: +40 XP. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ConditionalExpression
src/components/quiz/QuizResults.tsx:70:7
   let performanceMessage: string;
   let performanceIcon: React.ReactNode;
 
-  if (percentage >= 90) {
+  if (false) {
     performanceMessage = "Excellent work!";
     performanceIcon = <Trophy className="h-8 w-8 text-yellow-500" />;
killedBy: QuizResults shows excellent message at 90+
statusReason: Unable to find an element with the text: Excellent work!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] EqualityOperator
src/components/quiz/QuizResults.tsx:70:7
   let performanceMessage: string;
   let performanceIcon: React.ReactNode;
 
-  if (percentage >= 90) {
+  if (percentage > 90) {
     performanceMessage = "Excellent work!";
     performanceIcon = <Trophy className="h-8 w-8 text-yellow-500" />;
killedBy: QuizResults shows excellent message at 90+
statusReason: Unable to find an element with the text: Excellent work!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ConditionalExpression
src/components/quiz/QuizResults.tsx:73:14
   if (percentage >= 90) {
     performanceMessage = "Excellent work!";
     performanceIcon = <Trophy className="h-8 w-8 text-yellow-500" />;
-  } else if (percentage >= 70) {
+  } else if (true) {
     performanceMessage = "Great job!";
     performanceIcon = <Star className="h-8 w-8 text-blue-500" />;
killedBy: QuizResults shows good-effort message for mid-range scores
statusReason: Unable to find an element with the text: Good effort!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] EqualityOperator
src/components/quiz/QuizResults.tsx:73:14
   if (percentage >= 90) {
     performanceMessage = "Excellent work!";
     performanceIcon = <Trophy className="h-8 w-8 text-yellow-500" />;
-  } else if (percentage >= 70) {
+  } else if (percentage > 70) {
     performanceMessage = "Great job!";
     performanceIcon = <Star className="h-8 w-8 text-blue-500" />;
killedBy: QuizResults supports optional continue callback without crashing
statusReason: Unable to find an element with the text: Great job!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] BlockStatement
src/components/quiz/QuizResults.tsx:76:32
   } else if (percentage >= 70) {
     performanceMessage = "Great job!";
     performanceIcon = <Star className="h-8 w-8 text-blue-500" />;
-  } else if (percentage >= 50) {
-    performanceMessage = "Good effort!";
-    performanceIcon = <TrendingUp className="h-8 w-8 text-green-500" />;
-  } else {
+  } else if (percentage >= 50) {} else {
     performanceMessage = "Keep practicing!";
     performanceIcon = <Sparkles className="h-8 w-8 text-purple-500" />;
killedBy: QuizResults shows good-effort message for mid-range scores
statusReason: Unable to find an element with the text: Good effort!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ConditionalExpression
src/components/quiz/QuizResults.tsx:76:14
   } else if (percentage >= 70) {
     performanceMessage = "Great job!";
     performanceIcon = <Star className="h-8 w-8 text-blue-500" />;
-  } else if (percentage >= 50) {
+  } else if (true) {
     performanceMessage = "Good effort!";
     performanceIcon = <TrendingUp className="h-8 w-8 text-green-500" />;
killedBy: QuizResults shows keep-practicing message below 50
statusReason: Unable to find an element with the text: Keep practicing!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] BlockStatement
src/components/quiz/QuizResults.tsx:79:10
   } else if (percentage >= 50) {
     performanceMessage = "Good effort!";
     performanceIcon = <TrendingUp className="h-8 w-8 text-green-500" />;
-  } else {
-    performanceMessage = "Keep practicing!";
-    performanceIcon = <Sparkles className="h-8 w-8 text-purple-500" />;
-  }
+  } else {}
 
   return (
killedBy: QuizResults shows keep-practicing message below 50
statusReason: Unable to find an element with the text: Keep practicing!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Survived] ConditionalExpression
src/components/quiz/QuizResults.tsx:91:12
         <CardHeader className="text-center pb-2">
           <div className="mx-auto mb-2">{performanceIcon}</div>
           <CardTitle className="text-2xl">{performanceMessage}</CardTitle>
-          {contentTitle && (
-            <CardDescription>Quiz for: {contentTitle}</CardDescription>
-          )}
+          {true}
         </CardHeader>
         <CardContent className="space-y-6">

[Survived] ConditionalExpression
src/components/quiz/QuizResults.tsx:91:12
         <CardHeader className="text-center pb-2">
           <div className="mx-auto mb-2">{performanceIcon}</div>
           <CardTitle className="text-2xl">{performanceMessage}</CardTitle>
-          {contentTitle && (
-            <CardDescription>Quiz for: {contentTitle}</CardDescription>
-          )}
+          {false}
         </CardHeader>
         <CardContent className="space-y-6">

[Killed] LogicalOperator
src/components/quiz/QuizResults.tsx:123:18
                 </span>
               </div>
               <div className="space-y-2">
-                {reading.levelUp && (
-                  <div className="text-center">
-                    <span className="text-sm text-muted-foreground">Reading: </span>
-                    <span className="font-medium">
-                      Level {reading.levelUp.from} → {reading.levelUp.to}
-                    </span>
-                    {reading.levelUp.crossedCEFRBoundary && (
-                      <span className="ml-2 text-xs bg-purple-100 dark:bg-purple-900 px-2 py-0.5 rounded">
-                        Now {reading.levelUp.newCEFR}!
-                      </span>
-                    )}
-                  </div>
-                )}
+                {reading.levelUp || <div className="text-center">
+                    <span className="text-sm text-muted-foreground">Reading: </span>
+                    <span className="font-medium">
+                      Level {reading.levelUp.from} → {reading.levelUp.to}
+                    </span>
+                    {reading.levelUp.crossedCEFRBoundary && <span className="ml-2 text-xs bg-purple-100 dark:bg-purple-900 px-2 py-0.5 rounded">
+                        Now {reading.levelUp.newCEFR}!
+                      </span>}
+                  </div>}
                 {vocabulary.levelUp && (
                   <div className="text-center">
killedBy: QuizResults renders level-up section when at least one skill levels up
statusReason: Objects are not valid as a React child (found: object with keys {from, to, newCEFR, crossedCEFRBoundary}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
src/components/quiz/QuizResults.tsx:123:18
                 </span>
               </div>
               <div className="space-y-2">
-                {reading.levelUp && (
-                  <div className="text-center">
-                    <span className="text-sm text-muted-foreground">Reading: </span>
-                    <span className="font-medium">
-                      Level {reading.levelUp.from} → {reading.levelUp.to}
-                    </span>
-                    {reading.levelUp.crossedCEFRBoundary && (
-                      <span className="ml-2 text-xs bg-purple-100 dark:bg-purple-900 px-2 py-0.5 rounded">
-                        Now {reading.levelUp.newCEFR}!
-                      </span>
-                    )}
-                  </div>
-                )}
+                {true}
                 {vocabulary.levelUp && (
                   <div className="text-center">
killedBy: QuizResults renders level-up section when at least one skill levels up
statusReason: Unable to find an element with the text: /Level 7/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] LogicalOperator
src/components/quiz/QuizResults.tsx:129:22
                     <span className="font-medium">
                       Level {reading.levelUp.from} → {reading.levelUp.to}
                     </span>
-                    {reading.levelUp.crossedCEFRBoundary && (
-                      <span className="ml-2 text-xs bg-purple-100 dark:bg-purple-900 px-2 py-0.5 rounded">
-                        Now {reading.levelUp.newCEFR}!
-                      </span>
-                    )}
+                    {reading.levelUp.crossedCEFRBoundary || <span className="ml-2 text-xs bg-purple-100 dark:bg-purple-900 px-2 py-0.5 rounded">
+                        Now {reading.levelUp.newCEFR}!
+                      </span>}
                   </div>
                 )}
killedBy: QuizResults renders level-up section when at least one skill levels up
statusReason: Unable to find an element with the text: /Now B2!/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] ConditionalExpression
src/components/quiz/QuizResults.tsx:129:22
                     <span className="font-medium">
                       Level {reading.levelUp.from} → {reading.levelUp.to}
                     </span>
-                    {reading.levelUp.crossedCEFRBoundary && (
-                      <span className="ml-2 text-xs bg-purple-100 dark:bg-purple-900 px-2 py-0.5 rounded">
-                        Now {reading.levelUp.newCEFR}!
-                      </span>
-                    )}
+                    {false}
                   </div>
                 )}
killedBy: QuizResults renders level-up section when at least one skill levels up
statusReason: Unable to find an element with the text: /Now B2!/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="space-y-6"
    >

[Killed] LogicalOperator
src/components/quiz/QuizResults.tsx:136:18
                     )}
                   </div>
                 )}
-                {vocabulary.levelUp && (
-                  <div className="text-center">
-                    <span className="text-sm text-muted-foreground">Vocabulary: </span>
-                    <span className="font-medium">
-                      Level {vocabulary.levelUp.from} → {vocabulary.levelUp.to}
-                    </span>
-                    {vocabulary.levelUp.crossedCEFRBoundary && (
-                      <span className="ml-2 text-xs bg-purple-100 dark:bg-purple-900 px-2 py-0.5 rounded">
-                        Now {vocabulary.levelUp.newCEFR}!
-                      </span>
-                    )}
-                  </div>
-                )}
+                {vocabulary.levelUp || <div className="text-center">
+                    <span className="text-sm text-muted-foreground">Vocabulary: </span>
+                    <span className="font-medium">
+                      Level {vocabulary.levelUp.from} → {vocabulary.levelUp.to}
+                    </span>
+                    {vocabulary.levelUp.crossedCEFRBoundary && <span className="ml-2 text-xs bg-purple-100 dark:bg-purple-900 px-2 py-0.5 rounded">
+                        Now {vocabulary.levelUp.newCEFR}!
+                      </span>}
+                  </div>}
               </div>
             </div>
killedBy: QuizResults renders level-up section when at least one skill levels up
statusReason: Cannot read properties of null (reading 'from')

[Survived] ConditionalExpression
src/components/quiz/QuizResults.tsx:136:18
                     )}
                   </div>
                 )}
-                {vocabulary.levelUp && (
-                  <div className="text-center">
-                    <span className="text-sm text-muted-foreground">Vocabulary: </span>
-                    <span className="font-medium">
-                      Level {vocabulary.levelUp.from} → {vocabulary.levelUp.to}
-                    </span>
-                    {vocabulary.levelUp.crossedCEFRBoundary && (
-                      <span className="ml-2 text-xs bg-purple-100 dark:bg-purple-900 px-2 py-0.5 rounded">
-                        Now {vocabulary.levelUp.newCEFR}!
-                      </span>
-                    )}
-                  </div>
-                )}
+                {false}
               </div>
             </div>

[Survived] ConditionalExpression
src/components/quiz/QuizResults.tsx:142:22
                     <span className="font-medium">
                       Level {vocabulary.levelUp.from} → {vocabulary.levelUp.to}
                     </span>
-                    {vocabulary.levelUp.crossedCEFRBoundary && (
-                      <span className="ml-2 text-xs bg-purple-100 dark:bg-purple-900 px-2 py-0.5 rounded">
-                        Now {vocabulary.levelUp.newCEFR}!
-                      </span>
-                    )}
+                    {true}
                   </div>
                 )}

[Survived] ConditionalExpression
src/components/quiz/QuizResults.tsx:142:22
                     <span className="font-medium">
                       Level {vocabulary.levelUp.from} → {vocabulary.levelUp.to}
                     </span>
-                    {vocabulary.levelUp.crossedCEFRBoundary && (
-                      <span className="ml-2 text-xs bg-purple-100 dark:bg-purple-900 px-2 py-0.5 rounded">
-                        Now {vocabulary.levelUp.newCEFR}!
-                      </span>
-                    )}
+                    {false}
                   </div>
                 )}
