[Survived] ObjectLiteral
src/lib/quiz-generator.ts:30:53
 /**
  * Guidelines for question difficulty based on CEFR level
  */
-const LEVEL_GUIDELINES: Record<CEFRLevel, string> = {
-  A1: "Very simple questions. Use basic vocabulary. Questions can be in native language. Focus on literal understanding.",
-  A2: "Simple questions with common vocabulary. Mix of native and target language. Focus on main ideas.",
-  B1: "Moderate complexity. Questions mostly in target language. Test understanding of opinions and feelings.",
-  B2: "Complex questions in target language. Test inference and implicit meaning.",
-  C1: "Sophisticated questions. Test nuanced understanding and author's intent.",
-  C2: "Native-level complexity. Test subtle meanings, cultural references, and advanced inference.",
-};
+const LEVEL_GUIDELINES: Record<CEFRLevel, string> = {};
 
 /**

[Survived] StringLiteral
src/lib/quiz-generator.ts:33:7
 const LEVEL_GUIDELINES: Record<CEFRLevel, string> = {
   A1: "Very simple questions. Use basic vocabulary. Questions can be in native language. Focus on literal understanding.",
   A2: "Simple questions with common vocabulary. Mix of native and target language. Focus on main ideas.",
-  B1: "Moderate complexity. Questions mostly in target language. Test understanding of opinions and feelings.",
+  B1: "",
   B2: "Complex questions in target language. Test inference and implicit meaning.",
   C1: "Sophisticated questions. Test nuanced understanding and author's intent.",

[Survived] MethodExpression
src/lib/quiz-generator.ts:55:25
   const contentCEFR = content.difficulty_level;
 
   // Truncate content body to avoid token limits (roughly 3000 chars)
-  const truncatedBody = content.body
-    .replace(/<[^>]*>/g, " ") // Strip HTML tags
-    .replace(/\s+/g, " ") // Normalize whitespace
-    .trim()
-    .slice(0, 3000);
+  const truncatedBody = content.body.replace(/<[^>]*>/g, " ") // Strip HTML tags
+.replace(/\s+/g, " ") // Normalize whitespace
+.trim();
 
   // Build vocabulary context for fill-in-blank questions

[Survived] MethodExpression
src/lib/quiz-generator.ts:55:25
   const contentCEFR = content.difficulty_level;
 
   // Truncate content body to avoid token limits (roughly 3000 chars)
-  const truncatedBody = content.body
-    .replace(/<[^>]*>/g, " ") // Strip HTML tags
-    .replace(/\s+/g, " ") // Normalize whitespace
-    .trim()
+  const truncatedBody = content.body.replace(/<[^>]*>/g, " ") // Strip HTML tags
+.replace(/\s+/g, " ") // Normalize whitespace
     .slice(0, 3000);
 

[Survived] Regex
src/lib/quiz-generator.ts:57:14
   // Truncate content body to avoid token limits (roughly 3000 chars)
   const truncatedBody = content.body
     .replace(/<[^>]*>/g, " ") // Strip HTML tags
-    .replace(/\s+/g, " ") // Normalize whitespace
+    .replace(/\s/g, " ") // Normalize whitespace
     .trim()
     .slice(0, 3000);

[Survived] ConditionalExpression
src/lib/quiz-generator.ts:62:24
     .slice(0, 3000);
 
   // Build vocabulary context for fill-in-blank questions
-  const vocabContext = savedVocabulary.length > 0
+  const vocabContext = false
     ? `The student has saved these vocabulary words from this content: ${savedVocabulary.map(v => v.word).join(", ")}. Use some of these for fill-in-blank questions.`
     : "Create vocabulary questions from key words that appeared in the text.";

[Survived] EqualityOperator
src/lib/quiz-generator.ts:62:24
     .slice(0, 3000);
 
   // Build vocabulary context for fill-in-blank questions
-  const vocabContext = savedVocabulary.length > 0
+  const vocabContext = savedVocabulary.length <= 0
     ? `The student has saved these vocabulary words from this content: ${savedVocabulary.map(v => v.word).join(", ")}. Use some of these for fill-in-blank questions.`
     : "Create vocabulary questions from key words that appeared in the text.";

[Survived] ArrowFunction
src/lib/quiz-generator.ts:63:94
 
   // Build vocabulary context for fill-in-blank questions
   const vocabContext = savedVocabulary.length > 0
-    ? `The student has saved these vocabulary words from this content: ${savedVocabulary.map(v => v.word).join(", ")}. Use some of these for fill-in-blank questions.`
+    ? `The student has saved these vocabulary words from this content: ${savedVocabulary.map(() => undefined).join(", ")}. Use some of these for fill-in-blank questions.`
     : "Create vocabulary questions from key words that appeared in the text.";
 

[Survived] StringLiteral
src/lib/quiz-generator.ts:63:7
 
   // Build vocabulary context for fill-in-blank questions
   const vocabContext = savedVocabulary.length > 0
-    ? `The student has saved these vocabulary words from this content: ${savedVocabulary.map(v => v.word).join(", ")}. Use some of these for fill-in-blank questions.`
+    ? ``
     : "Create vocabulary questions from key words that appeared in the text.";
 

[Survived] StringLiteral
src/lib/quiz-generator.ts:64:7
   // Build vocabulary context for fill-in-blank questions
   const vocabContext = savedVocabulary.length > 0
     ? `The student has saved these vocabulary words from this content: ${savedVocabulary.map(v => v.word).join(", ")}. Use some of these for fill-in-blank questions.`
-    : "Create vocabulary questions from key words that appeared in the text.";
+    : "";
 
   const prompt = `You are creating a language learning quiz for a student.

[Survived] EqualityOperator
src/lib/quiz-generator.ts:91:38
   {
     "id": "q1",
     "type": "comprehension_mcq",
-    "question": "Question text (in ${userLevel <= 6 ? nativeLanguage : content.language})",
+    "question": "Question text (in ${userLevel < 6 ? nativeLanguage : content.language})",
     "options": ["Option A", "Option B", "Option C", "Option D"],
     "correct_answer": "Option A",

[Survived] ConditionalExpression
src/lib/quiz-generator.ts:91:38
   {
     "id": "q1",
     "type": "comprehension_mcq",
-    "question": "Question text (in ${userLevel <= 6 ? nativeLanguage : content.language})",
+    "question": "Question text (in ${true ? nativeLanguage : content.language})",
     "options": ["Option A", "Option B", "Option C", "Option D"],
     "correct_answer": "Option A",

[Killed] LogicalOperator
src/lib/quiz-generator.ts:121:24
     temperature: 0.7,
   });
 
-  const textResponse = response.choices[0]?.message?.content || "";
+  const textResponse = response.choices[0]?.message?.content && "";
 
   // Extract JSON from response
killedBy: quiz-generator generates quiz and normalizes missing IDs
statusReason: Failed to parse quiz response from AI

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:121:24
     temperature: 0.7,
   });
 
-  const textResponse = response.choices[0]?.message?.content || "";
+  const textResponse = false;
 
   // Extract JSON from response
killedBy: quiz-generator generates quiz and normalizes missing IDs
statusReason: textResponse.match is not a function

[Killed] BlockStatement
src/lib/quiz-generator.ts:125:19
 
   // Extract JSON from response
   const jsonMatch = textResponse.match(/\[[\s\S]*\]/);
-  if (!jsonMatch) {
-    console.error("Failed to parse quiz response:", textResponse);
-    throw new Error("Failed to parse quiz response from AI");
-  }
+  if (!jsonMatch) {}
 
   let questions: AssessmentQuestion[];
killedBy: quiz-generator throws when AI response does not include parseable JSON array
statusReason: expected [Function] to throw error including 'Failed to parse quiz response from AI' but got 'Invalid JSON in quiz response'

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:125:7
 
   // Extract JSON from response
   const jsonMatch = textResponse.match(/\[[\s\S]*\]/);
-  if (!jsonMatch) {
+  if (true) {
     console.error("Failed to parse quiz response:", textResponse);
     throw new Error("Failed to parse quiz response from AI");
killedBy: quiz-generator generates quiz and normalizes missing IDs
statusReason: Failed to parse quiz response from AI

[Killed] StringLiteral
src/lib/quiz-generator.ts:127:21
   const jsonMatch = textResponse.match(/\[[\s\S]*\]/);
   if (!jsonMatch) {
     console.error("Failed to parse quiz response:", textResponse);
-    throw new Error("Failed to parse quiz response from AI");
+    throw new Error("");
   }
 
killedBy: quiz-generator throws when AI response does not include parseable JSON array
statusReason: expected [Function] to throw error including 'Failed to parse quiz response from AI' but got ''

[Killed] BlockStatement
src/lib/quiz-generator.ts:131:7
   }
 
   let questions: AssessmentQuestion[];
-  try {
-    questions = JSON.parse(jsonMatch[0]);
-  } catch (e) {
+  try {} catch (e) {
     console.error("Invalid JSON in quiz response:", e);
     throw new Error("Invalid JSON in quiz response");
killedBy: quiz-generator generates quiz and normalizes missing IDs
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/lib/quiz-generator.ts:133:15
   let questions: AssessmentQuestion[];
   try {
     questions = JSON.parse(jsonMatch[0]);
-  } catch (e) {
-    console.error("Invalid JSON in quiz response:", e);
-    throw new Error("Invalid JSON in quiz response");
-  }
+  } catch (e) {}
 
   // Validate questions have required fields
killedBy: quiz-generator throws when AI response contains invalid JSON
statusReason: expected [Function] to throw error including 'Invalid JSON in quiz response' but got 'Cannot read properties of undefined (…'

[Survived] StringLiteral
src/lib/quiz-generator.ts:134:19
   try {
     questions = JSON.parse(jsonMatch[0]);
   } catch (e) {
-    console.error("Invalid JSON in quiz response:", e);
+    console.error("", e);
     throw new Error("Invalid JSON in quiz response");
   }

[Killed] StringLiteral
src/lib/quiz-generator.ts:135:21
     questions = JSON.parse(jsonMatch[0]);
   } catch (e) {
     console.error("Invalid JSON in quiz response:", e);
-    throw new Error("Invalid JSON in quiz response");
+    throw new Error("");
   }
 
killedBy: quiz-generator throws when AI response contains invalid JSON
statusReason: expected [Function] to throw error including 'Invalid JSON in quiz response' but got ''

[Killed] ArrowFunction
src/lib/quiz-generator.ts:139:29
   }
 
   // Validate questions have required fields
-  questions = questions.map((q, index) => ({
-    id: q.id || `q${index + 1}`,
-    type: q.type,
-    question: q.question,
-    options: q.options,
-    correct_answer: q.correct_answer,
-    context: q.context,
-    hint: q.hint,
-  }));
+  questions = questions.map(() => undefined);
 
   return {
killedBy: quiz-generator generates quiz and normalizes missing IDs
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:140:9
 
   // Validate questions have required fields
   questions = questions.map((q, index) => ({
-    id: q.id || `q${index + 1}`,
+    id: true,
     type: q.type,
     question: q.question,
killedBy: quiz-generator generates quiz and normalizes missing IDs
statusReason: expected true to be 'q1' // Object.is equality

[Killed] LogicalOperator
src/lib/quiz-generator.ts:140:9
 
   // Validate questions have required fields
   questions = questions.map((q, index) => ({
-    id: q.id || `q${index + 1}`,
+    id: q.id && `q${index + 1}`,
     type: q.type,
     question: q.question,
killedBy: quiz-generator generates quiz and normalizes missing IDs
statusReason: expected undefined to be 'q2' // Object.is equality

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:152:19
   return {
     questions,
     contentId: content.id,
-    contentLevel: content.numeric_level || 5,
+    contentLevel: false,
     generatedAt: new Date().toISOString(),
   };
killedBy: quiz-generator generates quiz and normalizes missing IDs
statusReason: expected false to be 5 // Object.is equality

[Killed] LogicalOperator
src/lib/quiz-generator.ts:152:19
   return {
     questions,
     contentId: content.id,
-    contentLevel: content.numeric_level || 5,
+    contentLevel: content.numeric_level && 5,
     generatedAt: new Date().toISOString(),
   };
killedBy: quiz-generator generates quiz and normalizes missing IDs
statusReason: expected undefined to be 5 // Object.is equality

[Survived] MethodExpression
src/lib/quiz-generator.ts:172:25
   const cefrLevel = numericLevelToCEFR(targetLevel);
 
   // Truncate content body to avoid token limits
-  const truncatedBody = contentBody
-    .replace(/<[^>]*>/g, " ")
-    .replace(/\s+/g, " ")
-    .trim()
-    .slice(0, 3000);
+  const truncatedBody = contentBody.replace(/<[^>]*>/g, " ").replace(/\s+/g, " ").trim();
 
   const vocabContext = vocabulary.length > 0

[Survived] MethodExpression
src/lib/quiz-generator.ts:172:25
   const cefrLevel = numericLevelToCEFR(targetLevel);
 
   // Truncate content body to avoid token limits
-  const truncatedBody = contentBody
-    .replace(/<[^>]*>/g, " ")
-    .replace(/\s+/g, " ")
-    .trim()
+  const truncatedBody = contentBody.replace(/<[^>]*>/g, " ").replace(/\s+/g, " ")
     .slice(0, 3000);
 

[Survived] Regex
src/lib/quiz-generator.ts:173:14
 
   // Truncate content body to avoid token limits
   const truncatedBody = contentBody
-    .replace(/<[^>]*>/g, " ")
+    .replace(/<[>]*>/g, " ")
     .replace(/\s+/g, " ")
     .trim()

[Survived] Regex
src/lib/quiz-generator.ts:174:14
   // Truncate content body to avoid token limits
   const truncatedBody = contentBody
     .replace(/<[^>]*>/g, " ")
-    .replace(/\s+/g, " ")
+    .replace(/\S+/g, " ")
     .trim()
     .slice(0, 3000);

[Survived] ConditionalExpression
src/lib/quiz-generator.ts:178:24
     .trim()
     .slice(0, 3000);
 
-  const vocabContext = vocabulary.length > 0
+  const vocabContext = false
     ? `Key vocabulary from the text: ${vocabulary.map(v => `${v.word} (${v.translation})`).join(", ")}. Use some of these for fill-in-blank questions.`
     : "Create vocabulary questions from key words that appeared in the text.";

[Survived] ConditionalExpression
src/lib/quiz-generator.ts:178:24
     .trim()
     .slice(0, 3000);
 
-  const vocabContext = vocabulary.length > 0
+  const vocabContext = true
     ? `Key vocabulary from the text: ${vocabulary.map(v => `${v.word} (${v.translation})`).join(", ")}. Use some of these for fill-in-blank questions.`
     : "Create vocabulary questions from key words that appeared in the text.";

[Survived] ArrowFunction
src/lib/quiz-generator.ts:179:55
     .slice(0, 3000);
 
   const vocabContext = vocabulary.length > 0
-    ? `Key vocabulary from the text: ${vocabulary.map(v => `${v.word} (${v.translation})`).join(", ")}. Use some of these for fill-in-blank questions.`
+    ? `Key vocabulary from the text: ${vocabulary.map(() => undefined).join(", ")}. Use some of these for fill-in-blank questions.`
     : "Create vocabulary questions from key words that appeared in the text.";
 

[Survived] StringLiteral
src/lib/quiz-generator.ts:179:7
     .slice(0, 3000);
 
   const vocabContext = vocabulary.length > 0
-    ? `Key vocabulary from the text: ${vocabulary.map(v => `${v.word} (${v.translation})`).join(", ")}. Use some of these for fill-in-blank questions.`
+    ? ``
     : "Create vocabulary questions from key words that appeared in the text.";
 

[Survived] EqualityOperator
src/lib/quiz-generator.ts:206:38
   {
     "id": "q1",
     "type": "comprehension_mcq",
-    "question": "Question text (in ${targetLevel <= 6 ? nativeLanguage : targetLanguage})",
+    "question": "Question text (in ${targetLevel > 6 ? nativeLanguage : targetLanguage})",
     "options": ["Option A", "Option B", "Option C", "Option D"],
     "correct_answer": "Option A",

[Survived] EqualityOperator
src/lib/quiz-generator.ts:206:38
   {
     "id": "q1",
     "type": "comprehension_mcq",
-    "question": "Question text (in ${targetLevel <= 6 ? nativeLanguage : targetLanguage})",
+    "question": "Question text (in ${targetLevel < 6 ? nativeLanguage : targetLanguage})",
     "options": ["Option A", "Option B", "Option C", "Option D"],
     "correct_answer": "Option A",

[Survived] StringLiteral
src/lib/quiz-generator.ts:231:24
 
   const response = await openai.chat.completions.create({
     model: "gpt-4o-mini",
-    messages: [{ role: "user", content: prompt }],
+    messages: [{ role: "", content: prompt }],
     temperature: 0.7,
   });

[Survived] ObjectLiteral
src/lib/quiz-generator.ts:231:16
 
   const response = await openai.chat.completions.create({
     model: "gpt-4o-mini",
-    messages: [{ role: "user", content: prompt }],
+    messages: [{}],
     temperature: 0.7,
   });

[Killed] Regex
src/lib/quiz-generator.ts:237:40
 
   const textResponse = response.choices[0]?.message?.content || "";
 
-  const jsonMatch = textResponse.match(/\[[\s\S]*\]/);
+  const jsonMatch = textResponse.match(/\[[\s\s]*\]/);
   if (!jsonMatch) {
     console.error("Failed to parse quiz response:", textResponse);
killedBy: quiz-generator generates quiz from raw content and normalizes IDs
statusReason: Failed to parse quiz response from AI

[Killed] Regex
src/lib/quiz-generator.ts:237:40
 
   const textResponse = response.choices[0]?.message?.content || "";
 
-  const jsonMatch = textResponse.match(/\[[\s\S]*\]/);
+  const jsonMatch = textResponse.match(/\[[\S\S]*\]/);
   if (!jsonMatch) {
     console.error("Failed to parse quiz response:", textResponse);
killedBy: quiz-generator generates quiz from raw content and normalizes IDs
statusReason: expected [ { id: 'q1', …(6) }, …(3) ] to have a length of 1 but got 4

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:238:7
   const textResponse = response.choices[0]?.message?.content || "";
 
   const jsonMatch = textResponse.match(/\[[\s\S]*\]/);
-  if (!jsonMatch) {
+  if (false) {
     console.error("Failed to parse quiz response:", textResponse);
     throw new Error("Failed to parse quiz response from AI");
killedBy: quiz-generator throws from generateQuizFromContent when response has no JSON array
statusReason: expected [Function] to throw error including 'Failed to parse quiz response from AI' but got 'Invalid JSON in quiz response'

[Killed] BooleanLiteral
src/lib/quiz-generator.ts:238:7
   const textResponse = response.choices[0]?.message?.content || "";
 
   const jsonMatch = textResponse.match(/\[[\s\S]*\]/);
-  if (!jsonMatch) {
+  if (jsonMatch) {
     console.error("Failed to parse quiz response:", textResponse);
     throw new Error("Failed to parse quiz response from AI");
killedBy: quiz-generator generates quiz from raw content and normalizes IDs
statusReason: Failed to parse quiz response from AI

[Survived] StringLiteral
src/lib/quiz-generator.ts:239:19
 
   const jsonMatch = textResponse.match(/\[[\s\S]*\]/);
   if (!jsonMatch) {
-    console.error("Failed to parse quiz response:", textResponse);
+    console.error("", textResponse);
     throw new Error("Failed to parse quiz response from AI");
   }

[Killed] ArrowFunction
src/lib/quiz-generator.ts:252:24
   }
 
   // Validate and normalize questions
-  return questions.map((q, index) => ({
-    id: q.id || `q${index + 1}`,
-    type: q.type,
-    question: q.question,
-    options: q.options,
-    correct_answer: q.correct_answer,
-    context: q.context,
-    hint: q.hint,
-  }));
+  return questions.map(() => undefined);
 }
 
killedBy: quiz-generator generates quiz from raw content and normalizes IDs
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:253:9
 
   // Validate and normalize questions
   return questions.map((q, index) => ({
-    id: q.id || `q${index + 1}`,
+    id: true,
     type: q.type,
     question: q.question,
killedBy: quiz-generator generates quiz from raw content and normalizes IDs
statusReason: expected true to be 'q1' // Object.is equality

[Killed] LogicalOperator
src/lib/quiz-generator.ts:253:9
 
   // Validate and normalize questions
   return questions.map((q, index) => ({
-    id: q.id || `q${index + 1}`,
+    id: q.id && `q${index + 1}`,
     type: q.type,
     question: q.question,
killedBy: quiz-generator generates quiz from raw content and normalizes IDs
statusReason: expected undefined to be 'q1' // Object.is equality

[Killed] BlockStatement
src/lib/quiz-generator.ts:281:48
   let vocabularyScore = 0;
   let vocabularyMaxScore = 0;
 
-  const gradedQuestions = questions.map((q) => {
-    const userAnswer = userAnswers[q.id] || "";
-
-    // For fill-in-blank, do fuzzy matching (case-insensitive, trim whitespace)
-    let isCorrect: boolean;
-    if (q.type === "vocabulary_fill_blank") {
-      isCorrect = userAnswer.toLowerCase().trim() === q.correct_answer.toLowerCase().trim();
-      vocabularyMaxScore++;
-      if (isCorrect) vocabularyScore++;
-    } else {
-      // For MCQ, exact match
-      isCorrect = userAnswer === q.correct_answer;
-      readingMaxScore++;
-      if (isCorrect) readingScore++;
-    }
-
-    return {
-      ...q,
-      user_answer: userAnswer,
-      correct: isCorrect,
-    };
-  });
+  const gradedQuestions = questions.map((q) => {});
 
   return {
killedBy: quiz-generator grades MCQ answer as incorrect and does not increment reading score
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/lib/quiz-generator.ts:282:24
   let vocabularyMaxScore = 0;
 
   const gradedQuestions = questions.map((q) => {
-    const userAnswer = userAnswers[q.id] || "";
+    const userAnswer = userAnswers[q.id] && "";
 
     // For fill-in-blank, do fuzzy matching (case-insensitive, trim whitespace)
killedBy: quiz-generator grades MCQ answer as incorrect and does not increment reading score
statusReason: expected '' to be 'A' // Object.is equality

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:282:24
   let vocabularyMaxScore = 0;
 
   const gradedQuestions = questions.map((q) => {
-    const userAnswer = userAnswers[q.id] || "";
+    const userAnswer = true;
 
     // For fill-in-blank, do fuzzy matching (case-insensitive, trim whitespace)
killedBy: quiz-generator grades MCQ answer as incorrect and does not increment reading score
statusReason: expected true to be 'A' // Object.is equality

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:286:9
 
     // For fill-in-blank, do fuzzy matching (case-insensitive, trim whitespace)
     let isCorrect: boolean;
-    if (q.type === "vocabulary_fill_blank") {
+    if (true) {
       isCorrect = userAnswer.toLowerCase().trim() === q.correct_answer.toLowerCase().trim();
       vocabularyMaxScore++;
killedBy: quiz-generator grades MCQ answer as incorrect and does not increment reading score
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/lib/quiz-generator.ts:286:9
 
     // For fill-in-blank, do fuzzy matching (case-insensitive, trim whitespace)
     let isCorrect: boolean;
-    if (q.type === "vocabulary_fill_blank") {
+    if (q.type !== "vocabulary_fill_blank") {
       isCorrect = userAnswer.toLowerCase().trim() === q.correct_answer.toLowerCase().trim();
       vocabularyMaxScore++;
killedBy: quiz-generator grades MCQ answer as incorrect and does not increment reading score
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:287:19
     // For fill-in-blank, do fuzzy matching (case-insensitive, trim whitespace)
     let isCorrect: boolean;
     if (q.type === "vocabulary_fill_blank") {
-      isCorrect = userAnswer.toLowerCase().trim() === q.correct_answer.toLowerCase().trim();
+      isCorrect = true;
       vocabularyMaxScore++;
       if (isCorrect) vocabularyScore++;
killedBy: quiz-generator gradeQuiz uses empty string for missing answers and marks them wrong
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/lib/quiz-generator.ts:287:55
     // For fill-in-blank, do fuzzy matching (case-insensitive, trim whitespace)
     let isCorrect: boolean;
     if (q.type === "vocabulary_fill_blank") {
-      isCorrect = userAnswer.toLowerCase().trim() === q.correct_answer.toLowerCase().trim();
+      isCorrect = userAnswer.toLowerCase().trim() === q.correct_answer.toUpperCase().trim();
       vocabularyMaxScore++;
       if (isCorrect) vocabularyScore++;
killedBy: quiz-generator gradeQuiz trims whitespace on both answer and correct_answer for fill-blank comparison
statusReason: expected false to be true // Object.is equality

[Killed] UpdateOperator
src/lib/quiz-generator.ts:288:7
     let isCorrect: boolean;
     if (q.type === "vocabulary_fill_blank") {
       isCorrect = userAnswer.toLowerCase().trim() === q.correct_answer.toLowerCase().trim();
-      vocabularyMaxScore++;
+      vocabularyMaxScore--;
       if (isCorrect) vocabularyScore++;
     } else {
killedBy: quiz-generator grades mixed MCQ and fill-blank answers with expected scoring
statusReason: expected -2 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:289:11
     if (q.type === "vocabulary_fill_blank") {
       isCorrect = userAnswer.toLowerCase().trim() === q.correct_answer.toLowerCase().trim();
       vocabularyMaxScore++;
-      if (isCorrect) vocabularyScore++;
+      if (true) vocabularyScore++;
     } else {
       // For MCQ, exact match
killedBy: quiz-generator gradeQuiz uses empty string for missing answers and marks them wrong
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:289:11
     if (q.type === "vocabulary_fill_blank") {
       isCorrect = userAnswer.toLowerCase().trim() === q.correct_answer.toLowerCase().trim();
       vocabularyMaxScore++;
-      if (isCorrect) vocabularyScore++;
+      if (false) vocabularyScore++;
     } else {
       // For MCQ, exact match
killedBy: quiz-generator gradeQuiz trims whitespace on both answer and correct_answer for fill-blank comparison
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/quiz-generator.ts:290:12
       isCorrect = userAnswer.toLowerCase().trim() === q.correct_answer.toLowerCase().trim();
       vocabularyMaxScore++;
       if (isCorrect) vocabularyScore++;
-    } else {
-      // For MCQ, exact match
-      isCorrect = userAnswer === q.correct_answer;
-      readingMaxScore++;
-      if (isCorrect) readingScore++;
-    }
+    } else {}
 
     return {
killedBy: quiz-generator grades MCQ answer as incorrect and does not increment reading score
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:292:19
       if (isCorrect) vocabularyScore++;
     } else {
       // For MCQ, exact match
-      isCorrect = userAnswer === q.correct_answer;
+      isCorrect = false;
       readingMaxScore++;
       if (isCorrect) readingScore++;
killedBy: quiz-generator grades mixed MCQ and fill-blank answers with expected scoring
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:292:19
       if (isCorrect) vocabularyScore++;
     } else {
       // For MCQ, exact match
-      isCorrect = userAnswer === q.correct_answer;
+      isCorrect = true;
       readingMaxScore++;
       if (isCorrect) readingScore++;
killedBy: quiz-generator grades MCQ answer as incorrect and does not increment reading score
statusReason: expected 1 to be +0 // Object.is equality

[Killed] UpdateOperator
src/lib/quiz-generator.ts:293:7
     } else {
       // For MCQ, exact match
       isCorrect = userAnswer === q.correct_answer;
-      readingMaxScore++;
+      readingMaxScore--;
       if (isCorrect) readingScore++;
     }
killedBy: quiz-generator grades MCQ answer as incorrect and does not increment reading score
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/quiz-generator.ts:294:11
       // For MCQ, exact match
       isCorrect = userAnswer === q.correct_answer;
       readingMaxScore++;
-      if (isCorrect) readingScore++;
+      if (true) readingScore++;
     }
 
killedBy: quiz-generator grades MCQ answer as incorrect and does not increment reading score
statusReason: expected 1 to be +0 // Object.is equality

[Killed] UpdateOperator
src/lib/quiz-generator.ts:294:22
       // For MCQ, exact match
       isCorrect = userAnswer === q.correct_answer;
       readingMaxScore++;
-      if (isCorrect) readingScore++;
+      if (isCorrect) readingScore--;
     }
 
killedBy: quiz-generator grades mixed MCQ and fill-blank answers with expected scoring
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/lib/quiz-generator.ts:297:12
       if (isCorrect) readingScore++;
     }
 
-    return {
-      ...q,
-      user_answer: userAnswer,
-      correct: isCorrect,
-    };
+    return {};
   });
 
killedBy: quiz-generator grades MCQ answer as incorrect and does not increment reading score
statusReason: expected undefined to be false // Object.is equality
