[Killed] ConditionalExpression
src/lib/spaced-repetition.ts:153:10
   const today = new Date();
   today.setHours(0, 0, 0, 0);
   reviewDate.setHours(0, 0, 0, 0);
-  return reviewDate <= today;
+  return false;
 }
 
killedBy: FlashcardReview supports keyboard shortcuts for flip and response
statusReason: Unable to find an element with the text: Session Complete!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fixed inset-0 bg-background z-50 flex flex-col overflow-hidden"
    >
